{
  "id" : 13,
  "name" : "الرَّعْد",
  "type" : "مدنيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "المر ۚ تِلْكَ آيَاتُ الْكِتَابِ ۗ وَالَّذِي أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ (1) ",
    "tafsir" : "[ وهي مكية ]\nأما الكلام على الحروف المقطعة في أوائل السورة قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة  السجدة و  وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال ألم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحكى مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى ألم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه وليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى  وتطلق ويراد بها الرجل المطيع لله كقوله تعالى  وتطلق ويراد بها الجماعة كقوله تعالى  وقوله تعالى  وتطلق ويراد بها الحين من الدهر كقوله تعالى  أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسئلة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسئلة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث  الحديث قال سفيان هو أن يقول في اقتل وقال خصيف عن مجاهد أنه قال فواتح السور كلها وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا  ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها إسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل  وثلاثة مثل  وأربعة مثل  وخمسة مثل  لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك  ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى  وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن اسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة  فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه  فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك ؟ فقال رسول الله صلى الله عليه وسلم  فقالوا جاءك بهذا جبريل من عند الله؟ فقال  قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال  قال ما ذاك؟ قال  قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال  قال ما ذاك؟ قال  قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال  قال ماذا قال  قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم  فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.( تلك آيات الكتاب ) أي : هذه آيات الكتاب ، وهو القرآن ، وقيل : التوارة والإنجيل . قاله مجاهد وقتادة ، وفيه نظر بل هو بعيد .\nثم عطف على ذلك عطف صفات ، قوله : ( والذي أنزل إليك ) أي : يا محمد ، ( من ربك الحق ) خبر تقدم مبتدؤه ، وهو قوله : ( والذي أنزل إليك من ربك ) هذا هو الصحيح المطابق لتفسير مجاهد وقتادة . واختار ابن جرير أن تكون الواو زائدة أو عاطفة صفة على صفة كما قدمنا ، واستشهد بقول الشاعر :\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم( ولكن أكثر الناس لا يؤمنون )( وما أكثر الناس ولو حرصت بمؤمنين )[ يوسف : 103 ] أي : مع هذا البيان والجلاء والوضوح ، لا يؤمن أكثرهم لما فيهم من الشقاق والعناد والنفاق ."
  }, {
    "id" : 2,
    "eya" : "اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ۚ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُم بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ (2) ",
    "tafsir" : "[ الله ]( الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علما )[ الطلاق : 12 ] وفي الحديث :  والعرش لا يقدر قدره إلا الله ، عز وجل ، وجاء عن بعض السلف أن بعد ما بين العرش إلى الأرض مسيرة خمسين ألف سنة ، وبعد ما بين قطريه مسيرة خمسين ألف سنة ، وهو من ياقوتة حمراء .( بغير عمد ترونها ) روي عن ابن عباس ، ومجاهد ، والحسن ، وقتادة : أنهم : قالوا : لها عمد ولكن لا ترى .\nوقال إياس بن معاوية : السماء على الأرض مثل القبة ، يعني بلا عمد . وكذا روي عن قتادة ، وهذا هو اللائق بالسياق . والظاهر من قوله تعالى : ( ويمسك السماء أن تقع على الأرض إلا بإذنه )[ الحج : 65 ] فعلى هذا يكون قوله : ( ترونها ) تأكيدا لنفي ذلك ، أي : هي مرفوعة بغير عمد كما ترونها . هذا هو الأكمل في القدرة . وفي شعر أمية بن أبي الصلت الذي آمن شعره وكفر قلبه ، كما ورد في الحديث ويروى لزيد بن عمرو بن نفيل ، رحمه الله ورضي عنه :\nوأنت الذي من فضل من ورحمة بعثت إلى موسى رسولا مناديا     فقلت له : فاذهب وهارون فادعوا\nإلى الله فرعون الذي كان طاغيا     وقولا له : هل أنت سويت هذه\nبلا [ وتد حتى اطمأنت كما هيا     وقولا له : أأنت رفعت هذه\nبلا ] عمد أرفق إذا بك بانيا ؟     وقولا له : هل أنت سويت وسطها\nمنيرا إذا ما جنك الليل هاديا وقولا له : من يرسل الشمس غدوة\nفيصبح ما مست من الأرض ضاحيا ؟     وقولا له : من ينبت الحب في الثرى\nفيصبح منه العشب يهتز رابيا ؟     ويخرج منه حبه في رءوسه\nففي ذاك آيات لمن كان واعيا( ثم استوى على العرش ) تقدم تفسير ذلك في سورة  وأنه يمرر كما جاء من غير تكييف ، ولا تشبيه ، ولا تعطيل ، ولا تمثيل ، تعالى الله علوا كبيرا .( وسخر الشمس والقمر كل يجري لأجل مسمى ) قيل : المراد أنهما يجريان إلى انقطاعهما بقيام الساعة ، كما في قوله تعالى : ( والشمس تجري لمستقر لها ذلك تقدير العزيز العليم )[ يس : 38 ]\nوقيل : المراد إلى مستقرهما ، وهو تحت العرش مما يلي بطن الأرض من الجانب الآخر ، فإنهما وسائر الكواكب إذا وصلوا هنالك ، يكونون أبعد ما يكون عن العرش; لأنه على الصحيح الذي تقوم عليه الأدلة ، قبة مما يلي العالم من هذا الوجه ، وليس بمحيط كسائر الأفلاك; لأنه له قوائم وحملة يحملونه . ولا يتصور هذا في الفلك المستدير ، وهذا واضح لمن تدبر ما وردت به الآيات والأحاديث الصحيحة ، ولله الحمد والمنة .\nوذكر الشمس والقمر; لأنهما أظهر الكواكب السيارة السبعة ، التي هي أشرف وأعظم .\nمن الثوابت ، فإذا كان قد سخر هذه ، فلأن يدخل في التسخير سائر الكواكب بطريق الأولى والأحرى ، كما نبه بقوله تعالى : ( لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون )[ فصلت : 37 ] مع أنه قد صرح بذلك بقوله ( والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين )[ الأعراف : 54 ]( يفصل الآيات لعلكم بلقاء ربكم توقنون ) أي : يوضح الآيات والدلالات الدالة على أنه لا إله إلا هو ، وأنه يعيد الخلق إذا شاء كما ابتدأ خلقه ."
  }, {
    "id" : 3,
    "eya" : "وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا ۖ وَمِن كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ يُغْشِي اللَّيْلَ النَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ (3) ",
    "tafsir" : "( وهو الذي مد الأرض ) أي : جعلها متسعة ممتدة في الطول والعرض ، وأرساها بجبال راسيات شامخات ، وأجرى فيها الأنهار والجداول والعيون لسقي ما جعل فيها من الثمرات المختلفة الألوان والأشكال والطعوم والروائح ، من كل زوجين اثنين ، أي : من كل شكل صنفان .( يغشي الليل النهار ) أي : جعل كلا منهما يطلب الآخر طلبا حثيثا ، فإذا ذهب هذا غشيه هذا ، وإذا انقضى هذا جاء الآخر ، فيتصرف أيضا في الزمان كما تصرف في المكان والسكان .( إن في ذلك لآيات لقوم يتفكرون ) أي : في آلاء الله وحكمته ودلائله ."
  }, {
    "id" : 4,
    "eya" : "وَفِي الْأَرْضِ قِطَعٌ مُّتَجَاوِرَاتٌ وَجَنَّاتٌ مِّنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ (4) ",
    "tafsir" : "( وفي الأرض قطع متجاورات ) أي : أراض تجاور بعضها بعضا ، مع أن هذه طيبة تنبت ما ينتفع به الناس ، وهذه سبخة مالحة لا تنبت شيئا . هكذا روي عن ابن عباس ، ومجاهد ، وسعيد بن جبير ، والضحاك ، وغيرهم .\nوكذا يدخل في هذه الآية اختلاف ألوان بقاع الأرض ، فهذه تربة حمراء ، وهذه بيضاء ، وهذه صفراء ، وهذه سوداء ، وهذه محجرة وهذه سهلة ، وهذه مرملة ، وهذه سميكة ، وهذه رقيقة ، والكل متجاورات . فهذه بصفتها ، وهذه بصفتها الأخرى ، فهذا كله مما يدل على الفاعل المختار ، لا إله إلا هو ، ولا رب سواه .( وجنات من أعناب وزرع ونخيل ) يحتمل أن تكون عاطفة على ) جنات ) فيكون ( وزرع ونخيل ) مرفوعين . ويحتمل أن يكون معطوفا على أعناب ، فيكون مجرورا; ولهذا قرأ بكل منهما طائفة من الأئمة .( صنوان وغير صنوان ) الصنوان : هي الأصول المجتمعة في منبت واحد ، كالرمان والتين وبعض النخيل ، ونحو ذلك . وغير الصنوان : ما كان على أصل واحد ، كسائر الأشجار ، ومنه سمي عم الرجل صنو أبيه ، كما جاء في الحديث الصحيح : أن رسول الله - صلى الله عليه وسلم - قال لعمر : \nوقال سفيان الثوري ، وشعبة ، عن أبى إسحاق ، عن البراء ، رضي الله عنه : الصنوان : هي النخلات في أصل واحد ، وغير الصنوان : المتفرقات . وقاله ابن عباس ، ومجاهد ، والضحاك ، وقتادة ، وعبد الرحمن بن زيد بن أسلم .( يسقى بماء واحد ونفضل بعضها على بعض في الأكل ) قال الأعمش ، عن أبي صالح ، عن أبي هريرة ، رضي الله عنه ، عن النبي ، صلى الله عليه وسلم : ( ونفضل بعضها على بعض في الأكل ) . رواه الترمذي وقال : حسن غريب .\nأي : هذا الاختلاف في أجناس الثمرات والزروع ، في أشكالها وألوانها ، وطعومها وروائحها ، وأوراقها وأزهارها .\nفهذا في غاية الحلاوة وذا في غاية الحموضة ، وذا في غاية المرارة وذا عفص ، وهذا عذب وهذا جمع هذا وهذا ، ثم يستحيل إلى طعم آخر بإذن الله تعالى . وهذا أصفر وهذا أحمر ، وهذا أبيض وهذا أسود وهذا أزرق . وكذلك الزهورات مع أن كلها يستمد من طبيعة واحدة ، وهو الماء ، مع هذا الاختلاف الكبير الذي لا ينحصر ولا ينضبط ، ففي ذلك آيات لمن كان واعيا ، وهذا من أعظم الدلالات على الفاعل المختار ، الذي بقدرته فاوت بين الأشياء وخلقها على ما يريد; ولهذا قال تعالى : ( إن في ذلك لآيات لقوم يعقلون )"
  }, {
    "id" : 5,
    "eya" : "۞ وَإِن تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ (5) ",
    "tafsir" : "( وإن تعجب ) من تكذيب هؤلاء المشركين بأمر المعاد مع ما يشاهدونه من آيات الله سبحانه ودلالاته في خلقه على أنه القادر على ما يشاء ، ومع ما يعترفون به من أنه ابتدأ خلق الأشياء ، فكونها بعد أن لم تكن شيئا مذكورا ، ثم هم بعد هذا يكذبون خبره في أنه سيعيد العالمين خلقا جديدا ، وقد اعترفوا وشاهدوا ما هو أعجب مما كذبوا به ، فالعجب من قولهم : ( أئذا كنا ترابا أئنا لفي خلق جديد ) وقد علم كل عالم وعاقل أن خلق السماوات والأرض أكبر من خلق الناس ، وأن من بدأ الخلق فالإعادة سهلة عليه ، كما قال تعالى : ( أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير )\nثم نعت المكذبين بهذا فقال : ( أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم ) أي : يسحبون بها في النار ، ( وأولئك أصحاب النار هم فيها خالدون ) أي : ماكثون فيها أبدا ، لا يحولون عنها ولا يزولون ."
  }, {
    "id" : 6,
    "eya" : "وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِن قَبْلِهِمُ الْمَثُلَاتُ ۗ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِّلنَّاسِ عَلَىٰ ظُلْمِهِمْ ۖ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ (6) ",
    "tafsir" : "( ويستعجلونك ) أي : هؤلاء المكذبون ( بالسيئة قبل الحسنة ) أي : بالعقوبة ، كما أخبر عنهم في قوله : ( وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون لو ما تأتينا بالملائكة إن كنت من الصادقين ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين )[ الحجر : 6 - 8 ] وقال تعالى : ( ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون يستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين )[ العنكبوت : 53 ، 54 ]( سأل سائل بعذاب واقع )[ المعارج : 1 ]( يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق )[ الشورى : 18 ]( وقالوا ربنا عجل لنا قطنا قبل يوم الحساب ) أي : حسابنا وعقابنا ، كما قال مخبرا عنهم : ( وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم )[ الأنفال : 32 ] فكانوا يطلبون من الرسول أن يأتيهم بعذاب الله ، وذلك من شدة تكذيبهم وكفرهم وعنادهم .\nقال الله تعالى : ( وقد خلت من قبلهم المثلات ) أي : قد أوقعنا نقمتنا بالأمم الخالية وجعلناهم مثلة وعبرة وعظة لمن اتعظ بهم .\nثم أخبر تعالى أنه لولا حلمه وعفوه [ وغفره ] لعاجلهم بالعقوبة ، كما قال تعالى : ( ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة )[ فاطر : 45 ]\nوقال تعالى في هذه الآية الكريمة : ( وإن ربك لذو مغفرة للناس على ظلمهم ) أي : إنه ذو عفو وصفح وستر للناس مع أنهم يظلمون ويخطئون بالليل والنهار . ثم قرن هذا الحكم بأنه شديد العقاب ، ليعتدل الرجاء والخوف ، كما قال تعالى : ( فإن كذبوك فقل ربكم ذو رحمة واسعة ولا يرد بأسه عن القوم المجرمين )[ الأنعام : 147 ]( إن ربك لسريع العقاب وإنه لغفور رحيم )[ الأعراف : 167 ]( نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم )[ الحجر : 49 ، 50 ] إلى أمثال ذلك من الآيات التي تجمع الرجاء والخوف .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا حماد ، عن علي بن زيد ، عن سعيد بن المسيب قال : لما نزلت هذه الآية : ( وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب ) قال رسول الله ، صلى الله عليه وسلم : \nوروى الحافظ ابن عساكر في ترجمة الحسن بن عثمان أبي حسان الزيادي : أنه رأى رب العزة في النوم - ورسول الله صلى الله عليه وسلم - واقف بين يديه يشفع في رجل من أمته ، فقال له : ألم يكفك أني أنزلت عليك في سورة الرعد : ( وإن ربك لذو مغفرة للناس على ظلمهم ) ؟ قال : ثم انتبهت ."
  }, {
    "id" : 7,
    "eya" : "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۗ إِنَّمَا أَنتَ مُنذِرٌ ۖ وَلِكُلِّ قَوْمٍ هَادٍ (7) ",
    "tafsir" : "( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا )[ الإسراء : 59 ]\nقال الله تعالى : ( إنما أنت منذر ) أي : إنما عليك أن تبلغ رسالة الله التي أمرك بها ، ( ليس عليك هداهم ولكن الله يهدي من يشاء )[ البقرة : 272 ]( ولكل قوم هاد ) قال علي بن أبي طلحة ، عن ابن عباس ، أي : ولكل قوم داع .\nوقال العوفي ، عن ابن عباس في تفسيرهما : يقول الله تعالى : أنت يا محمد منذر ، وأنا هادي كل قوم ، وكذا قال مجاهد ، وسعيد بن جبير ، والضحاك .( ولكل قوم هاد ) أي : نبي . كما قال : ( وإن من أمة إلا خلا فيها نذير )[ فاطر : 24 ] وبه قال قتادة ، وعبد الرحمن بن زيد .\nوقال أبو صالح ، ويحيى بن رافع : ( ولكل قوم هاد ) أي : قائد .\nوقال أبو العالية : الهادي : القائد ، والقائد : الإمام ، والإمام : العمل .\nوعن عكرمة ، وأبي الضحى : ( ولكل قوم هاد ) قالا هو محمد [ رسول الله ] صلى الله عليه وسلم .( ولكل قوم هاد ) من يدعوهم إلى الله ، عز وجل .\nوقال أبو جعفر بن جرير : حدثني أحمد بن يحيى الصوفي ، حدثنا الحسن بن الحسين الأنصاري ، حدثنا معاذ بن مسلم بياع الهروي ، عن عطاء بن السائب ، عن سعيد بن جبير ، عن ابن عباس ، رضي الله عنهما ، قال : لما نزلت : ( إنما أنت منذر ولكل قوم هاد ) قال : وضع رسول الله - صلى الله عليه وسلم - يده على صدره ، وقال :  . وأومأ بيده إلى منكب علي ، فقال : \nوهذا الحديث فيه نكارة شديدة .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا عثمان بن أبي شيبة ، حدثنا المطلب بن زياد ، عن السدي ، عن عبد خير ، عن علي : ( ولكل قوم هاد ) قال : الهادي : رجل من بني هاشم . قال الجنيد هو علي بن أبي طالب ، رضي الله عنه .\nقال ابن أبي حاتم : وروي عن ابن عباس ، في إحدى الروايات ، وعن أبي جعفر محمد بن علي ، نحو ذلك ."
  }, {
    "id" : 8,
    "eya" : "اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ ۖ وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ (8) ",
    "tafsir" : "( ويعلم ما في الأرحام )[ لقمان : 34 ] أي : ما حملت من ذكر أو أنثى ، أو حسن أو قبيح ، أو شقي أو سعيد ، أو طويل العمر أو قصيره ، كما قال تعالى : ( هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة في بطون أمهاتكم فلا تزكوا أنفسكم هو أعلم بمن اتقى )[ النجم : 32 ]\nوقال تعالى : ( يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث )[ الزمر : 6 ] أي : خلقكم طورا من بعد طور ، كما قال تعالى : ( ولقد خلقنا الإنسان من سلالة من طين ثم جعلناه نطفة في قرار مكين ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما فكسونا العظام لحما ثم أنشأناه خلقا آخر فتبارك الله أحسن الخالقين )[ المؤمنون : 12 - 14 ] وفي الصحيحين عن ابن مسعود قال : قال رسول الله ، صلى الله عليه وسلم : \nوفي الحديث الآخر : ( وما تغيض الأرحام وما تزداد ) قال البخاري : حدثنا إبراهيم بن المنذر ، حدثنا معن ، حدثنا مالك ، عن عبد الله بن دينار ، عن ابن عمر ; أن رسول الله - صلى الله عليه وسلم - قال : \nوقال العوفي ، عن ابن عباس : ( وما تغيض الأرحام ) يعني : السقط ( وما تزداد ) يقول : ما زادت الرحم في الحمل على ما غاضت حتى ولدته تماما . وذلك أن من النساء من تحمل عشرة أشهر ، ومنهن من تحمل تسعة أشهر ، ومنهن من تزيد في الحمل ، ومنهن من تنقص ، فذلك الغيض والزيادة التي ذكر الله تعالى ، وكل ذلك بعلمه تعالى .\nوقال الضحاك ، عن ابن عباس في قوله : ( وما تغيض الأرحام وما تزداد ) قال : ما نقصت من تسعة وما زاد عليها .\nوقال الضحاك : وضعتني أمي وقد حملتني في بطنها سنتين ، وولدتني وقد نبتت ثنيتي .\nوقال ابن جريج ، عن جميلة بنت سعد ، عن عائشة قالت : لا يكون الحمل أكثر من سنتين ، قدر ما يتحرك ظل مغزل .\nوقال مجاهد : ( وما تغيض الأرحام وما تزداد ) قال : ما ترى من الدم في حملها ، وما تزداد على تسعة أشهر . وبه قال عطية العوفي وقتادة ، والحسن البصري ، والضحاك .\nوقال مجاهد أيضا : إذا رأت المرأة الدم دون التسعة زاد على التسعة ، مثل أيام الحيض . وقاله عكرمة ، وسعيد بن جبير ، وابن زيد .\nوقال مجاهد أيضا : ( وما تغيض الأرحام ) إراقة المرأة حتى يخس الولد ( وما تزداد ) إن لم تهرق المرأة تم الولد وعظم .\nوقال مكحول : الجنين في بطن أمه لا يطلب ، ولا يحزن ولا يغتم ، وإنما يأتيه رزقه في بطن أمه من دم حيضتها فمن ثم لا تحيض الحامل . فإذا وقع إلى الأرض استهل ، واستهلاله استنكار لمكانه ، فإذا قطعت سرته حول الله رزقه إلى ثديي أمه حتى لا يطلب ولا يحزن ولا يغتم ، ثم يصير طفلا يتناول الشيء بكفه فيأكله ، فإذا هو بلغ قال : هو الموت أو القتل ، أنى لي بالرزق ؟ فيقول مكحول : يا ويلك ! غذاك وأنت في بطن أمك ، وأنت طفل صغير ، حتى إذا اشتددت وعقلت قلت : هو الموت أو القتل ، أنى لي بالرزق ؟ ثم قرأ مكحول : ( الله يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار )\nوقال قتادة : ( وكل شيء عنده بمقدار ) أي : بأجل ، حفظ أرزاق خلقه وآجالهم ، وجعل لذلك أجلا معلوما .\nوفي الحديث الصحيح : أن إحدى بنات النبي - صلى الله عليه وسلم - بعثت إليه : أن ابنا لها في الموت ، وأنها تحب أن يحضره . فبعث إليها يقول :  الحديث بتمامه"
  }, {
    "id" : 9,
    "eya" : "عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ (9) ",
    "tafsir" : "( عالم الغيب والشهادة ) أي : يعلم كل شيء مما يشاهده العباد ومما يغيب عنهم ، ولا يخفى عليه منه شيء . ) الكبير ) الذي هو أكبر من كل شيء ، ( المتعال ) أي : على كل شيء ، قد أحاط بكل شيء علما ، وقهر كل شيء ، فخضعت له الرقاب ودان له العباد ، طوعا وكرها ."
  }, {
    "id" : 10,
    "eya" : "سَوَاءٌ مِّنكُم مَّنْ أَسَرَّ الْقَوْلَ وَمَن جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَسَارِبٌ بِالنَّهَارِ (10) ",
    "tafsir" : "( وإن تجهر بالقول فإنه يعلم السر وأخفى )[ طه : 7 ]( ويعلم ما تخفون وما تعلنون )[ النمل : 25 ] وقالت عائشة ، رضي الله عنها : سبحان الذي وسع سمعه الأصوات ، والله لقد جاءت المجادلة تشتكي زوجها إلى رسول الله - صلى الله عليه وسلم - وأنا في جنب البيت ، وإنه ليخفى علي بعض كلامها ، فأنزل الله : ( قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله والله يسمع تحاوركما إن الله سميع بصير )[ المجادلة : 1 ]( ومن هو مستخف بالليل ) أي : مختف في قعر بيته في ظلام الليل ، ( وسارب بالنهار ) أي : ظاهر ماش في بياض النهار وضيائه ، فإن كليهما في علم الله على السواء ، كما قال تعالى : ( ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون )[ هود : 5 ] وقال تعالى : ( وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه وما يعزب عن ربك من مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين )[ يونس : 61 ]"
  }, {
    "id" : 11,
    "eya" : "لَهُ مُعَقِّبَاتٌ مِّن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنفُسِهِمْ ۗ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ ۚ وَمَا لَهُم مِّن دُونِهِ مِن وَالٍ (11) ",
    "tafsir" : "( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) أي : للعبد ملائكة يتعاقبون عليه ، حرس بالليل وحرس بالنهار ، يحفظونه من الأسواء والحادثات ، كما يتعاقب ملائكة آخرون لحفظ الأعمال من خير أو شر ، ملائكة بالليل وملائكة بالنهار ، فاثنان عن اليمين و [ عن ] الشمال يكتبان الأعمال ، صاحب اليمين يكتب الحسنات ، وصاحب الشمال يكتب السيئات ، وملكان آخران يحفظانه ويحرسانه ، واحدا من ورائه وآخر من قدامه ، فهو بين أربعة أملاك بالنهار ، وأربعة آخرين بالليل بدلا حافظان وكاتبان ، كما جاء في الصحيح :  وفي الحديث الآخر :  . وقال علي بن أبي طلحة ، عن ابن عباس : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) والمعقبات من أمر الله ، وهي الملائكة .\nوقال عكرمة ، عن ابن عباس : ( يحفظونه من أمر الله ) قال : ملائكة يحفظونه من بين يديه ومن خلفه ، فإذا جاء قدر الله خلوا عنه .\nوقال مجاهد : ما من عبد إلا له ملك موكل ، يحفظه في نومه ويقظته من الجن والإنس والهوام ، فما منها شيء يأتيه يريده إلا قال الملك : وراءك إلا شيء يأذن الله فيه فيصيبه .\nوقال الثوري عن حبيب بن أبي ثابت ، عن سعيد بن جبير ، عن ابن عباس : ( له معقبات من بين يديه ومن خلفه ) قال : ذلك ملك من ملوك الدنيا ، له حرس من دونه حرس .\nوقال العوفي ، عن ابن عباس : ( له معقبات من بين يديه ومن خلفه ) يعني : ولي الشيطان ، يكون عليه الحرس . وقال عكرمة في تفسيرها : هؤلاء الأمراء : المواكب من بين يديه ومن خلفه .\nوقال الضحاك : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) قال : هو السلطان المحترس من أمر الله ، وهم أهل الشرك .\nوالظاهر ، والله أعلم ، أن مراد ابن عباس وعكرمة والضحاك بهذا أن حرس الملائكة للعبيد يشبه حرس هؤلاء لملوكهم وأمرائهم .\nوقد روى الإمام أبو جعفر بن جرير هاهنا حديثا غريبا جدا فقال :\nحدثني المثنى ، حدثنا إبراهيم بن عبد السلام بن صالح القشيري ، حدثنا علي بن جرير ، عن حماد بن سلمة ، عن عبد الحميد بن جعفر ، عن كنانة العدوي قال : دخل عثمان بن عفان على رسول الله صلى الله عليه وسلم . فقال : يا رسول الله ، أخبرني عن العبد ، كم معه من ملك ؟ فقال :  . يقول الله : ( ما يلفظ من قول إلا لديه رقيب عتيد )[ ق : 18 ] وملكان من بين يديك ومن خلفك ، يقول الله : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) وملك قابض على ناصيتك ، فإذا تواضعت لله رفعك ، وإذا تجبرت على الله قصمك ، وملكان على شفتيك ، ليس يحفظان عليك إلا الصلاة على محمد - صلى الله عليه وسلم - وملك قائم على فيك لا يدع الحية أن تدخل في فيك ، وملكان على عينيك فهؤلاء عشرة أملاك على كل آدمي ينزلون ملائكة الليل على ملائكة النهار; لأن ملائكة الليل سوى ملائكة النهار ، فهؤلاء عشرون ملكا على كل آدمي وإبليس بالنهار وولده بالليل \" .\nقال الإمام أحمد ، رحمه الله : حدثنا أسود بن عامر ، حدثنا سفيان ، حدثني منصور ، عن سالم بن أبي الجعد عن أبيه ، عن عبد الله قال : قال رسول الله ، صلى الله عليه وسلم :  . قالوا : وإياك يا رسول الله ، قال : \nانفرد بإخراجه مسلم .( يحفظونه من أمر الله ) قيل : المراد حفظهم له من أمر الله . رواه علي بن أبي طلحة ، وغيره ، عن ابن عباس . وإليه ذهب مجاهد ، وسعيد بن جبير ، وإبراهيم النخعي ، وغيرهم .\nوقال قتادة : ( يحفظونه من أمر الله ) قال : وفي بعض القراءات : \nوقال كعب الأحبار : لو تجلى لابن آدم كل سهل وحزن ، لرأى كل شيء من ذلك شياطين لولا أن الله وكل بكم ملائكة عنكم في مطعمكم ومشربكم وعوراتكم ، إذا لتخطفتم .\nوقال أبو أمامة ما من آدمي إلا ومعه ملك يذود عنه ، حتى يسلمه للذي قدر له .\nوقال أبو مجلز : جاء رجل من مراد إلى علي ، رضي الله عنه ، وهو يصلي ، فقال : احترس ، فإن ناسا من مراد يريدون قتلك . فقال : إن مع كل رجل ملكين يحفظانه مما لم يقدر ، فإذا جاء القدر خليا بينه وبينه ، وإن الأجل جنة حصينة .\nوقال بعضهم : ( يحفظونه من أمر الله ) بأمر الله ، كما جاء في الحديث أنهم قالوا : يا رسول الله ، أرأيت رقى نسترقي بها ، هل ترد من قدر الله شيئا ؟ فقال : \nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا حفص بن غياث ، عن أشعث ، عن جهم ، عن إبراهيم قال : أوحى الله إلى نبي من أنبياء بني إسرائيل : أن قل لقومك : إنه ليس من أهل قرية ولا أهل بيت يكونون على طاعة الله فيتحولون منها إلى معصية الله ، إلا تحول لهم مما يحبون إلى ما يكرهون ، ثم قال : إن مصداق ذلك في كتاب الله : ( إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم )\nوقد ورد هذا في حديث مرفوع ، فقال الحافظ محمد بن عثمان بن أبي شيبة في كتابه  : حدثنا الحسن بن علي ، حدثنا الهيثم بن الأشعث السلمي ، حدثنا أبو حنيفة اليمامي الأنصاري ، عن عمير بن عبد الله قال : خطبنا علي بن أبي طالب على منبر الكوفة ، قال : كنت إذا سكت عن رسول الله - صلى الله عليه وسلم - ابتدأني ، وإذا سألته عن الخبر أنبأني ، وإنه حدثني عن ربه ، عز وجل ، قال : \nوهذا غريب ، وفي إسناده من لا أعرفه ."
  }, {
    "id" : 12,
    "eya" : "هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنشِئُ السَّحَابَ الثِّقَالَ (12) ",
    "tafsir" : "\nوروى ابن جرير أن ابن عباس كتب إلى أبي الجلد يسأله عن البرق ، فقال : البرق : الماء .( خوفا وطمعا ) قال قتادة : خوفا للمسافر ، يخاف أذاه ومشقته ، وطمعا للمقيم يرجو بركته ومنفعته ، ويطمع في رزق الله .( وينشئ السحاب الثقال ) أي : ويخلقها منشأة جديدة ، وهي لكثرة مائها ثقيلة قريبة إلى الأرض .\nقال مجاهد : والسحاب الثقال : الذي فيه الماء ."
  }, {
    "id" : 13,
    "eya" : "وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَن يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ (13) ",
    "tafsir" : "( ويسبح الرعد بحمده ) كما قال تعالى : ( وإن من شيء إلا يسبح بحمده )[ الإسراء : 44 ]\nوقال الإمام أحمد : حدثنا يزيد ، حدثنا إبراهيم بن سعد ، أخبرني أبي قال : كنت جالسا إلى جنب حميد بن عبد الرحمن في المسجد ، فمر شيخ من بني غفار ، فأرسل إليه حميد ، فلما أقبل قال : يا ابن أخي ، وسع له فيما بيني وبينك ، فإنه قد صحب رسول الله صلى الله عليه وسلم . فجاء حتى جلس فيما بيني وبينه ، فقال له حميد : ما الحديث الذي حدثتني عن رسول الله ، صلى الله عليه وسلم ؟ فقال الشيخ : سمعت رسول الله - صلى الله عليه وسلم - يقول : \nوالمراد - والله أعلم - أن نطقها الرعد ، وضحكها البرق .\nوقال موسى بن عبيدة ، عن سعد بن إبراهيم قال : يبعث الله الغيث ، فلا أحسن منه مضحكا ، ولا آنس منه منطقا ، فضحكه البرق ، ومنطقه الرعد .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا هشام بن عبيد الله الرازي ، عن محمد بن مسلم قال : بلغنا أن البرق ملك له أربعة وجوه : وجه إنسان ، ووجه ثور ، ووجه نسر ، ووجه أسد ، فإذا مصع بذنبه فذاك البرق .\nوقال الإمام أحمد : حدثنا عفان ، حدثنا عبد الواحد بن زياد ، حدثنا الحجاج ، حدثني أبو مطر ، عن سالم ، عن أبيه قال : كان رسول الله - صلى الله عليه وسلم - إذا سمع الرعد والصواعق قال : \nورواه الترمذي ، والبخاري في كتاب الأدب ، والنسائي في اليوم والليلة ، والحاكم في مستدركه ، من حديث الحجاج بن أرطاة ، عن أبي مطر ، ولم يسم به .[ الإمام ] أبو جعفر بن جرير : حدثنا أحمد بن إسحاق ، حدثنا أبو أحمد ، حدثنا إسرائيل ، عن أبيه عن رجل ، عن أبي هريرة ، رفع الحديث قال : إنه كان إذا سمع الرعد قال : \nوروي عن علي - رضي الله عنه - أنه كان إذا سمع صوت الرعد قال : سبحان من سبحت له .\nوكذا روي عن ابن عباس ، والأسود بن يزيد ، وطاوس : أنهم كانوا يقولون كذلك .\nوقال الأوزاعي : كان ابن أبي زكريا يقول : من قال حين يسمع الرعد : سبحان الله وبحمده ، لم تصبه صاعقة .\nوعن عبد الله بن الزبير أنه كان إذا سمع الرعد ترك الحديث وقال : سبحان الذي يسبح الرعد بحمده والملائكة من خيفته ، ويقول : إن هذا لوعيد شديد لأهل الأرض . رواه مالك في الموطأ ، والبخاري في كتاب الأدب .\nوقال الإمام أحمد : حدثنا سليمان بن داود الطيالسي ، حدثنا صدقة بن موسى ، حدثنا محمد بن واسع ، عن شتير بن نهار ، عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : \nوقال الطبراني : حدثنا زكريا بن يحيى الساجي ، حدثنا أبو كامل الجحدري ، حدثنا يحيى بن كثير أبو النضر ، حدثنا عبد الكريم ، حدثنا عطاء ، عن ابن عباس قال : قال رسول الله ، صلى الله عليه وسلم : ( ويرسل الصواعق فيصيب بها من يشاء ) أي : يرسلها نقمة ينتقم بها ممن يشاء ، ولهذا تكثر في آخر الزمان ، كما قال الإمام أحمد :\nحدثنا محمد بن مصعب ، حدثنا عمارة عن أبي نضرة ، عن أبي سعيد الخدري ، رضي الله عنه; أن النبي - صلى الله عليه وسلم - قال : \nوقد روي في سبب نزولها ما رواه الحافظ أبو يعلى الموصلي :\nحدثنا إسحاق ، حدثنا علي بن أبي سارة الشيباني ، حدثنا ثابت ، عن أنس : أن رسول الله صلى الله عليه وسلم بعث رجلا مرة إلى رجل من فراعنة العرب فقال :  . قال : فذهب إليه فقال : يدعوك رسول الله - صلى الله عليه وسلم - فقال له : من رسول الله ؟ وما الله ؟ أمن ذهب هو ؟ أم من فضة هو ؟ أم من نحاس هو ؟ قال : فرجع إلى رسول الله - صلى الله عليه وسلم - فأخبره ، فقال : يا رسول الله ، قد أخبرتك أنه أعتى من ذلك ، قال لي كذا وكذا . فقال :  . أراه ، فذهب فقال له مثلها . فرجع إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، قد أخبرتك أنه أعتى من ذلك . قال :  . فرجع إليه الثالثة . قال : فأعاد عليه ذلك الكلام . فبينا هو يكلمه ، إذ بعث الله ، عز وجل ، سحابة حيال رأسه ، فرعدت ، فوقعت منها صاعقة ، فذهب بقحف رأسه فأنزل الله : ( ويرسل الصواعق فيصيب بها من يشاء وهم يجادلون في الله وهو شديد المحال )\nورواه ابن جرير ، من حديث علي بن أبي سارة ، به ورواه الحافظ أبو بكر البزار ، عن عبدة بن عبد الله ، عن يزيد بن هارون ، عن ديلم بن غزوان ، عن ثابت ، عن أنس ، فذكر نحوه .\nوقال : حدثنا الحسن بن محمد ، حدثنا عفان ، حدثنا أبان بن يزيد ، حدثنا أبو عمران الجوني ، عن عبد الرحمن بن صحار العبدي : أنه بلغه أن نبي الله بعثه إلى جبار يدعوه ، فقال : أرأيتم ربكم ، أذهب هو ؟ أو فضة هو ؟ ألؤلؤ هو ؟ قال : فبينا هو يجادلهم ، إذ بعث الله سحابة فرعدت فأرسل عليه صاعقة فذهبت بقحف رأسه ، ونزلت هذه الآية .\nوقال أبو بكر بن عياش ، عن ليث بن أبي سليم ، عن مجاهد قال : جاء يهودي فقال : يا محمد ، أخبرني عن ربك ، [ من أي شيء هو ] من نحاس هو ؟ من لؤلؤ ؟ أو ياقوت ؟ قال : فجاءت صاعقة فأخذته ، وأنزل الله : ( ويرسل الصواعق فيصيب بها من يشاء )\nوقال قتادة : ذكر لنا أن رجلا أنكر القرآن ، وكذب النبي - صلى الله عليه وسلم - فأرسل الله صاعقة فأهلكته وأنزل : ( ويرسل الصواعق )\nوذكروا في سبب نزولها قصة عامر بن الطفيل وأربد بن ربيعة لما قدما على رسول الله - صلى الله عليه وسلم - المدينة ، فسألاه أن يجعل لهما نصف الأمر فأبى عليهما رسول الله - صلى الله عليه وسلم - فقال له عامر بن الطفيل ، لعنه الله : أما والله لأملأنها عليك خيلا جردا ورجالا مردا . فقال له رسول الله ، صلى الله عليه وسلم : يأبى الله عليك ذلك وأبناء قيلة . يعني : الأنصار ، ثم إنهما هما بالفتك بالنبي - صلى الله عليه وسلم - وجعل أحدهما يخاطبه ، والآخر يستل سيفه ليقتله من ورائه ، فحماه الله منهما وعصمه ، فخرجا من المدينة فانطلقا في أحياء العرب ، يجمعان الناس لحربه ، عليه السلام فأرسل الله على أربد سحابة فيها صاعقة فأحرقته . وأما عامر بن الطفيل فأرسل الله عليه الطاعون ، فخرجت فيه غدة عظيمة ، فجعل يقول : يا آل عامر ، غدة كغدة البكر ، وموت في بيت سلولية ؟ حتى ماتا لعنهما الله ، وأنزل الله في مثل ذلك :( ويرسل الصواعق فيصيب بها من يشاء ) وفي ذلك يقول لبيد بن ربيعة ، أخو أربد يرثيه :\nأخشى على أربد الحتوف ولا أرهب نوء السماك والأسد     فجعني الرعد والصواعق بال\nفارس يوم الكريهة النجد\nوقال الحافظ أبو القاسم الطبراني : حدثنا مسعدة بن سعد العطار ، حدثنا إبراهيم بن المنذر الحزامي ، حدثني عبد العزيز بن عمران ، حدثني عبد الرحمن وعبد الله ابنا زيد بن أسلم ، عن أبيهما ، عن عطاء بن يسار ، عن ابن عباس ، أن أربد بن قيس بن جزء بن جليد بن جعفر بن كلاب ، وعامر بن الطفيل بن مالك ، قدما المدينة على رسول الله - صلى الله عليه وسلم ، فانتهيا إليه وهو جالس ، فجلسا بين يديه ، فقال عامر بن الطفيل : يا محمد ، ما تجعل لي إن أسلمت ؟ فقال رسول الله ، صلى الله عليه وسلم :  . قال عامر بن الطفيل : أتجعل لي الأمر إن أسلمت من بعدك ؟ قال رسول الله ، صلى الله عليه وسلم :  . قال : أنا الآن في أعنة خيل نجد ، اجعل لي الوبر ولك المدر . قال رسول الله :  . فلما قفلا من عنده قال عامر : أما والله لأملأنها عليك خيلا ورجالا فقال له رسول الله ، صلى الله عليه وسلم :  . فلما خرج أربد وعامر ، قال عامر : يا أربد ، أنا أشغل عنك محمدا - صلى الله عليه وسلم - بالحديث ، فاضربه بالسيف ، فإن الناس إذا قتلت محمدا لم يزيدوا على أن يرضوا بالدية ، ويكرهوا الحرب ، فنعطيهم الدية . قال أربد : أفعل . فأقبلا راجعين إليه ، فقال عامر : يا محمد ، قم معي أكلمك . فقام معه رسول الله - صلى الله عليه وسلم - فجلسا إلى الجدار ، ووقف معه رسول الله - صلى الله عليه وسلم - يكلمه ، وسل أربد السيف ، فلما وضع يده على السيف يبست يده على قائم السيف ، فلم يستطع سل السيف ، فأبطأ أربد على عامر بالضرب ، فالتفت رسول الله - صلى الله عليه وسلم - فرأى أربد ، وما يصنع ، فانصرف عنهما . فلما خرج عامر وأربد من عند رسول الله - صلى الله عليه وسلم - حتى إذا كانا بالحرة ، حرة واقم نزلا فخرج إليهما سعد بن معاذ وأسيد بن حضير فقالا اشخصا يا عدوي الله ، لعنكما الله . فقال عامر : من هذا يا سعد ؟ قال : هذا أسيد بن حضير الكتائب فخرجا حتى إذا كانا بالرقم ، أرسل الله على أربد صاعقة فقتلته ، وخرج عامر حتى إذا كان بالخريم ، أرسل الله قرحة فأخذته فأدركه الليل في بيت امرأة من بني سلول ، فجعل يمس قرحته في حلقه ويقول : غدة كغدة الجمل في بيت سلولية ترغب أن يموت في بيتها! ثم ركب فرسه فأحضره حتى مات عليه راجعا ، فأنزل الله فيهما : ( الله يعلم ما تحمل كل أنثى وما تغيض الأرحام ) إلى قوله : ( وما لهم من دونه من وال )[ الرعد : 8 - 11 ] - قال : المعقبات من أمر الله يحفظون محمدا - صلى الله عليه وسلم - ثم ذكر أربد وما قتله به ، فقال : ( ويرسل الصواعق فيصيب بها من يشاء )( وهم يجادلون في الله ) أي : يشكون في عظمته ، وأنه لا إله إلا هو ، ( وهو شديد المحال )\nقال ابن جرير : شديدة مماحلته في عقوبة من طغى عليه وعتا وتمادى في كفره .\nوهذه الآية شبيهة بقوله : ( ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين )[ النمل : 50 ، 51 ]\nوعن علي ، رضي الله عنه : ( وهو شديد المحال ) أي : شديد الأخذ . وقال مجاهد : شديد القوة ."
  }, {
    "id" : 14,
    "eya" : "لَهُ دَعْوَةُ الْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِن دُونِهِ لَا يَسْتَجِيبُونَ لَهُم بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ ۚ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ (14) ",
    "tafsir" : "( له دعوة الحق ) قال : التوحيد . رواه ابن جرير .\nوقال ابن عباس ، وقتادة ، ومالك عن محمد بن المنكدر : ( له دعوة الحق )[ قال ] لا إله إلا الله .( والذين يدعون من دونه ) أي : ومثل الذين يعبدون آلهة غير الله . ( كباسط كفيه إلى الماء ليبلغ فاه ) قال علي بن أبي طالب : كمثل الذي يتناول الماء من طرف البئر بيده ، وهو لا يناله أبدا بيده ، فكيف يبلغ فاه ؟ .\nوقال مجاهد : ( كباسط كفيه ) يدعو الماء بلسانه ، ويشير إليه [ بيده ] فلا يأتيه أبدا .\nوقيل : المراد كقابض يده على الماء ، فإنه لا يحكم منه على شيء ، كما قال الشاعر :\nفإني وإياكم وشوقا إليكم كقابض ماء لم تسقه أنامله\nفأصبحت مما كان بيني وبينها     من الود مثل القابض الماء باليد\nومعنى الكلام : أن هذا الذي يبسط يده إلى الماء ، إما قابضا وإما متناولا له من بعد ، كما أنه لا ينتفع بالماء الذي لم يصل إلى فيه ، الذي جعله محلا للشرب ، فكذلك هؤلاء المشركون الذين يعبدون مع الله إلها غيره ، لا ينتفعون بهم أبدا في الدنيا ولا في الآخرة; ولهذا قال : ( وما دعاء الكافرين إلا في ضلال )"
  }, {
    "id" : 15,
    "eya" : "وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُم بِالْغُدُوِّ وَالْآصَالِ ۩ (15) ",
    "tafsir" : "( وظلالهم بالغدو ) أي : البكر والآصال ، وهو جمع أصيل وهو آخر النهار ، كما قال تعالى : ( أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون )[ النحل : 48 ]"
  }, {
    "id" : 16,
    "eya" : "قُلْ مَن رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ ۚ قُلْ أَفَاتَّخَذْتُم مِّن دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعًا وَلَا ضَرًّا ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ ۗ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ ۚ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ (16) ",
    "tafsir" : "( نفعا ولا ضرا ) أي : لا تحصل منفعة ، ولا تدفع مضرة . فهل يستوي من عبد هذه الآلهة مع الله ، ومن عبد الله وحده لا شريك له ، وهو على نور من ربه ؟ ولهذا قال : ( قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم ) أي : أجعل هؤلاء المشركون مع الله آلهة تناظر الرب وتماثله في الخلق ، فخلقوا كخلقه ، فتشابه الخلق عليهم ، فلا يدرون أنها مخلوقة من مخلوق غيره ؟ أي : ليس الأمر كذلك ، فإنه لا يشابهه شيء ولا يماثله ، ولا ند له ولا عدل له ، ولا وزير له ، ولا ولد ولا صاحبة ، تعالى الله عن ذلك علوا كبيرا . وإنما عبد هؤلاء المشركون معه آلهة هم يعترفون أنها مخلوقة له عبيد له ، كما كانوا يقولون في تلبيتهم : لبيك لا شريك لك ، إلا شريكا هو لك ، تملكه وما ملك . وكما أخبر تعالى عنهم في قوله : ( ما نعبدهم إلا ليقربونا إلى الله زلفى )[ الزمر : 3 ] فأنكر تعالى ذلك عليهم ، حيث اعتقدوا ذلك ، وهو تعالى لا يشفع عنده أحد إلا بإذنه ، ( ولا تنفع الشفاعة عنده إلا لمن أذن له )[ سبأ : 23 ]( وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى )[ النجم : 26 ]( إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا )[ مريم : 93 - 95 ] فإذا كان الجميع عبيدا ، فلم يعبد بعضهم بعضا بلا دليل ولا برهان ، بل بمجرد الرأي والاختراع والابتداع ؟ ثم قد أرسل رسله من أولهم إلى آخرهم تزجرهم عن ذلك ، وتنهاهم عن عبادة من سوى الله ، فكذبوهم وخالفوهم ، فحقت عليهم كلمة العذاب لا محالة ، ( ولا يظلم ربك أحدا )[ الكهف : 49 ]"
  }, {
    "id" : 17,
    "eya" : "أَنزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَّابِيًا ۚ وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِّثْلُهُ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ (17) ",
    "tafsir" : "( أنزل من السماء ماء ) أي : مطرا ، ( فسالت أودية بقدرها ) أي : أخذ كل واد بحسبه ، فهذا كبير وسع كثيرا من الماء ، وهذا صغير فوسع بقدره ، وهو إشارة إلى القلوب وتفاوتها ، فمنها ما يسع علما كثيرا ، ومنها ما لا يتسع لكثير من العلوم بل يضيق عنها ، ( فاحتمل السيل زبدا رابيا ) أي : فجاء على وجه الماء الذي سال في هذه الأودية زبد عال عليه ، هذا مثل ، وقوله : ( ومما يوقدون عليه في النار ) هذا هو المثل الثاني ، وهو ما يسبك في النار من ذهب أو فضة ( ابتغاء حلية ) أي : ليجعل حلية أو نحاسا أو حديدا ، فيجعل متاعا فإنه يعلوه زبد منه ، كما يعلو ذلك زبد منه . ( كذلك يضرب الله الحق والباطل ) أي : إذا اجتمعا لا ثبات للباطل ولا دوام له ، كما أن الزبد لا يثبت مع الماء ، ولا مع الذهب ونحوه مما يسبك في النار ، بل يذهب ويضمحل; ولهذا قال : ( فأما الزبد فيذهب جفاء ) أي : لا ينتفع به ، بل يتفرق ويتمزق ويذهب في جانبي الوادي ، ويعلق بالشجر وتنسفه الرياح . وكذلك خبث الذهب والفضة والحديد والنحاس يذهب ، لا يرجع منه شيء ، ولا يبقى إلا الماء وذلك الذهب ونحوه ينتفع به; ولهذا قال : ( وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال ) كما قال تعالى : ( وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون )[ العنكبوت : 43 ]\nقال بعض السلف : كنت إذا قرأت مثلا من القرآن فلم أفهمه بكيت على نفسي; لأن الله تعالى يقول : ( وما يعقلها إلا العالمون )\nقال علي بن أبي طلحة ، عن ابن عباس : قوله تعالى : ( أنزل من السماء ماء فسالت أودية بقدرها ) هذا مثل ضربه الله ، احتملت منه القلوب على قدر يقينها وشكها ، فأما الشك فلا ينفع معه العمل ، وأما اليقين فينفع الله به أهله . وهو قوله : ( فأما الزبد فيذهب جفاء )[ وهو الشك ]( وأما ما ينفع الناس فيمكث في الأرض ) وهو اليقين ، وكما يجعل الحلي في النار فيؤخذ خالصه ويترك خبثه في النار; فكذلك يقبل الله اليقين ويترك الشك .\nوقال العوفي ، عن ابن عباس : قوله : ( أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ) يقول : احتمل السيل ما في الوادي من عود ودمنة ( ومما يوقدون عليه في النار ) فهو الذهب والفضة والحلية والمتاع والنحاس والحديد ، فللنحاس والحديد خبث ، فجعل الله مثل خبثه كزبد الماء ، فأما ما ينفع الناس فالذهب والفضة ، وأما ما ينفع الأرض فما شربت من الماء فأنبتت . فجعل ذاك مثل العمل الصالح يبقى لأهله ، والعمل السيئ يضمحل عن أهله ، كما يذهب هذا الزبد ، فكذلك الهدى والحق جاءا من عند الله ، فمن عمل بالحق كان له ، ويبقى كما يبقى ما ينفع الناس في الأرض . وكذلك الحديد لا يستطاع أن يعمل منه سكين ولا سيف حتى يدخل في النار فتأكل خبثه ، ويخرج جيده فينتفع به . كذلك يضمحل الباطل إذا كان يوم القيامة ، وأقيم الناس ، وعرضت الأعمال ، فيزيغ الباطل ويهلك ، وينتفع أهل الحق بالحق .\nوكذلك روي في تفسيرها عن مجاهد ، والحسن البصري ، وعطاء ، وقتادة ، وغير واحد من السلف والخلف .\nوقد ضرب الله ، سبحانه وتعالى ، في أول سورة البقرة للمنافقين مثلين ناريا ومائيا ، وهما قوله : ( مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله )[ البقرة : 17 ] ، ثم قال : ( أو كصيب من السماء فيه ظلمات ورعد وبرق )[ البقرة : 19 ] . وهكذا ضرب للكافرين في سورة النور مثلين ، أحدهما : قوله : ( والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء )[ النور : 39 ] الآية ، والسراب إنما يكون في شدة الحر; ولهذا جاء في الصحيحين : \nثم قال في المثل الآخر : ( أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب )[ النور : 40 ] . وفي الصحيحين عن أبي موسى الأشعري قال : قال رسول الله ، صلى الله عليه وسلم : [ أخرى ] إنما هي قيعان لا تمسك ماء ولا تنبت كلأ فذلك مثل من فقه في دين الله ونفعه الله بما بعثني ونفع به ، فعلم وعلم ، ومثل من لم يرفع بذلك رأسا ولم يقبل هدى الله الذي أرسلت به \"\nفهذا مثل مائي ، وقال في الحديث الآخر الذي رواه الإمام أحمد :\nحدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة عن رسول الله - صلى الله عليه وسلم - أنه قال : [ هلم عن النار ، هلم ] فتغلبوني فتقتحمون فيها \" . وأخرجاه في الصحيحين أيضا فهذا مثل ناري ."
  }, {
    "id" : 18,
    "eya" : "لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَىٰ ۚ وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُم مَّا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ ۚ أُولَٰئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمِهَادُ (18) ",
    "tafsir" : "( للذين استجابوا لربهم ) أي : أطاعوا الله ورسوله ، وانقادوا لأوامره ، وصدقوا أخباره الماضية والآتية ، فلهم ) الحسنى ) وهو الجزاء الحسن كما قال تعالى مخبرا عن ذي القرنين أنه قال : ( قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا )[ الكهف : 87 ، 88 ] وقال تعالى : ( للذين أحسنوا الحسنى وزيادة )[ يونس : 26 ]( والذين لم يستجيبوا له ) أي لم : يطيعوا الله ( لو أن لهم ما في الأرض جميعا ) أي : في الدار الآخرة ، لو أن يمكنهم أن يفتدوا من عذاب الله بملء الأرض ذهبا ومثله معه لافتدوا به ، ولكن لا يتقبل منهم; لأنه تعالى لا يقبل منهم يوم القيامة صرفا ولا عدلا ( أولئك لهم سوء الحساب ) أي : في الدار الآخرة ، أي : يناقشون على النقير والقطمير ، والجليل والحقير ، ومن نوقش الحساب عذب; ولهذا قال : ( ومأواهم جهنم وبئس المهاد )"
  }, {
    "id" : 19,
    "eya" : "۞ أَفَمَن يَعْلَمُ أَنَّمَا أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَىٰ ۚ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ (19) ",
    "tafsir" : "( أنزل إليك )( من ربك ) هو ) الحق ) أي : الذي لا شك فيه ولا مرية ولا لبس فيه ولا اختلاف فيه ، بل هو كله حق يصدق بعضه بعضا ، لا يضاد شيء منه شيئا آخر ، فأخباره كلها حق ، وأوامره ونواهيه عدل ، كما قال تعالى : ( وتمت كلمة ربك صدقا وعدلا )[ الأنعام : 115 ] أي : صدقا في الإخبار ، وعدلا في الطلب ، فلا يستوي من تحقق صدق ما جئت به يا محمد ، ومن هو أعمى لا يهتدي إلى خير ولا يفهمه ، ولو فهمه ما انقاد له ، ولا صدقه ولا اتبعه ، كما قال تعالى : ( لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون )[ الحشر : 20 ] وقال في هذه الآية الكريمة : ( أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى ) أي : أفهذا كهذا ؟ لا استواء .( إنما يتذكر أولو الألباب ) أي : إنما يتعظ ويعتبر ويعقل أولو العقول السليمة الصحيحة جعلنا الله منهم [ بفضله وكرمه ] .يقول تعالى مخبرا عمن اتصف بهذه الصفات الحميدة ، بأن لهم ( عقبى الدار ) وهي العاقبة والنصرة في الدنيا والآخرة ."
  }, {
    "id" : 20,
    "eya" : "الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ وَلَا يَنقُضُونَ الْمِيثَاقَ (20) ",
    "tafsir" : "( الذين يوفون بعهد الله ولا ينقضون الميثاق ) وليسوا كالمنافقين الذين إذا عاهد أحدهم غدر ، وإذا خاصم فجر ، وإذا حدث كذب ، وإذا ائتمن خان ."
  }, {
    "id" : 21,
    "eya" : "وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ (21) ",
    "tafsir" : "( والذين يصلون ما أمر الله به أن يوصل ) من صلة الأرحام ، والإحسان إليهم وإلى الفقراء والمحاويج ، وبذل المعروف ، ( ويخشون ربهم ) أي : فيما يأتون وما يذرون من الأعمال ، يراقبون الله في ذلك ، ويخافون سوء الحساب في الدار الآخرة . فلهذا أمرهم على السداد والاستقامة في جميع حركاتهم وسكناتهم وجميع أحوالهم القاصرة والمتعدية ."
  }, {
    "id" : 22,
    "eya" : "وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَٰئِكَ لَهُمْ عُقْبَى الدَّارِ (22) ",
    "tafsir" : "( والذين صبروا ابتغاء وجه ربهم ) أي : عن المحارم والمآثم ، ففطموا نفوسهم عن ذلك لله عز وجل; ابتغاء مرضاته وجزيل ثوابه ( وأقاموا الصلاة ) بحدودها ومواقيتها وركوعها وسجودها وخشوعها على الوجه الشرعي المرضي ، ( وأنفقوا مما رزقناهم ) أي : على الذين يجب عليهم الإنفاق لهم من زوجات وقرابات وأجانب ، من فقراء ومحاويج ومساكين ، ( سرا وعلانية ) أي : في السر والجهر ، لم يمنعهم من ذلك حال من الأحوال ، في آناء الليل وأطراف النهار ، ( ويدرءون بالحسنة السيئة ) أي : يدفعون القبيح بالحسن ، فإذا آذاهم أحد قابلوه بالجميل صبرا واحتمالا وصفحا وعفوا ، كما قال تعالى : ( ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم )[ فصلت : 34 ، 35 ] ; ولهذا قال مخبرا عن هؤلاء السعداء المتصفين بهذه الصفات الحسنة بأن لهم عقبى الدار."
  }, {
    "id" : 23,
    "eya" : "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۖ وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِم مِّن كُلِّ بَابٍ (23) ",
    "tafsir" : "( جنات عدن ) والعدن : الإقامة ، أي : جنات إقامة يخلدون فيها .\nوعن عبد الله بن عمرو أنه قال : إن في الجنة قصرا يقال له :  ، حوله البروج والمروج ، فيه خمسة آلاف باب ، على كل باب خمسة آلاف حبرة لا يدخله إلا نبي أو صديق أو شهيد .\nوقال الضحاك في قوله : ( جنات عدن ) مدينة الجنة ، فيها الرسل والأنبياء والشهداء وأئمة الهدى ، والناس حولهم بعد والجنات حولها . رواهما ابن جرير .( ومن صلح من آبائهم وأزواجهم وذرياتهم ) أي : يجمع بينهم وبين أحبابهم فيها من الآباء والأهلين والأبناء ، ممن هو صالح لدخول الجنة من المؤمنين; لتقر أعينهم بهم ، حتى إنه ترفع درجة الأدنى إلى درجة الأعلى ، من غير تنقيص لذلك الأعلى عن درجته ، بل امتنانا من الله وإحسانا ، كما قال تعالى : ( والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء كل امرئ بما كسب رهين )[ الطور : 21 ]( والملائكة يدخلون عليهم من كل باب )"
  }, {
    "id" : 24,
    "eya" : "سَلَامٌ عَلَيْكُم بِمَا صَبَرْتُمْ ۚ فَنِعْمَ عُقْبَى الدَّارِ (24) ",
    "tafsir" : "\nوقال الإمام أحمد ، رحمه الله : حدثنا أبو عبد الرحمن ، حدثني سعيد بن أبي أيوب ، حدثنا معروف بن سويد الجذامي عن أبي عشانة المعافري ، عن عبد الله بن عمرو بن العاص ، رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه قال :  قالوا : الله ورسوله أعلم . قال :  . قال : \" فتأتيهم الملائكة عند ذلك ، فيدخلون عليهم من كل باب ، ( سلام عليكم بما صبرتم فنعم عقبى الدار )\nورواه أبو القاسم الطبراني ، عن أحمد بن رشدين ، عن أحمد بن صالح ، عن عبد الله بن وهب ، عن عمرو بن الحارث ، عن أبي عشانة سمع عبد الله بن عمرو ، عن النبي - صلى الله عليه وسلم - قال : \" أول ثلة يدخلون الجنة فقراء المهاجرين ، الذين تتقى بهم المكاره ، وإذا أمروا سمعوا وأطاعوا ، وإن كانت لرجل منهم حاجة إلى سلطان لم تقض حتى يموت وهي في صدره ، وإن الله يدعو يوم القيامة الجنة فتأتي بزخرفها وزينتها ، فيقول : أين عبادي الذين قاتلوا في سبيلي ، وأوذوا في سبيلي ، وجاهدوا في سبيلي ؟ ادخلوا الجنة بغير عذاب ولا حساب ، وتأتي الملائكة فيسجدون ويقولون : ربنا نحن نسبحك الليل والنهار ، ونقدس لك ، من هؤلاء الذين آثرتهم علينا ؟ فيقول الرب عز وجل : هؤلاء عبادي الذين جاهدوا في سبيلي ، وأوذوا في سبيلي فتدخل عليهم الملائكة من كل باب : ( سلام عليكم بما صبرتم فنعم عقبى الدار )\nوقال عبد الله بن المبارك ، عن بقية بن الوليد ، حدثنا أرطاة بن المنذر ، سمعت رجلا من مشيخة الجند ، يقال له  يقول : جلست إلى أبي أمامة فقال : إن المؤمن ليكون متكئا على أريكته إذا دخل الجنة ، وعنده سماطان من خدم ، وعند طرف السماطين باب مبوب ، فيقبل الملك فيستأذن ، فيقول [ أقصى الخدم ] للذي يليه :  ، ويقول الذي يليه للذي يليه :  ، حتى يبلغ المؤمن فيقول : ائذنوا . فيقول أقربهم إلى المؤمن : ائذنوا ، ويقول الذي يليه للذي يليه : ائذنوا حتى يبلغ أقصاهم الذي عند الباب ، فيفتح له ، فيدخل فيسلم ثم ينصرف . رواه ابن جرير .\nورواه ابن أبي حاتم من حديث إسماعيل بن عياش ، عن أرطاة بن المنذر ، عن أبي الحجاج يوسف الألهاني قال : سمعت أبا أمامة ، فذكر نحوه .\nوقد جاء في الحديث : أن رسول الله - صلى الله عليه وسلم - كان يزور قبور الشهداء في رأس كل حول ، فيقول لهم : ( سلام عليكم بما صبرتم فنعم عقبى الدار ) وكذا أبو بكر ، وعمر وعثمان ."
  }, {
    "id" : 25,
    "eya" : "وَالَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۙ أُولَٰئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ (25) ",
    "tafsir" : "( ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض ) كما ثبت في الحديث :  وفي رواية : ( أولئك لهم اللعنة ) وهي الإبعاد عن الرحمة ، ( ولهم سوء الدار ) وهي سوء العاقبة والمآل ، ومأواهم جهنم وبئس القرار .\nوقال أبو العالية في قوله : ( والذين ينقضون عهد الله ) الآية ، قال : هي ست خصال في المنافقين إذا كان فيهم الظهرة على الناس أظهروا هذه الخصال : إذا حدثوا كذبوا ، وإذا وعدوا أخلفوا ، وإذا ائتمنوا خانوا ، ونقضوا عهد الله من بعد ميثاقه ، وقطعوا ما أمر الله به أن يوصل ، وأفسدوا في الأرض . وإذا كانت الظهرة عليهم أظهروا الثلاث الخصال : إذا حدثوا كذبوا ، وإذا وعدوا أخلفوا ، وإذا ائتمنوا خانوا ."
  }, {
    "id" : 26,
    "eya" : "اللَّهُ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ وَفَرِحُوا بِالْحَيَاةِ الدُّنْيَا وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ (26) ",
    "tafsir" : "( أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون )[ المؤمنون : 55 ، 56 ]\nثم حقر الحياة الدنيا بالنسبة إلى ما ادخره تعالى لعباده المؤمنين في الدار الآخرة فقال : ( وما الحياة الدنيا في الآخرة إلا متاع ) كما قال : ( قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا )[ النساء : 77 ]( بل تؤثرون الحياة الدنيا والآخرة خير وأبقى )[ الأعلى : 16 ، 17 ]\nوقال الإمام أحمد : حدثنا وكيع ويحيى بن سعيد قالا حدثنا إسماعيل بن أبي خالد ، عن قيس ، عن المستورد أخي بني فهر قال : قال رسول الله ، صلى الله عليه وسلم :  وأشار بالسبابة . ورواه مسلم في صحيحه .\nوفي الحديث الآخر : أن رسول الله - صلى الله عليه وسلم - مر بجدي أسك ميت - والأسك الصغير الأذنين - فقال : "
  }, {
    "id" : 27,
    "eya" : "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۗ قُلْ إِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ (27) ",
    "tafsir" : "( لولا ) أي : هلا ( أنزل عليه آية من ربه ) كما قالوا : ( فليأتنا بآية كما أرسل الأولون )[ الأنبياء : 5 ] وقد تقدم الكلام على هذا غير مرة ، وإن الله قادر على إجابة ما سألوا . وفي الحديث : أن الله أوحى إلى رسوله لما سألوه أن يحول لهم الصفا ذهبا ، وأن يجري لهم ينبوعا ، وأن يزيح الجبال من حول مكة فيصير مكانها مروج وبساتين : إن شئت يا محمد أعطيتهم ذلك ، فإن كفروا فإني أعذبهم عذابا لا أعذبه أحدا من العالمين ، وإن شئت فتحت عليهم باب التوبة والرحمة ، فقال :  ; ولهذا قال لرسوله : ( قل إن الله يضل من يشاء ويهدي إليه من أناب ) أي : هو المضل والهادي ، سواء بعث الرسول بآية على وفق ما اقترحوا ، أو لم يجبهم إلى سؤالهم; فإن الهداية والإضلال ليس منوطا بذلك ولا عدمه ، كما قال : ( وما تغني الآيات والنذر عن قوم لا يؤمنون )[ يونس : 101 ]( إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم )[ يونس : 96 ، 97 ]( ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون )[ الأنعام : 111 ] ; ولهذا قال : ( قل إن الله يضل من يشاء ويهدي إليه من أناب ) أي : ويهدي من أناب إلى الله ، ورجع إليه ، واستعان به ، وتضرع لديه ."
  }, {
    "id" : 28,
    "eya" : "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ (28) ",
    "tafsir" : "( ألا بذكر الله تطمئن القلوب ) أي : هو حقيق بذلك ."
  }, {
    "id" : 29,
    "eya" : "الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَىٰ لَهُمْ وَحُسْنُ مَآبٍ (29) ",
    "tafsir" : "( الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب ) قال ابن أبي طلحة ، عن ابن عباس : فرح وقرة عين . وقال عكرمة : نعم ما لهم .\nوقال الضحاك : غبطة لهم . وقال إبراهيم النخعي : خير لهم .\nوقال قتادة : هي كلمة عربية يقول الرجل :  ، أي : أصبت خيرا . وقال في رواية : ( طوبى لهم ) حسنى لهم .( وحسن مآب ) أي : مرجع .\nوهذه الأقوال شيء واحد لا منافاة بينها .\nوقال سعيد بن جبير ، عن ابن عباس : ( طوبى لهم ) قال : هي أرض الجنة بالحبشية .\nوقال سعيد بن مسجوح : طوبى اسم الجنة بالهندية . وكذا روى السدي ، عن عكرمة : ( طوبى لهم ) أي : الجنة . وبه قال مجاهد .\nوقال العوفي ، عن ابن عباس : لما خلق الله الجنة وفرغ منها قال : ( الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب ) وذلك حين أعجبته .\nوقال ابن جرير : حدثنا ابن حميد ، حدثنا يعقوب ، عن جعفر ، عن شهر بن حوشب قال : ( طوبى ) شجرة في الجنة ، كل شجر الجنة منها ، أغصانها من وراء سور الجنة .\nوهكذا روي عن أبي هريرة ، وابن عباس ، ومغيث بن سمى ، وأبي إسحاق السبيعي وغير واحد من السلف : أن طوبى شجرة في الجنة ، في كل دار منها غصن منها .\nوذكر بعضهم أن الرحمن ، تبارك وتعالى ، غرسها بيده من حبة لؤلؤة ، وأمرها أن تمتد ، فامتدت إلى حيث يشاء الله تبارك وتعالى ، وخرجت من أصلها ينابيع أنهار الجنة ، من عسل وخمر وماء ولبن .\nوقد قال عبد الله بن وهب : حدثنا عمرو بن الحارث ، أن دراجا أبا السمح حدثه ، عن أبي الهيثم ، عن أبي سعيد الخدري - رضي الله عنه - [ مرفوعا : \nوقال الإمام أحمد : حدثنا حسن بن موسى ، سمعت عبد الله بن لهيعة ، حدثنا دراج أبو السمح ، أن أبا الهيثم حدثه ، عن أبي سعيد الخدري ] عن رسول الله ، صلى الله عليه وسلم : أن رجلا قال : يا رسول الله ، طوبى لمن رآك وآمن بك . قال :  . قال له رجل : وما طوبى ؟ قال : \nوروى البخاري ومسلم جميعا ، عن إسحاق بن راهويه ، عن مغيرة المخزومي ، عن وهيب ، عن أبي حازم ، عن سهل بن سعد قال : قال رسول الله ، صلى الله عليه وسلم :  قال : فحدثت به النعمان بن أبي عياش الزرقي ، فقال : حدثني أبو سعيد الخدري ، عن النبي - صلى الله عليه وسلم - قال : \nوفي صحيح البخاري ، من حديث يزيد بن زريع ، عن سعيد ، عن قتادة ، عن أنس - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - في قول الله : ( وظل ممدود )[ الواقعة : 30 ]\nوقال الإمام أحمد : حدثنا سريج ، حدثنا فليح ، عن هلال بن علي ، عن عبد الرحمن بن أبي عمرة ، عن أبي هريرة قال : قال رسول الله ، صلى الله عليه وسلم : \" في الجنة شجرة يسير الراكب في ظلها مائة سنة اقرءوا إن شئتم ( وظل ممدود ) أخرجاه في الصحيحين .[ الإمام ] أحمد أيضا : حدثنا محمد بن جعفر وحجاج ، قالا حدثنا شعبة ، سمعت أبا الضحاك يحدث عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - أنه قال : \nوقال محمد بن إسحاق ، عن يحيى بن عباد بن عبد الله بن الزبير ، عن أبيه ، عن أسماء بنت أبي بكر ، رضي الله عنها ، قالت : سمعت رسول الله - صلى الله عليه وسلم - وذكر سدرة المنتهى ، قال :  . رواه الترمذي .\nوقال إسماعيل بن عياش ، عن سعيد بن يوسف ، عن يحيى بن أبي كثير ، عن أبي سلام الأسود قال : سمعت أبا أمامة الباهلي قال : قال رسول الله ، صلى الله عليه وسلم : \nوقال الإمام أبو جعفر بن جرير : حدثنا محمد بن عبد الأعلى ، حدثنا محمد بن ثور ، عن معمر ، عن أشعث بن عبد الله ، عن شهر بن حوشب ، عن أبي هريرة - رضي الله عنه - قال : طوبى شجرة في الجنة ، يقول الله لها : \nوقد روى ابن جرير عن وهب بن منبه هاهنا أثرا غريبا عجيبا ، قال وهب ، رحمه الله : إن في الجنة شجرة يقال لها :  ، يسير الراكب في ظلها مائة عام لا يقطعها ، زهرها رياط ، وورقها برود ، وقضبانها عنبر ، وبطحاؤها ياقوت ، وترابها كافور ، ووحلها مسك ، يخرج من أصلها أنهار الخمر واللبن والعسل ، وهي مجلس لأهل الجنة ، فبينا هم في مجلسهم إذ أتتهم ملائكة من ربهم يقودون نجبا مزمومة بسلاسل من ذهب وجوهها كالمصابيح حسنا ووبرها كخز المرعزى من لينه ، عليها رحال ألواحها من ياقوت ، ودفوفها من ذهب ، وثيابها من سندس وإستبرق ، فينيخونها ويقولون : إن ربنا أرسلنا إليكم لتزوروه وتسلموا عليه قال : فيركبونها ، فهي أسرع من الطائر ، وأوطأ من الفراش ، نجيا من غير مهنة ، يسير الرجل إلى جنب أخيه وهو يكلمه ويناجيه ، لا تصيب أذن راحلة منها أذن الأخرى ، ولا برك راحلة برك الأخرى ، حتى إن شجرة لتتنحى عن طريقهم ، لئلا تفرق بين الرجل وأخيه . قال : فيأتون إلى الرحمن الرحيم فيسفر لهم عن وجهه الكريم حتى ينظروا إليه ، فإذا رأوه قالوا : اللهم ، أنت السلام ومنك السلام ، وحق لك الجلال والإكرام . قال : فيقول تعالى [ عند ذلك ] أنا السلام ومني السلام ، وعليكم حقت رحمتي ومحبتي ، مرحبا بعبادي الذين خشوني بغيب وأطاعوا أمري \" .\nقال : فيقولون : ربنا لم نعبدك حق عبادتك ، ولم نقدرك حق قدرك ، فأذن لنا في السجود قدامك قال : فيقول الله :  فيسألونه ، حتى إن أقصرهم أمنية ليقول : رب ، تنافس أهل الدنيا في دنياهم فتضايقوا فيها ، رب فآتنى مثل كل شيء كانوا فيه من يوم خلقتها إلى أن انتهت الدنيا . فيقول الله تعالى : [ وسأتحفك بمنزلتي ] ; لأنه ليس في عطائي نكد ولا تصريد \" . قال : ثم يقول :  . قال : فيعرضون عليهم حتى تقصر بهم أمانيهم التي في أنفسهم ، فيكون فيما يعرضون عليهم براذين مقرنة ، على كل أربعة منها سرير من ياقوتة واحدة ، على كل سرير منها قبة من ذهب مفرغة ، في كل قبة منها فرش من فرش الجنة متظاهرة ، في كل قبة منها جاريتان من الحور العين ، على كل جارية منهن ثوبان من ثياب الجنة ، وليس في الجنة لون إلا وهو فيهما ولا ريح طيبة إلا قد عبقتا به ينفذ ضوء وجوههما غلظ القبة ، حتى يظن من يراهما أنهما دون القبة ، يرى مخهما من فوق سوقهما ، كالسلك الأبيض في ياقوتة حمراء ، يريان له من الفضل على صاحبته كفضل الشمس على الحجارة أو أفضل ، ويرى هو لهما مثل ذلك ، ويدخل إليهما فيحييانه ويقبلانه ويعتنقانه به ، ويقولان له : والله ما ظننا أن الله يخلق مثلك . ثم يأمر الله تعالى الملائكة فيسيرون بهم صفا في الجنة ، حتى ينتهى بكل رجل منهم إلى منزلته التي أعدت له .\nوقد روى هذا الأثر ابن أبي حاتم بسنده ، عن وهب بن منبه ، وزاد : فانظروا إلى موهوب ربكم الذي وهب لكم ، فإذا هو بقباب في الرفيق الأعلى ، وغرف مبنية من الدر والمرجان ، وأبوابها من ذهب ، وسررها من ياقوت ، وفرشها من سندس وإستبرق ، ومنابرها من نور ، يفور من أبوابها وعراصها نور مثل شعاع الشمس عنده مثل الكوكب الدري في النهار المضيء ، وإذا بقصور شامخة في أعلى عليين من الياقوت يزهو نورها ، فلولا أنه مسخر ، إذا لالتمع الأبصار ، فما كان من تلك القصور من الياقوت [ الأبيض ، فهو مفروش بالحرير الأبيض ، وما كان منها من الياقوت الأحمر فهو مفروش بالعبقري الأحمر ، وما كان منها من الياقوت الأخضر ] فهو مفروش بالسندس الأخضر ، وما كان منها من الياقوت الأصفر ، فهو مفروش بالأرجوان الأصفر منزه بالزمرد الأخضر ، والذهب الأحمر ، والفضة البيضاء ، قوائمها وأركانها من الجوهر ، وشرفها قباب من لؤلؤ ، وبروجها غرف من المرجان . فلما انصرفوا إلى ما أعطاهم ربهم ، قربت لهم براذين من ياقوت أبيض ، منفوخ فيها الروح ، تجنبها الولدان المخلدون بيد كل وليد منهم حكمة برذون من تلك البراذين ، ولجمها وأعنتها من فضة بيضاء ، منظومة بالدر والياقوت ، سروجها سرر مرضونة ، مفروشة بالسندس والإستبرق . فانطلقت بهم تلك البراذين تزف بهم ببطن رياض الجنة . فلما انتهوا إلى منازلهم ، وجدوا الملائكة قعودا على منابر من نور ، ينتظرونهم ليزوروهم ويصافحوهم ويهنئوهم كرامة ربهم . فلما دخلوا قصورهم وجدوا فيها جميع ما تطاول به عليهم وما سألوا وتمنوا ، وإذا على باب كل قصر من تلك القصور أربعة جنان ، [ جنتان ] ذواتا أفنان ، وجنتان مدهامتان ، وفيهما عينان نضاختان ، وفيهما من كل فاكهة زوجان ، وحور مقصورات في الخيام ، فلما تبينوا منازلهم واستقروا قرارهم قال لهم ربهم : هل وجدتم ما وعدتكم حقا ؟ قالوا : نعم وربنا . قال : هل رضيتم ثواب ربكم ؟ قالوا : ربنا رضينا فارض عنا قال : برضاي عنكم حللتم داري ، ونظرتم إلى وجهي ، وصافحتكم ملائكتي ، فهنيئا هنيئا لكم ، ( عطاء غير مجذوذ )[ هود : 108 ] ليس فيه تنغيص ولا تصريد . فعند ذلك قالوا : الحمد لله الذي أذهب عنا الحزن ، وأدخلنا دار المقامة من فضله ، لا يمسنا فيها نصب ولا يمسنا فيها لغوب ، إن ربنا لغفور شكور .\nوهذا سياق غريب ، وأثر عجيب ولبعضه شواهد ، ففي الصحيحين : أن الله تعالى يقول لذلك الرجل الذي يكون آخر أهل الجنة دخولا الجنة : تمن  تمن من كذا وتمن من كذا  ذلك لك ، وعشرة أمثاله \" .\nوفي صحيح مسلم ، عن أبي ذر عن رسول الله - صلى الله عليه وسلم - عن الله ، عز وجل يا عبادي ، لو أن أولكم وآخركم ، وإنسكم وجنكم ، قاموا في صعيد واحد ، فسألوني ، فأعطيت كل إنسان مسألته ، ما نقص ذلك من ملكي شيئا ، إلا كما ينقص المخيط إذا أدخل في البحر \" الحديث بطوله .\nوقال خالد بن معدان : إن في الجنة شجرة يقال لها طوبى ، لها ضروع ، كلها ترضع صبيان أهل الجنة ، وإن سقط المرأة يكون في نهر من أنهار الجنة ، يتقلب فيه حتى تقوم القيامة ، فيبعث ابن أربعين سنة . رواه ابن أبي حاتم ."
  }, {
    "id" : 30,
    "eya" : "كَذَٰلِكَ أَرْسَلْنَاكَ فِي أُمَّةٍ قَدْ خَلَتْ مِن قَبْلِهَا أُمَمٌ لِّتَتْلُوَ عَلَيْهِمُ الَّذِي أَوْحَيْنَا إِلَيْكَ وَهُمْ يَكْفُرُونَ بِالرَّحْمَٰنِ ۚ قُلْ هُوَ رَبِّي لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ مَتَابِ (30) ",
    "tafsir" : "( لتتلو عليهم الذي أوحينا إليك ) أي : لتبلغهم رسالة الله إليهم ، كذلك أرسلنا في الأمم الماضية الكافرة بالله ، وقد كذب الرسل من قبلك ، فلك بهم أسوة ، وكما أوقعنا بأسنا ونقمتنا بأولئك ، فليحذر هؤلاء من حلول النقم بهم ، فإن تكذيبهم لك أشد من تكذيب غيرك من المرسلين ، قال الله تعالى : ( تالله لقد أرسلنا إلى أمم من قبلك فزين لهم الشيطان أعمالهم فهو وليهم اليوم ولهم عذاب أليم )[ النحل : 63 ] وقال تعالى : ( ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرنا ولا مبدل لكلمات الله ولقد جاءك من نبأ المرسلين )[ الأنعام : 34 ] أي : كيف نصرناهم ، وجعلنا العاقبة لهم ولأتباعهم في الدنيا والآخرة .( وهم يكفرون بالرحمن ) أي : هذه الأمة التي بعثناك فيهم يكفرون بالرحمن ، لا يقرون به; لأنهم كانوا يأنفون من وصف الله بالرحمن الرحيم; ولهذا أنفوا يوم الحديبية أن يكتبوا  وقالوا : ما ندري ما الرحمن الرحيم . قاله قتادة ، والحديث في صحيح البخاري وقد قال الله تعالى : ( قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى )[ الإسراء : 110 ] وفي صحيح مسلم عن عبد الله بن عمر قال : قال رسول الله ، صلى الله عليه وسلم : \" إن أحب الأسماء إلى الله عبد الله وعبد الرحمن .( قل هو ربي لا إله إلا هو ) أي : هذا الذي تكفرون به أنا مؤمن به ، معترف مقر له بالربوبية والإلهية ، هو ربي لا إله إلا هو ، ( عليه توكلت ) أي : في جميع أموري ، ( وإليه متاب ) أي : إليه أرجع وأنيب ، فإنه لا يستحق ذلك أحد سواه ."
  }, {
    "id" : 31,
    "eya" : "وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتَىٰ ۗ بَل لِّلَّهِ الْأَمْرُ جَمِيعًا ۗ أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَن لَّوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا ۗ وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُم بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِّن دَارِهِمْ حَتَّىٰ يَأْتِيَ وَعْدُ اللَّهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ (31) ",
    "tafsir" : "( ولو أن قرآنا سيرت به الجبال ) أي : لو كان في الكتب الماضية كتاب تسير به الجبال عن أماكنها ، أو تقطع به الأرض وتنشق أو تكلم به الموتى في قبورها ، لكان هذا القرآن هو المتصف بذلك دون غيره ، أو بطريق الأولى أن يكون كذلك; لما فيه من الإعجاز الذي لا يستطيع الإنس والجن عن آخرهم إذا اجتمعوا أن يأتوا بمثله ، ولا بسورة من مثله ، ومع هذا فهؤلاء المشركون كافرون به ، جاحدون له ، ( بل لله الأمر جميعا ) أي : مرجع الأمور كلها إلى الله ، عز وجل ، ما شاء الله كان ، وما لم يشأ لم يكن ، ومن يضلل الله فلا هادي له ، ومن يهد الله فلا مضل له .\nوقد يطلق اسم القرآن على كل من الكتب المتقدمة; لأنه مشتق من الجميع ، قال الإمام أحمد :\nحدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة قال : قال رسول الله ، صلى الله عليه وسلم :  . انفرد بإخراجه البخاري .\nوالمراد بالقرآن هنا الزبور .( أفلم ييأس الذين آمنوا ) أي : من إيمان جميع الخلق ويعلموا أو يتبينوا ( أن لو يشاء الله لهدى الناس جميعا ) فإنه ليس ثم حجة ولا معجزة أبلغ ولا أنجع في النفوس والعقول من هذا القرآن ، الذي لو أنزله الله على جبل لرأيته خاشعا متصدعا من خشية الله . وثبت في الصحيح أن رسول الله - صلى الله عليه وسلم - قال :  معناه : أن معجزة كل نبي انقرضت بموته ، وهذا القرآن حجة باقية على الآباد ، لا تنقضي عجائبه ، ولا يخلق عن كثرة الرد ، ولا يشبع منه العلماء ، هو الفصل ليس بالهزل . من تركه من جبار قصمه الله ، ومن ابتغى الهدى من غيره أضله الله .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا منجاب بن الحارث ، أنبأنا بشر بن عمارة ، حدثنا عمر بن حسان ، عن عطية العوفي قال : قلت له : ( ولو أن قرآنا سيرت به الجبال ) الآية ، قالوا لمحمد ، صلى الله عليه وسلم : لو سيرت لنا جبال مكة حتى تتسع فنحرث فيها ، أو قطعت لنا الأرض كما كان سليمان يقطع لقومه بالريح ، أو أحييت لنا الموتى كما كان عيسى يحيي الموتى لقومه فأنزل الله هذه الآية . قال : قلت : هل تروون هذا الحديث عن أحد من أصحاب النبي ، صلى الله عليه وسلم ؟ قال : نعم ، عن أبي سعيد ، عن النبي ، صلى الله عليه وسلم .\nوكذا روي عن ابن عباس ، والشعبي ، وقتادة ، والثوري ، وغير واحد في سبب نزول هذه الآية ، فالله أعلم .\nوقال قتادة : لو فعل هذا بقرآن غير قرآنكم ، فعل بقرآنكم .( بل لله الأمر جميعا ) قال ابن عباس : [ أي ] لا يصنع من ذلك إلا ما يشاء ، ولم يكن ليفعل ، رواه ابن إسحاق بسنده عنه ، وقاله ابن جرير أيضا .\nوقال غير واحد من السلف في قوله : ( أفلم ييأس الذين آمنوا ) أفلم يعلم الذين آمنوا . وقرأ آخرون : \nوقال أبو العالية : قد يئس الذين آمنوا أن يهدوا ، ولو يشاء الله لهدى الناس جميعا .( ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أو تحل قريبا من دارهم ) أي : بسبب تكذيبهم ، لا تزال القوارع تصيبهم في الدنيا ، أو تصيب من حولهم ليتعظوا ويعتبروا ، كما قال تعالى : ( ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون )[ الأحقاف : 27 ]( أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون )[ الأنبياء : 44 ]\nقال قتادة ، عن الحسن : ( أو تحل قريبا من دارهم ) أي : القارعة . وهذا هو الظاهر من السياق .\nقال أبو داود الطيالسي : حدثنا المسعودي ، عن قتادة ، عن سعيد بن جبير ، عن ابن عباس في قوله : ( ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة ) قال : سرية ، ( أو تحل قريبا من دارهم ) قال : محمد صلى الله عليه وسلم ، ( حتى يأتي وعد الله ) قال : فتح مكة .\nوهكذا قال عكرمة ، وسعيد بن جبير ، ومجاهد ، في رواية .\nوقال العوفي ، عن ابن عباس : ( تصيبهم بما صنعوا قارعة ) قال : عذاب من السماء ينزل عليهم ( أو تحل قريبا من دارهم ) يعني : نزول رسول الله - صلى الله عليه وسلم - بهم وقتاله إياهم .\nوكذا قال مجاهد ، وقتادة ، وقال عكرمة في رواية عنه ، عن ابن عباس : ( قارعة ) أي : نكبة .( حتى يأتي وعد الله ) يعني : فتح مكة . وقال الحسن البصري : يوم القيامة .( إن الله لا يخلف الميعاد ) أي : لا ينقض وعده لرسله بالنصرة لهم ولأتباعهم في الدنيا والآخرة ، ( فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام )[ إبراهيم : 47 ]"
  }, {
    "id" : 32,
    "eya" : "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ (32) ",
    "tafsir" : "( ولقد استهزئ برسل من قبلك ) أي : فلك فيهم أسوة ، ( فأمليت للذين كفروا ) أي : أنظرتهم وأجلتهم ، ( ثم أخذتهم ) أخذة رابية ، فكيف بلغك ما صنعت بهم وعاقبتهم ؟ كما قال تعالى : ( وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير )[ الحج : 48 ] وفي الصحيحين :  ، ثم قرأ رسول الله ، صلى الله عليه وسلم : ( وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد )[ هود : 102 ]"
  }, {
    "id" : 33,
    "eya" : "أَفَمَنْ هُوَ قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ ۗ وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَم بِظَاهِرٍ مِّنَ الْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ وَصُدُّوا عَنِ السَّبِيلِ ۗ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ (33) ",
    "tafsir" : "( أفمن هو قائم على كل نفس بما كسبت ) أي : حفيظ عليم رقيب على كل نفس منفوسة ، يعلم ما يعمل العاملون من خير وشر ، ولا يخفى عليه خافية ، ( وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه )[ يونس : 61 ] وقال تعالى : ( وما تسقط من ورقة إلا يعلمها )[ الأنعام : 59 ]( وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين )[ هود : 6 ]( سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار )[ الرعد : 10 ]( يعلم السر وأخفى )[ طه : 7 ]( وهو معكم أين ما كنتم والله بما تعملون بصير )[ الحديد : 4 ] أفمن هو هكذا كالأصنام التي يعبدونها لا تسمع ولا تبصر ولا تعقل ، ولا تملك نفعا لأنفسها ولا لعابديها ، ولا كشف ضر عنها ولا عن عابديها ؟ وحذف هذا الجواب اكتفاء بدلالة السياق عليه ، وهو قوله : ( وجعلوا لله شركاء ) أي : عبدوها معه ، من أصنام وأنداد وأوثان .( قل سموهم ) أي : أعلمونا بهم ، واكشفوا عنهم حتى يعرفوا ، فإنهم لا حقيقة لهم; ولهذا قال : ( أم تنبئونه بما لا يعلم في الأرض ) أي : لا وجود له; لأنه لو كان له وجود في الأرض لعلمها; لأنه لا تخفى عليه خافية .( أم بظاهر من القول ) قال مجاهد : بظن من القول .\nوقال الضحاك وقتادة : بباطل من القول .\nأي إنما عبدتم هذه الأصنام بظن منكم أنها تنفع وتضر ، وسميتموها آلهة ، ( إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى )[ النجم : 23 ]( بل زين للذين كفروا مكرهم ) قال مجاهد : قولهم ، أي : ما هم عليه من الضلال والدعوة إليه آناء الليل وأطراف النهار ، كما قال تعالى : ( وقيضنا لهم قرناء فزينوا لهم ما بين أيديهم وما خلفهم وحق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين )[ فصلت : 25 ] : من قرأها بفتح الصاد ، معناه : أنهم لما زين لهم ما فيه وأنه حق ، دعوا إليه وصدوا الناس عن اتباع طريق الرسل . ومن قرأها ) وصدوا ) أي : بما زين لهم من صحة ما هم عليه ، صدوا به عن سبيل الله; ولهذا قال : ( ومن يضلل الله فما له من هاد )( ومن يرد الله فتنته فلن تملك له من الله شيئا )[ المائدة : 41 ]( إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين )[ النحل : 37 ]"
  }, {
    "id" : 34,
    "eya" : "لَّهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَشَقُّ ۖ وَمَا لَهُم مِّنَ اللَّهِ مِن وَاقٍ (34) ",
    "tafsir" : "( لهم عذاب في الحياة الدنيا ) أي : بأيدي المؤمنين قتلا وأسرا ، ( ولعذاب الآخرة ) أي : المدخر [ لهم ] مع هذا الخزي في الدنيا ،  أي : من هذا بكثير ، كما قال رسول الله - صلى الله عليه وسلم - للمتلاعنين :  وهو كما قال ، صلوات الله وسلامه عليه ، فإن عذاب الدنيا له انقضاء ، وذاك دائم أبدا في نار هي بالنسبة إلى هذه سبعون ضعفا ، ووثاق لا يتصور كثافته وشدته ، كما قال تعالى : ( فيومئذ لا يعذب عذابه أحد ولا يوثق وثاقه أحد )[ الفجر : 25 ، 26 ] وقال تعالى : ( بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا قل أذلك خير أم جنة الخلد التي وعد المتقون كانت لهم جزاء ومصيرا )[ الفرقان : 11 - 15 ]"
  }, {
    "id" : 35,
    "eya" : "۞ مَّثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ أُكُلُهَا دَائِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى الَّذِينَ اتَّقَوا ۖ وَّعُقْبَى الْكَافِرِينَ النَّارُ (35) ",
    "tafsir" : "( مثل الجنة التي وعد المتقون ) أي : صفتها ونعتها ، ( تجري من تحتها الأنهار ) أي : سارحة في أرجائها وجوانبها ، وحيث شاء أهلها ، يفجرونها تفجيرا ، أي : يصرفونها كيف شاءوا وأين شاءوا ، كما قال تعالى : ( مثل الجنة التي وعد المتقون فيها أنهار من ماء غير آسن وأنهار من لبن لم يتغير طعمه وأنهار من خمر لذة للشاربين وأنهار من عسل مصفى ولهم فيها من كل الثمرات ومغفرة من ربهم كمن هو خالد في النار وسقوا ماء حميما فقطع أمعاءهم )[ محمد : 15 ] . وقوله : ( أكلها دائم وظلها ) أي : فيها المطاعم والفواكه والمشارب ، لا انقطاع [ لها ] ولا فناء .\nوفي الصحيحين ، من حديث ابن عباس في صلاة الكسوف ، وفيه قالوا : يا رسول الله ، رأيناك تناولت شيئا في مقامك هذا ، ثم رأيناك تكعكعت فقال : \nوقال الحافظ أبو يعلى : حدثنا أبو خيثمة ، حدثنا عبد الله بن جعفر ، حدثنا عبيد الله ، حدثنا أبو عقيل ، عن جابر قال : بينما نحن في صلاة الظهر ، إذ تقدم رسول الله - صلى الله عليه وسلم - فتقدمنا ، ثم تناول شيئا ليأخذه ثم تأخر . فلما قضى الصلاة قال له أبي بن كعب : يا رسول الله ، صنعت اليوم في الصلاة شيئا ما رأيناك كنت تصنعه . فقال : \nوروى مسلم من حديث أبي الزبير ، عن جابر ، شاهدا لبعضه .\nوعن عتبة بن عبد السلمي : أن أعرابيا سأل النبي - صلى الله عليه وسلم - عن الجنة ، فقال : فيها عنب ؟ قال :  . قال : فما عظم العنقود ؟ قال :  . رواه أحمد .\nوقال الطبراني : حدثنا معاذ بن المثنى ، حدثنا علي بن المديني ، حدثنا ريحان بن سعيد ، عن عبادة بن منصور ، عن أيوب ، عن أبي قلابة ، عن أبي أسماء ، عن ثوبان قال : قال رسول الله ، صلى الله عليه وسلم : \nوعن جابر بن عبد الله قال : قال رسول الله ، صلى الله عليه وسلم :  . رواه مسلم .\nوروى الإمام أحمد والنسائي ، من حديث الأعمش ، عن ثمامة بن عقبة سمعت زيد بن أرقم قال : جاء رجل من أهل الكتاب فقال : يا أبا القاسم ، تزعم أن أهل الجنة يأكلون ويشربون ؟ قال : نعم ، والذي نفس محمد بيده ، [ إن الرجل من أهل الجنة ] ليعطى قوة مائة رجل في الأكل والشرب والجماع والشهوة  حاجة أحدهم رشح يفيض من جلودهم ، كريح المسك ، فيضمر بطنه \" .\nوقال الحسن بن عرفة : حدثنا خلف بن خليفة ، عن حميد الأعرج ، عن عبد الله بن الحارث ، عن عبد الله بن مسعود ، رضي الله عنه ، قال : قال لي رسول الله ، صلى الله عليه وسلم : \" إنك لتنظر إلى الطير في الجنة ، فيخر بين يديك مشويا .\nوجاء في بعض الأحاديث : أنه إذا فرغ منه عاد طائرا كما كان بإذن الله تعالى .\nوقد قال تعالى : ( وفاكهة كثيرة لا مقطوعة ولا ممنوعة )[ الواقعة : 32 ، 33 ]( ودانية عليهم ظلالها وذللت قطوفها تذليلا )[ الإنسان : 14 ]\nوكذلك ظلها لا يزول ولا يقلص ، كما قال تعالى : ( والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا لهم فيها أزواج مطهرة وندخلهم ظلا ظليلا )[ النساء : 57 ]\nوقد تقدم في الصحيحين من غير وجه أن رسول الله - صلى الله عليه وسلم - قال :  ، ثم قرأ : ( وظل ممدود )[ الواقعة : 30 ]\nوكثيرا ما يقرن الله تعالى بين صفة الجنة وصفة النار ، ليرغب في الجنة ويحذر من النار; ولهذا لما ذكر صفة الجنة بما ذكر ، قال بعده : ( تلك عقبى الذين اتقوا وعقبى الكافرين النار ) كما قال تعالى : ( لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون )[ الحشر : 20 ]\nوقال بلال بن سعد خطيب دمشق في بعض خطبه : عباد الله هل جاءكم مخبر يخبركم أن شيئا من عبادتكم تقبلت منكم ، أو أن شيئا من خطاياكم غفرت لكم ؟ ( أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون )[ المؤمنون : 115 ] والله لو عجل لكم الثواب في الدنيا لاستقللتم كلكم ما افترض عليكم ، أو ترغبون في طاعة الله لتعجيل دنياكم ، ولا تنافسون في جنة ( أكلها دائم وظلها تلك عقبى الذين اتقوا وعقبى الكافرين النار ) رواه ابن أبي حاتم ."
  }, {
    "id" : 36,
    "eya" : "وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَفْرَحُونَ بِمَا أُنزِلَ إِلَيْكَ ۖ وَمِنَ الْأَحْزَابِ مَن يُنكِرُ بَعْضَهُ ۚ قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ ۚ إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ (36) ",
    "tafsir" : "( والذين آتيناهم الكتاب ) وهم قائمون بمقتضاه ( يفرحون بما أنزل إليك ) أي : من القرآن لما في كتبهم من الشواهد على صدقه والبشارة به ، كما قال تعالى : ( الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به ومن يكفر به فأولئك هم الخاسرون )[ البقرة : 121 ] وقال تعالى : ( قل آمنوا به أو لا تؤمنوا إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا )[ الإسراء : 107 ، 108 ] أي : إن كان ما وعدنا الله به في كتبنا من إرسال محمد - صلى الله عليه وسلم - لحقا وصدقا مفعولا لا محالة ، وكائنا ، فسبحانه ما أصدق وعده ، فله الحمد وحده ، (ويخرون للأذقان يبكون ويزيدهم خشوعا )[ الإسراء : 109 ]( ومن الأحزاب من ينكر بعضه ) أي : ومن الطوائف من يكذب ببعض ما أنزل إليك .\nوقال مجاهد : ( ومن الأحزاب ) اليهود والنصارى ، من ينكر بعضه ما جاءك من الحق . وكذا قال قتادة ، وعبد الرحمن بن زيد بن أسلم .\nوهذا كما قال تعالى : ( وإن من أهل الكتاب لمن يؤمن بالله وما أنزل إليكم وما أنزل إليهم خاشعين لله لا يشترون بآيات الله ثمنا قليلا أولئك لهم أجرهم عند ربهم إن الله سريع الحساب )[ آل عمران : 199 ]( قل إنما أمرت أن أعبد الله ولا أشرك به ) أي : إنما بعثت بعبادة الله وحده لا شريك له ، كما أرسل الأنبياء من قبلي ، ( إليه أدعو ) أي : إلى سبيله أدعو الناس ، ( وإليه مآب ) أي : مرجعي ومصيري ."
  }, {
    "id" : 37,
    "eya" : "وَكَذَٰلِكَ أَنزَلْنَاهُ حُكْمًا عَرَبِيًّا ۚ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُم بَعْدَمَا جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلَا وَاقٍ (37) ",
    "tafsir" : "( وكذلك أنزلناه حكما عربيا ) أي : وكما أرسلنا قبلك المرسلين ، وأنزلنا عليهم الكتب من السماء ، كذلك أنزلنا عليك القرآن محكما معربا ، شرفناك به وفضلناك على من سواك بهذا الكتاب المبين الواضح الجلي الذي ) لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد ) [ فصلت : 11 ]( ولئن اتبعت أهواءهم ) أي : آراءهم ، ( أهواءهم بعدما جاءك من العلم ) أي : من الله تعالى ( ما لك من الله من ولي ولا واق ) أي : من الله تعالى . وهذا وعيد لأهل العلم أن يتبعوا سبل أهل الضلالة بعدما صاروا إليه من سلوك السنة النبوية والمحجة المحمدية ، على من جاء بها أفضل الصلاة والسلام [ والتحية والإكرام ]"
  }, {
    "id" : 38,
    "eya" : "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً ۚ وَمَا كَانَ لِرَسُولٍ أَن يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ لِكُلِّ أَجَلٍ كِتَابٌ (38) ",
    "tafsir" : "[ قد ] بعثنا المرسلين قبلك بشرا يأكلون الطعام ، ويمشون في الأسواق ويأتون الزوجات ، ويولد لهم ، وجعلنا لهم أزواجا وذرية ، وقد قال [ الله ] تعالى لأشرف الرسل وخاتمهم : ( قل إنما أنا بشر مثلكم يوحى إلي )[ الكهف : 110 ]\nوفي الصحيحين : أن رسول الله - صلى الله عليه وسلم - قال : \nوقال الإمام أحمد : حدثنا يزيد ، أنبأنا الحجاج بن أرطاة عن مكحول قال : قال أبو أيوب : قال رسول الله ، صلى الله عليه وسلم : \nوقد رواه أبو عيسى الترمذي ، عن سفيان بن وكيع عن حفص بن غياث ، عن الحجاج ، عن مكحول ، عن أبى الشمال عن أبي أيوب . . . فذكره ، ثم قال : وهذا أصح من الحديث الذي لم يذكر فيه أبو الشمال .( وما كان لرسول أن يأتي بآية إلا بإذن الله ) أي : لم يكن يأتي قومه بخارق إلا إذا أذن له فيه ، ليس ذلك إليه ، بل إلى الله ، عز وجل ، يفعل ما يشاء ، ويحكم ما يريد .( لكل أجل كتاب ) أي : لكل مدة مضروبة كتاب مكتوب بها ، وكل شيء عنده بمقدار ، ( ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير )[ الحج : 70 ]\nوكان الضحاك بن مزاحم يقول في قوله : ( لكل أجل كتاب ) أي : لكل كتاب أجل يعني لكل كتاب أنزله من السماء مدة مضروبة عند الله ومقدار معين ، فلهذا يمحو ما يشاء منها ويثبت ، يعني حتى نسخت كلها بالقرآن الذي أنزله الله على رسوله ، صلوات الله وسلامه عليه ."
  }, {
    "id" : 39,
    "eya" : "يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ ۖ وَعِندَهُ أُمُّ الْكِتَابِ (39) ",
    "tafsir" : "( يمحو الله ما يشاء ويثبت ) اختلف المفسرون في ذلك ، فقال الثوري ، ووكيع ، وهشيم ، عن ابن أبي ليلى ، عن المنهال بن عمرو ، عن سعيد بن جبير ، عن ابن عباس : يدبر أمر السنة ، فيمحو ما يشاء ، إلا الشقاء والسعادة ، والحياة والموت . وفي رواية : ( يمحو الله ما يشاء ويثبت ) قال : كل شيء إلا الحياة والموت ، والشقاء والسعادة فإنهما قد فرغ منهما .\nوقال مجاهد : ( يمحوا الله ما يشاء ويثبت ) إلا الحياة والموت ، والشقاء والسعادة ، فإنهما لا يتغيران .\nوقال منصور : سألت مجاهدا فقلت : أرأيت دعاء أحدنا يقول : اللهم ، إن كان اسمي في السعداء فأثبته فيهم ، وإن كان في الأشقياء فامحه عنهم واجعله في السعداء . فقال : حسن . ثم لقيته بعد ذلك بحول أو أكثر ، فسألته عن ذلك ، فقال : ( إنا أنزلناه في ليلة مباركة إنا كنا منذرين فيها يفرق كل أمر حكيم )[ الدخان : 3 ، 4 ] قال : يقضي في ليلة القدر ما يكون في السنة من رزق أو مصيبة ، ثم يقدم ما يشاء ويؤخر ما يشاء ، فأما كتاب الشقاوة والسعادة فهو ثابت لا يغير .\nوقال الأعمش ، عن أبي وائل شقيق بن سلمة : إنه كان يكثر أن يدعو بهذا الدعاء : اللهم ، إن كنت كتبتنا أشقياء فامحه ، واكتبنا سعداء ، وإن كنت كتبتنا سعداء فأثبتنا ، فإنك تمحو ما تشاء وتثبت وعندك أم الكتاب . رواه ابن جرير .\nوقال ابن جرير أيضا : حدثنا عمرو بن علي ، حدثنا معاذ بن هشام ، حدثني أبي ، عن أبي حكيمة عصمة ، عن أبي عثمان النهدي; أن عمر بن الخطاب - رضي الله عنه - قال وهو يطوف بالبيت وهو يبكي : اللهم ، إن كنت كتبت علي شقوة أو ذنبا فامحه ، فإنك تمحو ما تشاء وتثبت ، وعندك أم الكتاب ، فاجعله سعادة ومغفرة .\nوقال حماد عن خالد الحذاء ، عن أبي قلابة عن ابن مسعود أنه كان يدعو بهذا الدعاء أيضا .\nورواه شريك ، عن هلال بن حميد ، عن عبد الله بن عكيم ، عن ابن مسعود ، بمثله .\nوقال ابن جرير : حدثني المثنى ، حدثنا حجاج ، حدثنا خصاف ، عن أبي حمزة ، عن إبراهيم; أن كعبا قال لعمر بن الخطاب : يا أمير المؤمنين ، لولا آية في كتاب الله لأنبأتك بما هو كائن إلى يوم القيامة . قال : وما هي ؟ قال : قول الله تعالى : ( يمحوا الله ما يشاء ويثبت وعنده أم الكتاب )\nومعنى هذه الأقوال : أن الأقدار ينسخ الله ما يشاء منها ، ويثبت منها ما يشاء ، وقد يستأنس لهذا القول بما رواه الإمام أحمد :\nحدثنا وكيع ، حدثنا سفيان ، وهو الثوري ، عن عبد الله بن عيسى ، عن عبد الله بن أبي الجعد ، عن ثوبان قال : قال رسول الله ، صلى الله عليه وسلم : \nورواه النسائي وابن ماجه ، من حديث سفيان الثوري ، به .\nوثبت في الصحيح أن صلة الرحم تزيد في العمر وفي الحديث الآخر : \nوقال ابن جرير : حدثني محمد بن سهل بن عسكر ، حدثنا عبد الرزاق ، أخبرنا ابن جريج ، عن عطاء ، عن ابن عباس قال : إن لله لوحا محفوظا مسيرة خمسمائة عام ، من درة بيضاء لها دفتان من ياقوت - والدفتان لوحان - لله ، عز وجل [ كل يوم ثلاثمائة ] وستون لحظة ، يمحو ما يشاء ويثبت وعنده أم الكتاب .\nوقال الليث بن سعد ، عن زياد بن محمد ، عن محمد بن كعب القرظي ، عن فضالة بن عبيد ، عن أبي الدرداء قال : قال رسول الله ، صلى الله عليه وسلم : [ إن الله ] يفتح الذكر في ثلاث ساعات يبقين من الليل ، في الساعة الأولى منها ينظر في الذكر الذي لا ينظر فيه أحد غيره ، فيمحو ما يشاء ويثبت \" . وذكر تمام الحديث . رواه ابن جرير .\nوقال الكلبي : ( يمحوا الله ما يشاء ويثبت ) قال : يمحو من الرزق ويزيد فيه ، ويمحو من الأجل ويزيد فيه . فقيل له : من حدثك بهذا ؟ فقال : أبو صالح ، عن جابر بن عبد الله بن رئاب ، عن النبي - صلى الله عليه وسلم - ثم سئل بعد ذلك عن هذه الآية فقال : يكتب القول كله ، حتى إذا كان يوم الخميس ، طرح منه كل شيء ليس فيه ثواب ولا عقاب ، مثل قولك : أكلت وشربت ، دخلت وخرجت ونحوه من الكلام ، وهو صادق ، ويثبت ما كان فيه الثواب ، وعليه العقاب .\nوقال عكرمة ، عن ابن عباس : الكتاب كتابان : فكتاب يمحو الله منه ما يشاء ويثبت وعنده أم الكتاب .\nوقال العوفي ، عن ابن عباس في قوله : ( يمحو الله ما يشاء ويثبت وعنده أم الكتاب ) يقول : هو الرجل يعمل الزمان بطاعة الله ، ثم يعود لمعصية الله فيموت على ضلالة ، فهو الذي يمحو ، والذي يثبت : الرجل يعمل بمعصية الله ، وقد كان سبق له خير حتى يموت وهو في طاعة الله ، وهو الذي يثبت .\nوروي عن سعيد بن جبير : أنها بمعنى : ( فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير )[ البقرة : 284 ]\nوقال علي بن أبي طلحة ، عن ابن عباس : ( يمحو الله ما يشاء ويثبت ) يقول : يبدل ما يشاء فينسخه ، ويثبت ما يشاء فلا يبدله ، ( وعنده أم الكتاب ) يقول : وجملة ذلك عنده في أم الكتاب ، الناسخ والمنسوخ ، وما يبدل ، وما يثبت كل ذلك في كتاب .\nوقال قتادة في قوله : ( يمحو الله ما يشاء ويثبت )( ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها )[ البقرة : 106 ]\nوقال ابن أبي نجيح ، عن مجاهد في قوله : ( يمحو الله ما يشاء ويثبت ) قال : قالت كفار قريش حين أنزلت : ( وما كان لرسول أن يأتي بآية إلا بإذن الله ) ما نراك يا محمد تملك من شيء ، ولقد فرغ من الأمر . فأنزلت هذه الآية تخويفا ، ووعيدا لهم : إنا إن شئنا أحدثنا له من أمرنا ما شئنا ، ونحدث في كل رمضان ، فنمحو ونثبت ما نشاء من أرزاق الناس ومصائبهم ، وما نعطيهم ، وما نقسم لهم .\nوقال الحسن البصري : ( يمحو الله ما يشاء ) قال : من جاء أجله ، فذهب ، ويثبت الذي هو حي يجري إلى أجله .\nوقد اختار هذا القول أبو جعفر بن جرير ، رحمه الله .( وعنده أم الكتاب ) قال : الحلال والحرام .\nوقال قتادة : أي جملة الكتاب وأصله .\nوقال الضحاك : ( وعنده أم الكتاب ) قال : كتاب عند رب العالمين .\nوقال سنيد بن داود ، حدثني معتمر ، عن أبيه ، عن سيار ، عن ابن عباس; أنه سأل كعبا عن  ، فقال : علم الله ، ما هو خالق ، وما خلقه عاملون ، ثم قال لعلمه :  . فكانا كتابا .\nوقال ابن جرير ، عن ابن عباس : ( وعنده أم الكتاب ) قال : الذكر ، [ والله أعلم ]"
  }, {
    "id" : 40,
    "eya" : "وَإِن مَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَعَلَيْنَا الْحِسَابُ (40) ",
    "tafsir" : "( وإن ما نرينك )( بعض الذي نعدهم ) أي : نعد أعداءك من الخزي والنكال في الدنيا ، ( أو نتوفينك )[ أي ] قبل ذلك ، ( فإنما عليك البلاغ ) أي : إنما أرسلناك لتبلغهم رسالة الله وقد بلغت ما أمرت به ، ( وعلينا الحساب ) أي : حسابهم وجزاؤهم ، كما قال تعالى : ( فذكر إنما أنت مذكر لست عليهم بمصيطر إلا من تولى وكفر فيعذبه الله العذاب الأكبر إن إلينا إيابهم ثم إن علينا حسابهم )[ الغاشية : 21 - 26 ]"
  }, {
    "id" : 41,
    "eya" : "أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَا ۚ وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ ۚ وَهُوَ سَرِيعُ الْحِسَابِ (41) ",
    "tafsir" : "( أولم يروا أنا نأتي الأرض ننقصها من أطرافها ) قال ابن عباس : أو لم يروا أنا نفتح لمحمد الأرض بعد الأرض ؟\nوقال في رواية : أو لم يروا إلى القرية تخرب ، حتى يكون العمران في ناحية ؟\nوقال مجاهد وعكرمة : ( ننقصها من أطرافها ) قال : خرابها .\nوقال الحسن والضحاك : هو ظهور المسلمين على المشركين .\nوقال العوفي عن ابن عباس : نقصان أهلها وبركتها .\nوقال مجاهد : نقصان الأنفس والثمرات وخراب الأرض .\nوقال الشعبي : لو كانت الأرض تنقص لضاق عليك حشك ، ولكن تنقص الأنفس والثمرات . وكذا قال عكرمة : لو كانت الأرض تنقص لم تجد مكانا تقعد فيه ، ولكن هو الموت .\nوقال ابن عباس في رواية : خرابها بموت فقهائها وعلمائها وأهل الخير منها . وكذا قال مجاهد أيضا : هو موت العلماء .\nوفي هذا المعنى روى الحافظ ابن عساكر في ترجمة أحمد بن عبد العزيز أبي القاسم المصري الواعظ سكن أصبهان ، حدثنا أبو محمد طلحة بن أسد المرئي بدمشق ، أنشدنا أبو بكر الآجرى بمكة قال : أنشدنا أحمد بن غزال لنفسه :\nالأرض تحيا إذا ما عاش عالمها متى يمت عالم منها يمت طرف     كالأرض تحيا إذا ما الغيث حل بها\nوإن أبى عاد في أكنافها التلف\nوالقول الأول أولى ، وهو ظهور الإسلام على الشرك قرية بعد قرية ، [ وكفرا بعد كفر ، كما قال تعالى : ( ولقد أهلكنا ما حولكم من القرى ) [ الأحقاف : 27 ] الآية ، وهذا اختيار ابن جرير ، رحمه الله ]"
  }, {
    "id" : 42,
    "eya" : "وَقَدْ مَكَرَ الَّذِينَ مِن قَبْلِهِمْ فَلِلَّهِ الْمَكْرُ جَمِيعًا ۖ يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ ۗ وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ (42) ",
    "tafsir" : "( وقد مكر الذين من قبلهم ) برسلهم ، وأرادوا إخراجهم من بلادهم ، فمكر الله بهم ، وجعل العاقبة للمتقين ، كما قال تعالى : ( وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين )[ الأنفال : 30 ] وقال تعالى : ( ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين فتلك بيوتهم خاوية بما ظلموا )[ النمل : 50 - 52 ]( يعلم ما تكسب كل نفس ) أي : إنه تعالى عالم بجميع السرائر والضمائر ، وسيجزي كل عامل بعمله .( وسيعلم الكافر )( الكفار )( لمن عقبى الدار ) أي : لمن تكون الدائرة والعاقبة ، لهم أو لأتباع الرسل ؟ كلا بل هي لأتباع الرسل في الدنيا والآخرة ، ولله الحمد والمنة ."
  }, {
    "id" : 43,
    "eya" : "وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا ۚ قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِندَهُ عِلْمُ الْكِتَابِ (43) ",
    "tafsir" : "( لست مرسلا ) أي : ما أرسلك الله ، ( قل كفى بالله شهيدا بيني وبينكم ) أي : حسبي الله ، وهو الشاهد علي وعليكم ، شاهد علي فيما بلغت عنه من الرسالة ، وشاهد عليكم أيها المكذبون فيما تفترونه من البهتان .( ومن عنده علم الكتاب ) قيل : نزلت في عبد الله بن سلام . قاله مجاهد .\nوهذا القول غريب; لأن هذه الآية مكية ، وعبد الله بن سلام إنما أسلم في أول مقدم رسول الله - صلى الله عليه وسلم - المدينة . والأظهر في هذا ما قاله العوفي ، عن ابن عباس قال : هم من اليهود والنصارى .\nوقال قتادة : منهم ابن سلام ، وسلمان ، وتميم الداري .\nوقال مجاهد - في رواية - عنه : هو الله تعالى .\nوكان سعيد بن جبير ينكر أن يكون المراد بها عبد الله بن سلام ، ويقول : هي مكية ، وكان يقرؤها :  ، ويقول : من عند الله .\nوكذا قرأها مجاهد والحسن البصري .\nوقد روى ابن جرير من حديث ، هارون الأعور ، عن الزهري ، عن سالم ، عن ابن عمر; أن رسول الله - صلى الله عليه وسلم - قرأها :  ومن عنده علم الكتاب \" ، ثم قال : لا أصل له من حديث الزهري عند الثقات .\nقلت : وقد رواه الحافظ أبو يعلى في مسنده ، من طريق هارون بن موسى هذا ، عن سليمان بن أرقم - وهو ضعيف - عن الزهري ، عن سالم ، عن أبيه مرفوعا كذلك . ولا يثبت . والله أعلم\nوالصحيح في هذا : أن ) ومن عنده ) اسم جنس يشمل علماء أهل الكتاب الذين يجدون صفة محمد - صلى الله عليه وسلم - ونعته في كتبهم المتقدمة ، من بشارات الأنبياء به ، كما قال تعالى : ( ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة والذين هم بآياتنا يؤمنون الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل )[ الأعراف : 156 ، 157 ] وقال تعالى : ( أولم يكن لهم آية أن يعلمه علماء بني إسرائيل )[ الشعراء : 197 ] . وأمثال ذلك مما فيه الإخبار عن علماء بني إسرائيل : أنهم يعلمون ذلك من كتبهم المنزلة . وقد ورد في حديث الأحبار ، عن عبد الله بن سلام بأنه أسلم بمكة قبل الهجرة . قال الحافظ أبو نعيم الأصبهاني في كتاب  ، وهو كتاب جليل :\nحدثنا سليمان بن أحمد الطبراني ، حدثنا عبدان بن أحمد ، حدثنا محمد بن مصفى ، حدثنا الوليد بن مسلم ، عن محمد بن حمزة بن يوسف ، بن عبد الله بن سلام ، عن أبيه ، أن عبد الله بن سلام قال لأحبار اليهود : إني أردت أن أجدد بمسجد أبينا إبراهيم وإسماعيل عهدا فانطلق إلى رسول الله - صلى الله عليه وسلم - وهو بمكة ، فوافاهم وقد انصرفوا من الحج ، فوجد رسول الله ، بمنى ، والناس حوله ، فقام مع الناس ، فلما نظر إليه رسول الله - صلى الله عليه وسلم - قال :  قال : قلت : نعم . قال :  . فدنوت منه ، قال :  فقلت له : انعت ربنا . قال : فجاء جبريل حتى وقف بين يدي رسول الله - صلى الله عليه وسلم - فقال له : ( قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوا أحد )[ سورة الإخلاص ] فقرأها علينا رسول الله - صلى الله عليه وسلم - فقال ابن سلام : أشهد أن لا إله إلا الله ، وأنك رسول الله . ثم انصرف ابن سلام إلى المدينة فكتم إسلامه . فلما هاجر رسول الله - صلى الله عليه وسلم - إلى المدينة وأنا فوق نخلة لي أجدها ، فألقيت نفسي ، فقالت أمي : [ لله ] أنت ، لو كان موسى بن عمران ما كان لك أن تلقي نفسك من رأس النخلة . فقلت : والله لأني أسر بقدوم رسول الله - صلى الله عليه وسلم - من موسى بن عمران إذ بعث .\nوهذا حديث غريب جدا .\nآخر تفسير سورة الرعد ولله الحمد والمنة."
  } ]
}