{
  "id" : 60,
  "name" : "المُمتَحنَة",
  "type" : "مدنيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِم بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُم مِّنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ ۙ أَن تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِن كُنتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي ۚ تُسِرُّونَ إِلَيْهِم بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنتُمْ ۚ وَمَن يَفْعَلْهُ مِنكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ (1) ",
    "tafsir" : "\nكان سبب نزول صدر هذه السورة الكريمة قصة حاطب بن أبي بلتعة ، وذلك أن حاطبا هذا كان رجلا من المهاجرين ، وكان من أهل بدر أيضا ، وكان له بمكة أولاد ومال ، ولم يكن من قريش أنفسهم ، بل كان حليفا لعثمان . فلما عزم رسول الله - صلى الله عليه وسلم - على فتح مكة لما نقض أهلها العهد ، فأمر النبي - صلى الله عليه وسلم - المسلمين بالتجهيز لغزوهم ، وقال :  . فعمد حاطب هذا فكتب كتابا ، وبعثه مع امرأة من قريش إلى أهل مكة ، يعلمهم بما عزم عليه رسول الله - صلى الله عليه وسلم - من غزوهم ، ليتخذ بذلك عندهم يدا ، فأطلع الله رسوله على ذلك استجابة لدعائه . فبعث في أثر المرأة فأخذ الكتاب منها ، وهذا بين في هذا الحديث المتفق على صحته . قال الإمام أحمد :\nحدثنا سفيان ، عن عمرو ، أخبرني حسن بن محمد بن علي ، أخبرني عبيد الله بن أبي رافع - وقال مرة : إن عبيد الله بن أبي رافع أخبره : أنه سمع عليا رضي الله عنه ، يقول : بعثني رسول الله - صلى الله عليه وسلم - أنا ، والزبير ، والمقداد فقال :  . فانطلقنا تعادى بنا خيلنا حتى أتينا الروضة ، فإذا نحن بالظعينة ، قلنا : أخرجي الكتاب . قالت : ما معي كتاب . قلنا : لتخرجن الكتاب أو لنلقين الثياب . قال : فأخرجت الكتاب من عقاصها ، فأخذنا الكتاب فأتينا به رسول الله - صلى الله عليه وسلم - فإذا فيه : من حاطب بن أبي بلتعة إلى ناس من المشركين بمكة يخبرهم ببعض أمر رسول الله - صلى الله عليه وسلم - . فقال رسول الله - صلى الله عليه وسلم - :  . قال : لا تعجل علي ، إني كنت امرأ ملصقا في قريش ، ولم أكن من أنفسهم ، وكان من معك من المهاجرين لهم قرابات يحمون أهليهم بمكة ، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي ، وما فعلت ذلك كفرا ولا ارتدادا عن ديني ولا رضا بالكفر بعد الإسلام . فقال رسول الله - صلى الله عليه وسلم - :  . فقال عمر : دعني أضرب عنق هذا المنافق . فقال : \nوهكذا أخرجه الجماعة إلا ابن ماجه ، من غير وجه ، عن سفيان بن عيينة به . . وزاد البخاري في كتاب  : فأنزل الله السورة : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ) . وقال في كتاب التفسير : قال عمرو : ونزلت فيه : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ) . قال البخاري : قال علي - يعني : ابن المديني - : قيل لسفيان في هذا : نزلت ( لا تتخذوا عدوي وعدوكم أولياء ) ؟ فقال سفيان : هذا في حديث الناس ، حفظته من عمرو ما تركت منه حرفا ، وما أرى أحدا حفظه غيري .\nوقد أخرجاه في الصحيحين من حديث حصين بن عبد الرحمن ، عن سعد بن عبيدة عن أبي عبد الرحمن السلمي ، عن علي قال : بعثني رسول الله - صلى الله عليه وسلم - وأبا مرثد والزبير بن العوام ، وكلنا فارس ، وقال : انطلقوا حتى تأتوا روضة خاخ ، فإن بها امرأة من المشركين معها كتاب من حاطب إلى المشركين : فأدركناها تسير على بعير لها حيث قال رسول الله - صلى الله عليه وسلم - فقلنا : الكتاب ؟ فقالت : ما معي كتاب . فأنخناها فالتمسنا فلم نر كتابا ، فقلنا : ما كذب رسول الله - صلى الله عليه وسلم - ! لتخرجن الكتاب أو لنجردنك . فلما رأت الجد أهوت إلى حجزتها وهي محتجزة بكساء فأخرجته . فانطلقنا بها إلى رسول الله - صلى الله عليه وسلم - فقال عمر : يا رسول الله ، قد خان الله ورسوله والمؤمنين ، فدعني فلأضرب عنقه . فقال :  . قال : والله ما بي إلا أن أكون مؤمنا بالله ورسوله ، أردت أن تكون لي عند القوم يد يدفع الله بها عن أهلي ومالي ، وليس أحد من أصحابك إلا له هنالك من عشيرته من يدفع الله به عن أهله وماله . فقال :  . فقال عمر : إنه قد خان الله ورسوله والمؤمنين ، فدعني فلأضرب عنقه . فقال :  . فدمعت عينا عمر ، وقال : الله ورسوله أعلم .\nهذا لفظ البخاري في  في غزوة بدر وقد روي من وجه آخر عن علي قال ابن أبي حاتم :\nحدثنا علي بن الحسن الهسنجاني ، حدثنا عبيد بن يعيش ، حدثنا إسحاق بن سليمان الرازي ، عن أبي سنان - هو سعيد بن سنان ، - عن عمرو بن مرة الجملي ، عن أبي البختري الطائي ، عن الحارث عن علي قال : لما أراد النبي - صلى الله عليه وسلم - أن يأتي مكة أسر إلى أناس من أصحابه أنه يريد مكة ، فيهم حاطب بن أبي بلتعة وأفشى في الناس أنه يريد خيبر . قال : فكتب حاطب بن أبي بلتعة إلى أهل مكة أن رسول الله - صلى الله عليه وسلم - يريدكم . فأخبر رسول الله - صلى الله عليه وسلم - قال : فبعثني رسول الله - صلى الله عليه وسلم - وأبا مرثد ، وليس منا رجل إلا وعنده فرس ، فقال :  . فانطلقنا حتى رأيناها بالمكان الذي ذكر رسول الله - صلى الله عليه وسلم - . فقلنا لها : هات الكتاب . فقالت : ما معي كتاب . فوضعنا متاعها وفتشناها فلم نجده في متاعها ، فقال أبو مرثد : لعله ألا يكون معها . فقلت : ما كذب رسول الله - صلى الله عليه وسلم - ولا كذبنا . فقلنا لها : لتخرجنه أو لنعرينك . فقالت : أما تتقون الله ؟ ! ألستم مسلمين ؟ فقلنا : لتخرجنه أو لنعرينك . قال عمرو بن مرة : فأخرجته من حجزتها . وقال حبيب بن أبي ثابت : أخرجته من قبلها . فأتينا به رسول الله - صلى الله عليه وسلم - فإذا الكتاب من حاطب بن أبي بلتعة . فقام عمر فقال : يا رسول الله ، خان الله ورسوله ، فائذن لي فلأضرب عنقه . فقال رسول الله :  . قالوا : بلى . وقال عمر : بلى ، ولكنه قد نكث وظاهر أعداءك عليك . فقال رسول الله - صلى الله عليه وسلم - :  . ففاضت عينا عمر وقال : الله ورسوله أعلم . فأرسل رسول الله - صلى الله عليه وسلم - إلى حاطب فقال :  . فقال : يا رسول الله ، إني كنت امرأ ملصقا في قريش ، وكان لي بها مال وأهل ، ولم يكن من أصحابك أحد إلا وله بمكة من يمنع أهله وماله ، فكتبت إليهم بذلك ووالله - يا رسول الله - إني لمؤمن بالله ورسوله . فقال رسول الله - صلى الله عليه وسلم - :  . قال حبيب بن أبي ثابت : فأنزل الله : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة )\nوهكذا رواه ابن جرير ، عن ابن حميد ، عن مهران ، عن أبي سنان - سعيد بن سنان - بإسناده مثله . وقد ذكر ذلك أصحاب المغازي والسير ، فقال محمد بن إسحاق بن يسار في السيرة .\nحدثني محمد بن جعفر بن الزبير ، عن عروة بن الزبير وغيره من علمائنا قال : لما أجمع رسول الله - صلى الله عليه وسلم - المسير إلى مكة ، كتب حاطب بن أبي بلتعة كتابا إلى قريش يخبرهم بالذي أجمع عليه رسول الله - صلى الله عليه وسلم - من الأمر في السير إليهم ، ثم أعطاه امرأة - زعم محمد بن جعفر أنها من مزينة وزعم غيره أنها : سارة مولاة لبني عبد المطلب - وجعل لها جعلا على أن تبلغه قريشا فجعلته في رأسها ، ثم فتلت عليه قرونها ، ثم خرجت به . وأتى رسول الله - صلى الله عليه وسلم - الخبر من السماء بما صنع حاطب ، فبعث علي بن أبي طالب ، والزبير بن العوام ، فقال : \nفخرجا حتى أدركاها بالخليفة - خليفة بني أبي أحمد - فاستنزلاها بالخليفة ، فالتمسا في رحلها فلم يجدا شيئا ، فقال لها علي بن أبي طالب : إني أحلف بالله ما كذب رسول الله وما كذبنا ولتخرجن لنا هذا الكتاب أو لنكشفنك . فلما رأت الجد منه قالت : أعرض . فأعرض ، فحلت قرون رأسها ، فاستخرجت الكتاب منها ، فدفعته إليه . فأتى به رسول الله - صلى الله عليه وسلم - فدعا رسول الله حاطبا فقال :  . فقال : يا رسول الله ، أما والله إني لمؤمن بالله ورسوله ما غيرت ولا بدلت ، ولكني كنت امرأ ليس لي في القوم من أهل ولا عشيرة ، وكان لي بين أظهرهم ولد وأهل فصانعتهم عليهم فقال عمر بن الخطاب : يا رسول الله ، دعني فلأضرب عنقه ، فإن الرجل قد نافق . فقال رسول الله - صلى الله عليه وسلم - :  . فأنزل الله ، عز وجل ، في حاطب : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة ) إلى قوله : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده )[ الممتحنة : 4 ] إلى آخر القصة .\nوروى معمر ، عن الزهري ، عن عروة نحو ذلك . وهكذا ذكر مقاتل بن حيان : أن هذه الآيات نزلت في حاطب بن أبي بلتعة : أنه بعث سارة مولاة بني هاشم ، وأنه أعطاها عشرة دراهم ، وأن رسول الله - صلى الله عليه وسلم - بعث في أثرها عمر بن الخطاب ، وعلي بن أبي طالب ، رضي الله عنهما ، فأدركاها بالجحفة . . . وذكر تمام القصة كنحو ما تقدم . وعن السدي قريبا منه . وهكذا قال العوفي ، عن ابن عباس ، ومجاهد ، وقتادة ، وغير واحد : أن هذه الآيات نزلت في حاطب بن أبي بلتعة .\nفقوله تعالى : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق ) يعني : المشركين والكفار الذين هم محاربون لله ولرسوله وللمؤمنين ، الذين شرع الله عداوتهم ومصارمتهم ، ونهى أن يتخذوا أولياء ، وأصدقاء ، وأخلاء ، كما قال ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم )[ المائدة : 51 ] . وهذا تهديد شديد ووعيد أكيد ، وقال تعالى : ( يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء واتقوا الله إن كنتم مؤمنين )[ المائدة : 57 ] وقال تعالى : ( يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا )[ النساء : 144 ] . وقال تعالى : ( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه )[ آل عمران : 28 ] ; ولهذا قبل رسول الله - صلى الله عليه وسلم - عذر حاطب لما ذكر أنه إنما فعل ذلك مصانعة لقريش ، لأجل ما كان له عندهم من الأموال والأولاد .\nويذكر ها هنا الحديث الذي رواه الإمام أحمد :\nحدثنا مصعب بن سلام ، حدثنا الأجلح ، عن قيس بن أبي مسلم ، عن ربعي بن حراش ، سمعت حذيفة يقول : ضرب لنا رسول الله - صلى الله عليه وسلم - أمثالا : واحدا ، وثلاثة ، وخمسة ، وسبعة ، وتسعة ، وأحد عشر - قال : فضرب لنا منها مثلا وترك سائرها ، قال : ( يخرجون الرسول وإياكم ) هذا مع ما قبله من التهييج على عداوتهم وعدم موالاتهم ، لأنهم أخرجوا الرسول وأصحابه من بين أظهرهم كراهة لما هم عليه من التوحيد وإخلاص العبادة لله وحده ; ولهذا قال : ( أن تؤمنوا بالله ربكم ) أي : لم يكن لكم عندهم ذنب إلا إيمانكم بالله رب العالمين ، كقوله : ( وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد )[ البروج : 8 ] ، وكقوله ( الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله )[ الحج : 40 ]( إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي ) أي : إن كنتم كذلك فلا تتخذوهم أولياء ، إن كنتم خرجتم مجاهدين في سبيلي باغين لمرضاتي عنكم فلا توالوا أعدائي وأعداءكم ، وقد أخرجوكم من دياركم وأموالكم حنقا عليكم وسخطا لدينكم .( تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم ) أي : تفعلون ذلك وأنا العالم بالسرائر والضمائر والظواهر ( ومن يفعله منكم فقد ضل سواء السبيل)"
  }, {
    "id" : 2,
    "eya" : "إِن يَثْقَفُوكُمْ يَكُونُوا لَكُمْ أَعْدَاءً وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُم بِالسُّوءِ وَوَدُّوا لَوْ تَكْفُرُونَ (2) ",
    "tafsir" : "( وودوا لو تكفرون ) أي : ويحرصون على ألا تنالوا خيرا ، فهم عداوتهم لكم كامنة وظاهرة ، فكيف توالون مثل هؤلاء ؟ وهذا تهييج على عداوتهم أيضا ."
  }, {
    "id" : 3,
    "eya" : "لَن تَنفَعَكُمْ أَرْحَامُكُمْ وَلَا أَوْلَادُكُمْ ۚ يَوْمَ الْقِيَامَةِ يَفْصِلُ بَيْنَكُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (3) ",
    "tafsir" : "( لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير ) أي : قراباتكم لا تنفعكم عند الله إذا أراد الله بكم سوءا ، ونفعهم لا يصل إليكم إذا أرضيتموهم بما يسخط الله ، ومن وافق أهله على الكفر ليرضيهم فقد خاب وخسر وضل عمله ، ولا ينفعه عند الله قرابته من أحد ، ولو كان قريبا إلى نبي من الأنبياء . قال الإمام أحمد :\nحدثنا عفان ، حدثنا حماد ، عن ثابت ، عن أنس أن رجلا قال : يا رسول الله : أين أبي ؟ قال :  فلما قفى دعاه فقال : \nورواه مسلم ، وأبو داود ، من حديث حماد بن سلمة به ."
  }, {
    "id" : 4,
    "eya" : "قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنكُمْ وَمِمَّا تَعْبُدُونَ مِن دُونِ اللَّهِ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ أَبَدًا حَتَّىٰ تُؤْمِنُوا بِاللَّهِ وَحْدَهُ إِلَّا قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَمَا أَمْلِكُ لَكَ مِنَ اللَّهِ مِن شَيْءٍ ۖ رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ (4) ",
    "tafsir" : "( قد كانت لكم أسوة حسنة في إبراهيم والذين معه ) أي : وأتباعه الذين آمنوا معه ( إذ قالوا لقومهم إنا برآء منكم ) أي : تبرأنا منكم ( ومما تعبدون من دون الله كفرنا بكم ) أي : بدينكم وطريقكم ( وبدا بيننا وبينكم العداوة والبغضاء أبدا ) يعني : وقد شرعت العداوة والبغضاء من الآن بيننا وبينكم ، ما دمتم على كفركم فنحن أبدا نتبرأ منكم ونبغضكم ( حتى تؤمنوا بالله وحده ) أي : إلى أن توحدوا الله فتعبدوه وحده لا شريك له ، وتخلعوا ما تعبدون معه من الأنداد والأوثان .( إلا قول إبراهيم لأبيه لأستغفرن لك ) أي : لكم في إبراهيم وقومه أسوة حسنة تتأسون بها ، إلا في استغفار إبراهيم لأبيه ، فإنه إنما كان عن موعدة وعدها إياه ، فلما تبين له أنه عدو لله تبرأ منه . وذلك أن بعض المؤمنين كانوا يدعون لآبائهم الذين ماتوا على الشرك ويستغفرون لهم ، ويقولون : إن إبراهيم كان يستغفر لأبيه ، فأنزل الله ، عز وجل : ( ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم )[ التوبة : 113 ، 114 ] . وقال تعالى في هذه الآية الكريمة : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه ) إلى قوله : ( إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء ) أي : ليس لكم في ذلك أسوة ، أي : في الاستغفار للمشركين ، هكذا قال ابن عباس ، ومجاهد ، وقتادة ، ومقاتل ، والضحاك ، وغير واحد .\nثم قال تعالى مخبرا عن قول إبراهيم والذين معه ، حين فارقوا قومهم وتبرءوا منهم ، فلجئوا إلى الله وتضرعوا إليه فقالوا : ( ربنا عليك توكلنا وإليك أنبنا وإليك المصير ) أي : توكلنا عليك في جميع الأمور ، وسلمنا أمورنا إليك ، وفوضناها إليك ( وإليك المصير ) أي : المعاد في الدار الآخرة ."
  }, {
    "id" : 5,
    "eya" : "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ (5) ",
    "tafsir" : "( ربنا لا تجعلنا فتنة للذين كفروا ) قال مجاهد : معناه : لا تعذبنا بأيديهم ، ولا بعذاب من عندك ، فيقولوا : لو كان هؤلاء على حق ما أصابهم هذا . وكذا قال الضحاك .\nوقال قتادة لا تظهرهم علينا فيفتتنوا بذلك ، يرون أنهم إنما ظهروا علينا لحق هم عليه . واختاره ابن جرير .\nوقال علي بن أبي طلحة ، عن ابن عباس : لا تسلطهم علينا فيفتنونا .( واغفر لنا ربنا إنك أنت العزيز الحكيم ) أي : واستر ذنوبنا عن غيرك ، واعف عنها فيما بيننا وبينك ، ( إنك أنت العزيز الحكيم ) أي : الذي لا يضام من لاذ بجناحك ) الحكيم ) في أقوالك وأفعالك وشرعك وقدرك ."
  }, {
    "id" : 6,
    "eya" : "لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ ۚ وَمَن يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ (6) ",
    "tafsir" : "( لقد كان لكم فيهم أسوة حسنة لمن كان يرجو الله واليوم الآخر ) وهذا تأكيد لما تقدم ومستثنى منه ما تقدم أيضا لأن هذه الأسوة المثبتة ها هنا هي الأولى بعينها .( لمن كان يرجو الله واليوم الآخر ) تهييج إلى ذلك كل مقر بالله والمعاد .( ومن يتول ) أي : عما أمر الله به ، ( فإن الله هو الغني الحميد )( إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد )[ إبراهيم : 8 ]\nوقال علي بن أبي طلحة عن ابن عباس : ( الغني ) الذي قد كمل في غناه ، وهو الله ، هذه صفته لا تنبغي إلا له ، ليس له كفء ، وليس كمثله شيء ، سبحان الله الواحد القهار . ) الحميد ) المستحمد إلى خلقه ، أي : هو المحمود في جميع أفعاله وأقواله ، لا إله غيره ، ولا رب سواه ."
  }, {
    "id" : 7,
    "eya" : "۞ عَسَى اللَّهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً ۚ وَاللَّهُ قَدِيرٌ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ (7) ",
    "tafsir" : "( عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة ) أي : محبة بعد البغضة ، ومودة بعد النفرة ، وألفة بعد الفرقة . ( والله قدير ) أي : على ما يشاء من الجمع بين الأشياء المتنافرة ، والمتباينة ، والمختلفة ، فيؤلف بين القلوب بعد العداوة والقساوة ، فتصبح مجتمعة متفقة ، كما قال تعالى ممتنا على الأنصار : ( واذكروا نعمة الله عليكم إذ كنتم أعداء فألف بين قلوبكم فأصبحتم بنعمته إخوانا وكنتم على شفا حفرة من النار فأنقذكم منها )[ آل عمران : 103 ] . وكذا قال لهم النبي - صلى الله عليه وسلم - :  . وقال الله تعالى : ( هو الذي أيدك بنصره وبالمؤمنين وألف بين قلوبهم لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم ولكن الله ألف بينهم إنه عزيز حكيم )[ الأنفال : 62 ، 63 ] . وفي الحديث  . وقال الشاعر\nوقد يجمع الله الشتيتين بعد ما يظنان كل الظن ألا تلاقيا\nوقوله تعالى : ( والله غفور رحيم ) أي : يغفر للكافرين كفرهم إذا تابوا منه وأنابوا إلى ربهم وأسلموا له ، وهو الغفور الرحيم بكل من تاب إليه ، من أي ذنب كان .\nوقد قال مقاتل بن حيان : إن هذه الآية نزلت في أبي سفيان صخر بن حرب ، فإن رسول الله - صلى الله عليه وسلم - تزوج ابنته فكانت هذه مودة ما بينه وبينه .\nوفي هذا الذي قاله مقاتل نظر ; فإن رسول الله تزوج بأم حبيبة بنت أبي سفيان قبل الفتح وأبو سفيان إنما أسلم ليلة الفتح بلا خلاف . وأحسن من هذا ما رواه ابن أبي حاتم حيث قال :\nقرئ على محمد بن عزيز : حدثني سلامة ، حدثني عقيل ، حدثني ابن شهاب ; أن رسول الله - صلى الله عليه وسلم - استعمل أبا سفيان بن حرب على بعض اليمن فلما قبض رسول الله - صلى الله عليه وسلم - أقبل فلقي ذا الخمار مرتدا ، فقاتله ، فكان أول من قاتل في الردة وجاهد عن الدين . قال ابن شهاب : وهو ممن أنزل الله فيه : ( عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة والله قدير والله غفور رحيم )\nوفي صحيح مسلم ، عن ابن عباس : أن أبا سفيان قال : يا رسول الله ، ثلاث أعطنيهن . قال :  . قال : وتؤمرني حتى أقاتل الكفار كما كنت أقاتل المسلمين . قال :  . قال : ومعاوية تجعله كاتبا بين يديك . قال :  . قال : وعندي أحسن العرب وأجمله ، أم حبيبة بنت أبي سفيان أزوجكها . . . الحديث . وقد تقدم الكلام عليه ."
  }, {
    "id" : 8,
    "eya" : "لَّا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَارِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ (8) ",
    "tafsir" : "( لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ولم يخرجوكم من دياركم ) أي لا ينهاكم عن الإحسان إلى الكفرة الذين لا يقاتلونكم في الدين ، كالنساء والضعفة منهم ، ( أن تبروهم ) أي : تحسنوا إليهم ( وتقسطوا إليهم ) أي : تعدلوا ( إن الله يحب المقسطين )\nقال الإمام أحمد : حدثنا أبو معاوية ، حدثنا هشام بن عروة ، عن فاطمة بنت المنذر ، عن أسماء - هي بنت أبي بكر ، رضي الله عنهما - قالت : قدمت أمي وهي مشركة في عهد قريش إذ عاهدوا ، فأتيت النبي - صلى الله عليه وسلم - فقلت : يا رسول الله ، إن أمي قدمت وهي راغبة ، أفأصلها ؟ قال : \nوقال الإمام أحمد : حدثنا عارم ، حدثنا عبد الله بن المبارك ، حدثنا مصعب بن ثابت ، حدثنا عامر بن عبد الله بن الزبير ، عن أبيه قال : قدمت قتيلة على ابنتها أسماء بنت أبي بكر بهدايا : صناب ، وأقط ، وسمن ، وهي مشركة ، فأبت أسماء أن تقبل هديتها ، وأن تدخلها بيتها ، فسألت عائشة النبي - صلى الله عليه وسلم - فأنزل الله ، عز وجل : ( لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ) إلى آخر الآية ، فأمرها أن تقبل هديتها ، وأن تدخلها بيتها .\nوهكذا رواه ابن جرير ، وابن أبي حاتم ، من حديث مصعب بن ثابت به . وفي رواية لأحمد ، وابن جرير :  في المدة التي كانت بين قريش ، ورسول الله - صلى الله عليه وسلم - \" .\nوقال أبو بكر أحمد بن عمرو بن عبد الخالق البزار : حدثنا عبد الله بن شبيب ، حدثنا أبو بكر بن أبي شيبة ، حدثنا أبو قتادة العدوي ، عن ابن أخي الزهري ، عن الزهري ، عن عروة عن عائشة وأسماء أنهما قالتا : قدمت علينا أمنا المدينة وهي مشركة ، في الهدنة التي كانت بين قريش وبين رسول الله - صلى الله عليه وسلم - فقلنا : يا رسول الله ، إن أمنا قدمت علينا المدينة راغبة ، أفنصلها ؟ قال : \nثم قال : وهذا الحديث لا نعلمه يروى عن الزهري ، عن عروة ، عن عائشة إلا من هذا الوجه .\nقلت : وهو منكر بهذا السياق ; لأن أم عائشة هي أم رومان ، وكانت مسلمة مهاجرة ، وأم أسماء غيرها ، كما هو مصرح باسمها في هذه الأحاديث المتقدمة والله أعلم .( إن الله يحب المقسطين ) تقدم تفسير ذلك في سورة  ، وأورد الحديث الصحيح : "
  }, {
    "id" : 9,
    "eya" : "إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُم مِّن دِيَارِكُمْ وَظَاهَرُوا عَلَىٰ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ ۚ وَمَن يَتَوَلَّهُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ (9) ",
    "tafsir" : "( إنما ينهاكم الله عن الذين قاتلوكم في الدين وأخرجوكم من دياركم وظاهروا على إخراجكم أن تولوهم ) أي : إنما ينهاكم عن موالاة هؤلاء الذين ناصبوكم العداوة ، فقاتلوكم وأخرجوكم ، وعاونوا على إخراجكم ، ينهاكم الله عن موالاتهم ويأمركم بمعاداتهم . ثم أكد الوعيد على موالاتهم فقال : ( ومن يتولهم فأولئك هم الظالمون )( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم إن الله لا يهدي القوم الظالمين )[ المائدة : 51 ]"
  }, {
    "id" : 10,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ ۖ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ ۖ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلَا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ ۖ لَا هُنَّ حِلٌّ لَّهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ ۖ وَآتُوهُم مَّا أَنفَقُوا ۚ وَلَا جُنَاحَ عَلَيْكُمْ أَن تَنكِحُوهُنَّ إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ ۚ وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ وَاسْأَلُوا مَا أَنفَقْتُمْ وَلْيَسْأَلُوا مَا أَنفَقُوا ۚ ذَٰلِكُمْ حُكْمُ اللَّهِ ۖ يَحْكُمُ بَيْنَكُمْ ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ (10) ",
    "tafsir" : " ذكر صلح الحديبية الذي وقع بين رسول الله - صلى الله عليه وسلم - وبين كفار قريش فكان فيه :  . وفي رواية :  . وهذا قول عروة ، والضحاك ، وعبد الرحمن بن زيد ، والزهري ، ومقاتل ، والسدي . فعلى هذه الرواية تكون هذه الآية مخصصة للسنة ، وهذا من أحسن أمثلة ذلك ، وعلى طريقة بعض السلف ناسخة ، فإن الله ، عز وجل ، أمر عباده المؤمنين إذا جاءهم النساء مهاجرات أن يمتحنوهن ، فإن علموهن مؤمنات فلا يرجعوهن إلى الكفار ، لا هن حل لهم ولا هم يحلون لهن .\nوقد ذكرنا في ترجمة عبد الله بن أبي أحمد بن جحش ، من المسند الكبير ، من طريق أبي بكر بن أبي عاصم ، عن محمد بن يحيى الذهلي ، عن يعقوب بن محمد ، عن عبد العزيز بن عمران ، عن مجمع بن يعقوب ، عن حسين بن أبي لبانة ، عن عبد الله بن أبي أحمد قال : هاجرت أم كلثوم بنت عقبة بن أبي معيط في الهجرة ، فخرج أخواها عمارة ، والوليد حتى قدما على رسول الله - صلى الله عليه وسلم - فكلماه فيها أن يردها إليهما ، فنقض الله العهد بينه وبين المشركين في النساء خاصة ، ومنعهن أن يرددن إلى المشركين ، وأنزل الله آية الامتحان .\nقال ابن جرير : حدثنا أبو كريب ، حدثنا يونس بن بكير ، عن قيس بن الربيع ، عن الأغر بن الصباح ، عن خليفة ، عن حصين ، عن أبي نصر الأسدي قال : سئل ابن عباس : كيف كان امتحان رسول الله - صلى الله عليه وسلم - النساء ؟ قال : كان يمتحنهن : بالله ما خرجت من بغض زوج ؟ وبالله ما خرجت رغبة عن أرض إلى أرض ؟ وبالله ما خرجت التماس دنيا ؟ وبالله ما خرجت إلا حبا لله ولرسوله ؟ .\nثم رواه من وجه آخر ، عن الأغر بن الصباح به . وكذا رواه البزار من طريقه ، وذكر فيه أن الذي كان يحلفهن عن أمر رسول الله - صلى الله عليه وسلم - له عمر بن الخطاب .\nوقال العوفي ، عن ابن عباس في قوله : ( يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن ) كان امتحانهن أن يشهدن أن لا إله إلا الله ، وأن محمدا عبد الله ورسوله .\nوقال مجاهد : ( فامتحنوهن ) فاسألوهن : عما جاء بهن ؟ فإن كان بهن غضب على أزواجهن أو سخطة أو غيره ، ولم يؤمن فارجعوهن إلى أزواجهن .\nوقال عكرمة : يقال لها : ما جاء بك إلا حب الله ورسوله ؟ وما جاء بك عشق رجل منا ، ولا فرار من زوجك ؟ فذلك قوله : ( فامتحنوهن )\nوقال قتادة : كانت محنتهن أن يستحلفن بالله : ما أخرجكن النشوز ؟ وما أخرجكن إلا حب الإسلام وأهله وحرص عليه ؟ فإذا قلن ذلك قبل ذلك منهن .( فإن علمتموهن مؤمنات فلا ترجعوهن إلى الكفار ) فيه دلالة على أن الإيمان يمكن الاطلاع عليه يقينا .( لا هن حل لهم ولا هم يحلون لهن ) هذه الآية هي التي حرمت المسلمات على المشركين ، وقد كان جائزا في ابتداء الإسلام أن يتزوج المشرك المؤمنة ; ولهذا كان أبو العاص بن الربيع زوج ابنة النبي - صلى الله عليه وسلم - زينب رضي الله عنها ، وقد كانت مسلمة وهو على دين قومه ، فلما وقع في الأسارى يوم بدر بعثت امرأته زينب في فدائه بقلادة لها كانت لأمها خديجة ، فلما رآها رسول الله - صلى الله عليه وسلم - رق لها رقة شديدة ، وقال للمسلمين :  . ففعلوا ، فأطلقه رسول الله - صلى الله عليه وسلم - على أن يبعث ابنته إليه ، فوفى له بذلك وصدقه فيما وعده ، وبعثها إلى رسول الله - صلى الله عليه وسلم - مع زيد بن حارثة ، رضي الله عنه ، فأقامت بالمدينة من بعد وقعة بدر وكانت سنة اثنتين إلى أن أسلم زوجها العاص بن الربيع سنة ثمان فردها عليه بالنكاح الأول ، ولم يحدث لها صداقا ، كما قال الإمام أحمد :\nحدثنا يعقوب ، حدثنا أبي ، حدثنا ابن إسحاق ، حدثنا داود بن الحصين ، عن عكرمة ، عن ابن عباس ، أن رسول الله - صلى الله عليه وسلم - رد ابنته زينب على أبي العاص بن الربيع وكانت هجرتها قبل إسلامه بست سنين على النكاح الأول ، ولم يحدث شهادة ولا صداقا .\nورواه أبو داود ، والترمذي ، وابن ماجه . ومنهم من يقول :  ، وهو صحيح ; لأن إسلامه كان بعد تحريم المسلمات على المشركين بسنتين . وقال الترمذي : \nقلت : وقد روى حديث الحجاج بن أرطاة ، عن عمرو بن شعيب الإمام أحمد ، والترمذي ، وابن ماجه ، وضعفه الإمام أحمد ، وغير واحد ، والله أعلم .\nوأجاب الجمهور عن حديث ابن عباس بأن ذلك كان قضية عين يحتمل أنه لم تنقض عدتها منه ; لأن الذي عليه الأكثرون أنها متى انقضت العدة ولم يسلم انفسخ نكاحها منه .\nوقال آخرون : بل إذا انقضت العدة هي بالخيار ، إن شاءت أقامت على النكاح واستمرت ، وإن شاءت فسخته وذهبت فتزوجت ، وحملوا عليه حديث ابن عباس ، والله أعلم .( وآتوهم ما أنفقوا ) يعني : أزواج المهاجرات من المشركين ، ادفعوا إليهم الذي غرموه عليهن من الأصدقة . قاله ابن عباس ، ومجاهد ، وقتادة ، والزهري ، وغير واحد .( ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن ) يعني : إذا أعطيتموهن أصدقتهن فانكحوهن ، أي : تزوجوهن بشرطه من انقضاء العدة ، والولي ، وغير ذلك .( ولا تمسكوا بعصم الكوافر ) تحريم من الله ، عز وجل ، على عباده المؤمنين نكاح المشركات ، والاستمرار معهن .\nوفي الصحيح ، عن الزهري ، عن عروة ، عن المسور ، ومروان بن الحكم : أن رسول الله - صلى الله عليه وسلم - لما عاهد كفار قريش يوم الحديبية جاء نساء من المؤمنات ، فأنزل الله عز وجل : ( يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن ) إلى قوله : ( ولا تمسكوا بعصم الكوافر ) فطلق عمر بن الخطاب يومئذ امرأتين ، تزوج إحداهما معاوية بن أبي سفيان ، والأخرى صفوان بن أمية .\nوقال ابن ثور ، عن معمر ، عن الزهري : أنزلت هذه الآية على رسول الله - صلى الله عليه وسلم - وهو بأسفل الحديبية حين صالحهم على أنه من أتاه منهم رده إليهم ، فلما جاءه النساء نزلت هذه الآية ، وأمره أن يرد الصداق إلى أزواجهن ، وحكم على المشركين مثل ذلك إذا جاءتهم امرأة من المسلمين أن يردوا الصداق إلى زوجها ، وقال : ( ولا تمسكوا بعصم الكوافر ) وهكذا قال عبد الرحمن بن زيد بن أسلم ، وقال : وإنما حكم الله بينهم بذلك ، لأجل ما كان بينهم وبينهم من العهد .\nوقال محمد بن إسحاق ، عن الزهري : طلق عمر يومئذ قريبة بنت أبي أمية بن المغيرة ، فتزوجها معاوية ، وأم كلثوم بنت عمرو بن جرول الخزاعية ، وهي أم عبيد الله ، فتزوجها أبو جهم بن حذيفة بن غانم ، رجل من قومه ، وهما على شركهما ، وطلق طلحة بن عبيد الله أروى بنت ربيعة بن الحارث بن عبد المطلب ، فتزوجها بعده خالد بن سعيد بن العاص .( واسألوا ما أنفقتم وليسألوا ما أنفقوا ) أي : وطالبوا بما أنفقتم على أزواجكم اللاتي يذهبن إلى الكفار ، إن ذهبن ، وليطالبوا بما أنفقوا على أزواجهم اللاتي هاجرن إلى المسلمين .( ذلكم حكم الله يحكم بينكم ) أي : في الصلح واستثناء النساء منه ، والأمر بهذا كله هو حكم الله يحكم به بين خلقه : ( والله عليم حكيم ) أي عليم بما يصلح عباده ، حكيم في ذلك ."
  }, {
    "id" : 11,
    "eya" : "وَإِن فَاتَكُمْ شَيْءٌ مِّنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ فَعَاقَبْتُمْ فَآتُوا الَّذِينَ ذَهَبَتْ أَزْوَاجُهُم مِّثْلَ مَا أَنفَقُوا ۚ وَاتَّقُوا اللَّهَ الَّذِي أَنتُم بِهِ مُؤْمِنُونَ (11) ",
    "tafsir" : "( وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا ) قال مجاهد ، وقتادة : هذا في الكفار الذين ليس لهم عهد ، إذا فرت إليهم امرأة ولم يدفعوا إلى زوجها شيئا ، فإذا جاءت منهم امرأة لا يدفع إلى زوجها شيء ، حتى يدفع إلى زوج الذاهبة إليهم مثل نفقته عليها .\nوقال ابن جرير : حدثنا يونس حدثنا ابن وهب ، أخبرني يونس ، عن الزهري قال : أقر المؤمنون بحكم الله ، فأدوا ما أمروا به من نفقات المشركين التي أنفقوا على نسائهم ، وأبى المشركون أن يقروا بحكم الله فيما فرض عليهم من أداء نفقات المسلمين ، فقال الله للمؤمنين به : ( وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا واتقوا الله الذي أنتم به مؤمنون ) فلو أنها ذهبت بعد هذه الآية امرأة من أزواج المؤمنين إلى المشركين ، رد المؤمنون إلى زوجها النفقة التي أنفق عليها من العقب الذي بأيديهم الذي أمروا أن يردوه على المشركين من نفقاتهم التي أنفقوا على أزواجهم اللاتي آمن وهاجرن ، ثم ردوا إلى المشركين فضلا إن كان بقي لهم . والعقب : ما كان بأيدي المؤمنين من صداق نساء الكفار حين آمن وهاجرن .\nوقال العوفي ، عن ابن عباس في هذه الآية : يعني إن لحقت امرأة رجل من المهاجرين بالكفار ، أمر له رسول الله - صلى الله عليه وسلم - أنه يعطى من الغنيمة مثل ما أنفق .\nوهكذا قال مجاهد : ( فعاقبتم ) أصبتم غنيمة من قريش أو غيرهم ( فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا ) يعني : مهر مثلها . وهكذا قال مسروق ، وإبراهيم ، وقتادة ، ومقاتل ، والضحاك ، وسفيان بن حسين ، والزهري أيضا .\nوهذا لا ينافي الأول ; لأنه إن أمكن الأول فهو أولى ، وإلا فمن الغنائم اللاتي تؤخذ من أيدي الكفار . وهذا أوسع ، وهو اختيار ابن جرير ، ولله الحمد والمنة ."
  }, {
    "id" : 12,
    "eya" : "يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَىٰ أَن لَّا يُشْرِكْنَ بِاللَّهِ شَيْئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ وَلَا يَقْتُلْنَ أَوْلَادَهُنَّ وَلَا يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ ۙ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ (12) ",
    "tafsir" : "( يا أيها النبي إذا جاءك المؤمنات يبايعنك ) إلى قوله : ( غفور رحيم ) قال عروة : قالت عائشة : فمن أقر بهذا الشرط من المؤمنات ، قال لها رسول الله - صلى الله عليه وسلم - :  ، كلاما ، ولا والله ما مست يده يد امرأة قط في المبايعة ، ما يبايعهن إلا بقوله :  هذا لفظ البخاري .\nوقال الإمام أحمد : حدثنا عبد الرحمن بن مهدي ، حدثنا سفيان ، عن محمد بن المنكدر ، عن أميمة بنت رقيقة قالت : أتيت رسول الله - صلى الله عليه وسلم - في نساء لنبايعه ، فأخذ علينا ما في القرآن : ( أن لا يشركن بالله شيئا ) الآية ، وقال :  ، قلنا : الله ورسوله أرحم بنا من أنفسنا ، قلنا : يا رسول الله ، ألا تصافحنا ؟ قال \nهذا إسناد صحيح ، وقد رواه الترمذي ، والنسائي ، وابن ماجه ، من حديث سفيان بن عيينة ، - والنسائي أيضا من حديث الثوري ، - ومالك بن أنس كلهم ، عن محمد بن المنكدر به . . وقال الترمذي : حسن صحيح ، لا نعرفه إلا من حديث محمد بن المنكدر .\nوقد رواه أحمد أيضا من حديث محمد بن إسحاق ، عن محمد بن المنكدر ، عن أميمة به . وزاد :  . وكذا رواه ابن جرير من طريق موسى بن عقبة ، عن محمد بن المنكدر به . . ورواه ابن أبي حاتم من حديث أبي جعفر الرازي ، عن محمد بن المنكدر : حدثتني أميمة بنت رقيقة - وكانت أخت خديجة خالة فاطمة ، من فيها إلى في ، فذكره .\nوقال الإمام أحمد : حدثنا يعقوب حدثنا أبي ، عن ابن إسحاق ، حدثني سليط بن أيوب بن الحكم بن سليم ، عن أمه سلمى بنت قيس - وكانت إحدى خالات رسول الله - صلى الله عليه وسلم - قد صلت معه القبلتين ، وكانت إحدى نساء بني عدي بن النجار - قالت : جئت رسول الله - صلى الله عليه وسلم - نبايعه في نسوة من الأنصار ، فلما شرط علينا : ألا نشرك بالله شيئا ، ولا نسرق ، ولا نزني ، ولا نقتل أولادنا ، ولا نأتي ببهتان نفتريه بين أيدينا وأرجلنا ، ولا نعصيه في معروف - قال :  . قالت : فبايعناه ، ثم انصرفنا ، فقلت لامرأة منهن : ارجعي فسلي رسول الله - صلى الله عليه وسلم - : ما غش أزواجنا ؟ قال : فسألته فقال : \nوقال الإمام أحمد : حدثنا إبراهيم بن أبي العباس ، حدثنا عبد الرحمن بن عثمان بن إبراهيم بن محمد بن حاطب ، حدثني أبي ، عن أمه عائشة بنت قدامة - يعني : ابن مظعون - قالت : أنا مع أمي رائطة بنت سفيان الخزاعية ، والنبي - صلى الله عليه وسلم - يبايع النسوة ويقول :  . قالت : فأطرقن . فقال لهن النبي - صلى الله عليه وسلم - قلن : نعم فيما استطعتن \" . فكن يقلن وأقول معهن ، وأمي تلقني : قولي أي بنية ، نعم فيما استطعت . فكنت أقول كما يقلن\nوقال البخاري : حدثنا أبو معمر ، حدثنا عبد الوارث ، حدثنا أيوب ، عن حفصة بنت سيرين ، عن أم عطية قالت : بايعنا رسول الله - صلى الله عليه وسلم - فقرأ علينا : ( أن لا يشركن بالله شيئا ) ونهانا عن النياحة ، فقبضت امرأة يدها ، قالت : أسعدتني فلانة أريد أن أجزيها . فما قال لها رسول الله - صلى الله عليه وسلم - شيئا ، فانطلقت ورجعت فبايعها .\nورواه مسلم . وفي رواية : \nوللبخاري عن أم عطية قالت : أخذ علينا رسول الله - صلى الله عليه وسلم - عند البيعة ألا ننوح ، فما وفت منا امرأة غير خمس نسوة : أم سليم ، وأم العلاء ، وابنة أبي سبرة امرأة معاذ ، وامرأتان - أو : ابنة أبي سبرة ، وامرأة معاذ ، وامرأة أخرى .\nوقد كان رسول الله - صلى الله عليه وسلم - يتعاهد النساء بهذه البيعة يوم العيد ، كما قال البخاري :\nحدثنا محمد بن عبد الرحيم ، حدثنا هارون بن معروف ، حدثنا عبد الله بن وهب ، أخبرني ابن جريج : أن الحسن بن مسلم أخبره ، عن طاوس ، عن ابن عباس قال : شهدت الصلاة يوم الفطر مع رسول الله - صلى الله عليه وسلم - ، وأبي بكر ، وعمر ، وعثمان فكلهم يصليها قبل الخطبة ثم يخطب بعد ، فنزل نبي الله - صلى الله عليه وسلم - فكأني أنظر إليه حين يجلس الرجال بيده ، ثم أقبل يشقهم حتى أتى النساء مع بلال فقال : ( ياأيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ) حتى فرغ من الآية كلها . ثم قال حين فرغ :  . فقالت امرأة واحدة ، ولم يجبه غيرها : نعم يا رسول الله - لا يدري الحسن من هي - قال :  ، قال : وبسط بلال ثوبه فجعلن يلقين الفتخ والخواتيم في ثوب بلال .\nوقال الإمام أحمد : حدثنا خلف بن الوليد ، حدثنا ابن عياش ، عن سليمان بن سليم ، عن عمرو بن شعيب ، عن أبيه ، عن جده قال : جاءت أميمة بنت رقيقة إلى رسول الله - صلى الله عليه وسلم - تبايعه على الإسلام ، فقال : \nوقال الإمام أحمد : حدثنا سفيان ، عن الزهري ، عن أبي إدريس الخولاني ، عن عبادة بن الصامت قال : كنا عند رسول الله - صلى الله عليه وسلم - في مجلس فقال : ( إذا جاءك المؤمنات ) فمن وفى منكم فأجره على الله ، ومن أصاب من ذلك شيئا فعوقب به ، فهو كفارة له ، ومن أصاب من ذلك شيئا فستره الله عليه ، فهو إلى الله ، إن شاء غفر له ، وإن شاء عذبه \" . أخرجاه في الصحيحين .\nوقال محمد بن إسحاق ، عن يزيد بن أبي حبيب ، عن مرثد بن عبد الله اليزني عن أبي عبد الله عبد الرحمن بن عسيلة الصنابحي ، عن عبادة بن الصامت قال : كنت فيمن حضر العقبة الأولى ، وكنا اثني عشر رجلا فبايعنا رسول الله - صلى الله عليه وسلم - على بيعة النساء ، وذلك قبل أن يفرض الحرب ، على ألا نشرك بالله شيئا ، ولا نسرق ، ولا نزني ، ولا نقتل أولادنا ، ولا نأتي ببهتان نفتريه بين أيدينا وأرجلنا ، ولا نعصيه في معروف ، وقال :  رواه ابن أبي حاتم .\nوقد روى ابن جرير من طريق العوفي ، عن ابن عباس : أن رسول الله - صلى الله عليه وسلم - أمر عمر بن الخطاب فقال :  - وكانت هند بنت عتبة بن ربيعة التي شقت بطن حمزة منكرة في النساء - فقالت :  . وإنما تنكرت فرقا من رسول الله - صلى الله عليه وسلم - فسكت النسوة اللاتي مع هند ، وأبين أن يتكلمن . فقالت هند وهي منكرة : كيف تقبل من النساء شيئا لم تقبله من الرجال ؟ ففطن إليها رسول الله وقال لعمر :  . قالت هند : والله إني لأصيب من أبي سفيان الهنات ، ما أدري أيحلهن لي أم لا ؟ قال أبو سفيان : ما أصبت من شيء مضى أو قد بقي ، فهو لك حلال . فضحك رسول الله - صلى الله عليه وسلم - وعرفها ، فدعاها فأخذت بيده ، فعاذت به ، فقال :  . قالت : عفا الله عما سلف . فصرف عنها رسول الله - صلى الله عليه وسلم - فقال :  ، فقالت : يا رسول الله ، وهل تزني الحرة ؟ قال :  . فقال :  . قالت هند : أنت قتلتهم يوم بدر ، فأنت وهم أبصر . قال : ( ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن )( ولا يعصينك في معروف ) قال : منعهن أن ينحن ، وكان أهل الجاهلية يمزقن الثياب ويخدشن الوجوه ، ويقطعن الشعور ، ويدعون بالثبور . والثبور : الويل .\nوهذا أثر غريب ، وفي بعضه نكارة ، والله أعلم ; فإن أبا سفيان وامرأته لما أسلما لم يكن رسول الله - صلى الله عليه وسلم - يخيفهما ، بل أظهر الصفاء والود له ، وكذلك كان الأمر من جانبه ، عليه السلام ، لهما .\nوقال مقاتل بن حيان : أنزلت هذه الآية يوم الفتح ، فبايع رسول الله - صلى الله عليه وسلم - الرجال على الصفا ، وعمر يبايع النساء تحتها عن رسول الله - صلى الله عليه وسلم - فذكر بقيته كما تقدم وزاد : فلما قال : ( ولا يقتلن أولادهن ) قالت هند : ربيناهم صغارا فقتلتموهم كبارا . فضحك عمر بن الخطاب حتى استلقى . رواه ابن أبي حاتم .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا نصر بن علي ، حدثتني غبطة بنت سليمان ، حدثتني عمتي ، عن جدتها ، عن عائشة قالت : جاءت هند بنت عتبة إلى رسول الله - صلى الله عليه وسلم - لتبايعه ، فنظر إلى يدها فقال :  . فذهبت فغيرتها بحناء ، ثم جاءت فقال :  ، فبايعها وفي يدها سواران من ذهب ، فقالت : ما تقول في هذين السوارين ؟ فقال : ( يا أيها النبي إذا جاءك المؤمنات يبايعنك ) أي : من جاءك منهن يبايع على هذه الشروط فبايعها ، ( على أن لا يشركن بالله شيئا ولا يسرقن ) أي : أموال الناس الأجانب ، فأما إذا كان الزوج مقصرا في نفقتها ، فلها أن تأكل من ماله بالمعروف ، ما جرت به عادة أمثالها ، وإن كان بغير علمه ، عملا بحديث هند بنت عتبة أنها قالت : يا رسول الله ، إن أبا سفيان رجل شحيح لا يعطيني من النفقة ما يكفيني ويكفي بني ، فهل علي جناح إن أخذت من ماله بغير علمه ؟ فقال رسول الله - صلى الله عليه وسلم - :  . أخرجاه في الصحيحين .( ولا يزنين )( ولاتقربوا الزنا إنه كان فاحشة وساء سبيلا )[ الإسراء : 32 ] . وفي حديث سمرة ذكر عقوبة الزناة بالعذاب الأليم في نار الجحيم .\nوقال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن الزهري ، عن عروة ، عن عائشة قالت : جاءت فاطمة بنت عتبة تبايع رسول الله - صلى الله عليه وسلم - فأخذ عليها : ( أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ) الآية ، قالت : فوضعت يدها على رأسها حياء ، فأعجبه ما رأى منها ، فقالت عائشة : أقري أيتها المرأة ، فوالله ما بايعنا إلا على هذا . قالت : فنعم إذا . فبايعها بالآية .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا ابن فضيل ، عن حصين ، عن عامر - هو الشعبي - قال : بايع رسول الله - صلى الله عليه وسلم - النساء ، وعلى يده ثوب قد وضعه على كفه ، ثم قال :  . فقالت امرأة : تقتل آباءهم وتوصينا بأولادهم ؟ قال : وكان بعد ذلك إذا جاءت النساء يبايعنه ، جمعهن فعرض عليهن ، فإذا أقررن رجعن .( ولا يقتلن أولادهن ) وهذا يشمل قتله بعد وجوده ، كما كان أهل الجاهلية يقتلون أولادهم خشية الإملاق ، ويعم قتله وهو جنين ، كما قد يفعله بعض الجهلة من النساء ، تطرح نفسها لئلا تحبل إما لغرض فاسد ، أو ما أشبهه .( ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ) قال ابن عباس : يعني لا يلحقن بأزواجهن غير أولادهم . وكذا قال مقاتل . ويؤيد هذا الحديث الذي رواه أبو داود :\nحدثنا أحمد بن صالح ، حدثنا ابن وهب ، حدثنا عمرو - يعني : ابن الحارث ، - عن ابن الهاد ، عن عبد الله بن يونس ، عن سعيد المقبري ، عن أبي هريرة أنه سمع رسول الله - صلى الله عليه وسلم - يقول حين نزلت آية الملاعنة : ( ولا يعصينك في معروف ) يعني : فيما أمرتهن به من معروف ، ونهيتهن عنه من منكر .\nقال البخاري : حدثنا عبد الله بن محمد ، حدثنا وهب بن جرير ، حدثنا أبي قال : سمعت الزبير ، عن عكرمة ، عن ابن عباس في قوله : ( ولا يعصينك في معروف ) قال : إنما هو شرط شرطه الله للنساء .\nوقال ميمون بن مهران : لم يجعل الله لنبيه طاعة إلا لمعروف ، والمعروف : طاعة .\nوقال ابن زيد : أمر الله بطاعة رسوله ، وهو خيرة الله من خلقه في المعروف . وقد قال غيره عن ابن عباس ، وأنس بن مالك ، وسالم بن أبي الجعد ، وأبي صالح ، وغير واحد : نهاهن يومئذ عن النوح . وقد تقدم حديث أم عطية في ذلك أيضا .\nوقال ابن جرير : حدثنا بشر ، حدثنا يزيد ، حدثنا سعيد ، عن قتادة في هذه الآية : ذكر لنا أن نبي الله - صلى الله عليه وسلم - أخذ عليهن النياحة ، ولا تحدثن الرجال إلا رجلا منكن محرما . فقال عبد الرحمن بن عوف : يا نبي الله ، إن لنا أضيافا ، وإنا نغيب عن نسائنا . فقال رسول الله - صلى الله عليه وسلم - : \nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا إبراهيم بن موسى الفراء ، أخبرنا ابن أبي زائدة ، حدثني مبارك ، عن الحسن قال : كان فيما أخذ النبي - صلى الله عليه وسلم - : \nوقال ابن جرير : حدثنا ابن حميد ، حدثنا هارون ، عن عمرو ، عن عاصم ، عن ابن سيرين ، عن أم عطية الأنصارية قالت : كان فيما اشترط علينا من المعروف حين بايعنا ألا ننوح ، فقالت امرأة من بني فلان : إن بني فلان أسعدوني ، فلا حتى أجزيهم ، فانطلقت ، فأسعدتهم ، ثم جاءت فبايعت ، قالت : فما وفى منهن غيرها ، وغير أم سليم ابنة ملحان أم أنس بن مالك .\nوقد روى البخاري هذا الحديث من طريق حفصة بنت سيرين ، عن أم عطية نسيبة الأنصارية رضي الله عنها وقد روي نحوه من وجه آخر أيضا .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا أبو نعيم ، حدثنا عمر بن فروخ القتات ، حدثني مصعب بن نوح الأنصاري قال : أدركت عجوزا لنا كانت فيمن بايع رسول الله - صلى الله عليه وسلم - . قالت : فأتيته لأبايعه ، فأخذ علينا فيما أخذ ألا تنحن . فقالت عجوز : يا رسول الله ، إن ناسا قد كانوا أسعدوني على مصائب أصابتني ، وأنهم قد أصابتهم مصيبة ، فأنا أريد أسعدهم . قال :  . فانطلقت فكافأتهم ، ثم إنها أتته فبايعته ، وقال : هو المعروف الذي قال الله عز وجل : ( ولا يعصينك في معروف )\nوقال ابن أبي حاتم : حدثنا أحمد بن منصور الرمادي ، حدثنا القعنبي ، حدثنا الحجاج بن صفوان ، عن أسيد بن أبي أسيد البراد ، عن امرأة من المبايعات قالت : كان فيما أخذ علينا رسول الله - صلى الله عليه وسلم - : أن لا نعصيه في معروف : أن لا نخمش وجوها ، ولا ننشر شعرا ، ولا نشق جيبا ، ولا ندعو ويلا .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا وكيع ، عن يزيد مولى الصهباء ، عن شهر بن حوشب ، عن أم سلمة ، عن رسول الله - صلى الله عليه وسلم - في قوله : ( ولا يعصينك في معروف )\nورواه الترمذي في التفسير ، عن عبد بن حميد ، عن أبي نعيم ، وابن ماجه ، عن أبي بكر بن أبي شيبة ، عن وكيع - كلاهما عن يزيد بن عبد الله الشيباني مولى الصهباء به . ، وقال الترمذي : حسن غريب .\nوقال ابن جرير : حدثنا محمد بن سنان القزاز ، حدثنا إسحاق بن إدريس ، حدثنا إسحاق بن عثمان أبو يعقوب ، حدثني إسماعيل بن عبد الرحمن بن عطية ، عن جدته أم عطية قالت : لما قدم رسول الله - صلى الله عليه وسلم - جمع نساء الأنصار في بيت ، ثم أرسل إلينا عمر بن الخطاب ، رضي الله عنه ، فقام على الباب وسلم علينا ، فرددن - أو : فرددنا - عليه السلام ، ثم قال :  . قالت : فقلنا : مرحبا برسول الله وبرسول رسول الله . فقال :  قالت : فقلنا : نعم . قالت : فمد يده من خارج الباب - أو : البيت - ومددنا أيدينا من داخل البيت ، ثم قال :  . قالت : وأمرنا في العيدين أن نخرج فيه الحيض ، والعواتق ، ولا جمعة علينا ، ونهانا عن اتباع الجنائز . قال إسماعيل : فسألت جدتي عن قوله : ( ولا يعصينك في معروف ) قالت : النياحة .\nوفي الصحيحين من طريق الأعمش ، عن عبد الله بن مرة ، عن مسروق ، عن عبد الله بن مسعود قال : قال رسول الله - صلى الله عليه وسلم - : \nوفي الصحيحين أيضا عن أبي موسى : أن رسول الله - صلى الله عليه وسلم - برئ من الصالقة ، والحالقة ، والشاقة .\nوقال الحافظ أبو يعلى : حدثنا هدبة بن خالد ، حدثنا أبان بن يزيد ، حدثنا يحيى بن أبي كثير : أن زيدا حدثه : أن أبا سلام حدثه : أن أبا مالك الأشعري حدثه : أن رسول الله - صلى الله عليه وسلم - قال : \nورواه مسلم في صحيحه منفردا به ، من حديث أبان بن يزيد العطار به . .\nوعن أبي سعيد : أن رسول الله - صلى الله عليه وسلم - لعن النائحة والمستمعة . رواه أبو داود"
  }, {
    "id" : 13,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الْآخِرَةِ كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ (13) ",
    "tafsir" : " كما نهى عنها في أولها فقال : ( يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم ) يعني : اليهود والنصارى وسائر الكفار ، ممن غضب الله عليه ولعنه واستحق من الله الطرد والإبعاد ، فكيف توالونهم وتتخذونهم أصدقاء وأخلاء وقد يئسوا من الآخرة ، أي : من ثواب الآخرة ونعيمها في حكم الله عز وجل . وقوله : ( كما يئس الكفار من أصحاب القبور ) فيه قولان ، أحدهما : كما يئس الكفار الأحياء من قراباتهم الذين في القبور أن يجتمعوا بهم بعد ذلك ; لأنهم لا يعتقدون بعثا ولا نشورا ، فقد انقطع رجاؤهم منهم فيما يعتقدونه .\nقال العوفي ، عن ابن عباس : ( يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم ) إلى آخر السورة ، يعني من مات من الذين كفروا فقد يئس الأحياء من الذين كفروا أن يرجعوا إليهم أو يبعثهم الله عز وجل .\nوقال الحسن البصري : ( كما يئس الكفار من أصحاب القبور ) قال : الكفار الأحياء قد يئسوا من الأموات .\nوقال قتادة : كما يئس الكفار أن يرجع إليهم أصحاب القبور الذين ماتوا . وكذا قال الضحاك . رواهن ابن جرير .\nوالقول الثاني : معناه : كما يئس الكفار الذين هم في القبور من كل خير .\nقال الأعمش ، عن أبي الضحى ، عن مسروق ، عن ابن مسعود : ( كما يئس الكفار من أصحاب القبور ) قال : كما يئس هذا الكافر إذا مات وعاين ثوابه واطلع عليه . وهذا قول مجاهد ، وعكرمة ، ومقاتل ، وابن زيد ، والكلبي ، ومنصور . وهو اختيار ابن جرير .\nآخر تفسير سورة الممتحنة ولله الحمد والمنة."
  } ]
}