{
  "id" : 61,
  "name" : "الصَّف",
  "type" : "مدنيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1) ",
    "tafsir" : "\nقال الإمام أحمد رحمه الله : حدثنا يحيى بن آدم ، حدثنا ابن المبارك ، عن الأوزاعي ، عن يحيى بن أبي كثير ، عن أبي سلمة - وعن عطاء بن يسار ، عن أبي سلمة ، عن عبد الله بن سلام قال : تذاكرنا : أيكم يأتي رسول الله - صلى الله عليه وسلم - فيسأله : أي الأعمال أحب إلى الله ؟ فلم يقم أحد منا ، فأرسل رسول الله - صلى الله عليه وسلم - إلينا رجلا فجمعنا فقرأ علينا هذه السورة ، يعني سورة الصف كلها . هكذا رواه الإمام أحمد\nوقال ابن أبي حاتم : حدثنا العباس بن الوليد بن مزيد البيروتي ، قراءة ، قال : أخبرني أبي ، سمعت الأوزاعي ، حدثني يحيى بن أبي كثير ، حدثني أبو سلمة بن عبد الرحمن ، حدثني عبد الله بن سلام . أن أناسا من أصحاب رسول الله - صلى الله عليه وسلم - قالوا : لو أرسلنا إلى رسول الله نسأله عن أحب الأعمال إلى الله عز وجل ؟ فلم يذهب إليه أحد منا ، وهبنا أن نسأله عن ذلك ، قال : فدعا رسول الله - صلى الله عليه وسلم - أولئك النفر رجلا رجلا حتى جمعهم ، ونزلت فيهم هذه السورة : ( سبح ) الصف قال عبد الله بن سلام : فقرأها علينا رسول الله - صلى الله عليه وسلم - كلها . قال أبو سلمة : وقرأها علينا عبد الله بن سلام كلها ، قال يحيى بن أبي كثير : وقرأها علينا أبو سلمة كلها . قال الأوزاعي : وقرأها علينا يحيى بن أبي كثير كلها . قال أبي : وقرأها علينا الأوزاعي كلها .\nوقد رواه الترمذي ، عن عبد الله بن عبد الرحمن الدارمي : حدثنا محمد بن كثير ، عن الأوزاعي ، عن يحيى بن أبي كثير ، عن أبي سلمة ، عن عبد الله بن سلام قال : قعدنا نفرا من أصحاب رسول الله - صلى الله عليه وسلم - فتذاكرنا ، فقلنا : لو نعلم : أي الأعمال أحب إلى الله عز وجل لعملناه . فأنزل الله :  قال عبد الله بن سلام : فقرأها علينا رسول الله - صلى الله عليه وسلم - . قال أبو سلمة : فقرأها علينا ابن سلام . قال يحيى : فقرأها علينا أبو سلمة . قال ابن كثير : فقرأها علينا الأوزاعي . قال عبد الله : فقرأها علينا ابن كثير .\nثم قال الترمذي : وقد خولف محمد بن كثير في إسناد هذا الحديث عن الأوزاعي ، فروى ابن المبارك ، عن الأوزاعي ، عن يحيى بن أبي كثير ، عن هلال بن أبي ميمونة ، عن عطاء بن يسار ، عن عبد الله بن سلام - أو : عن أبي سلمة ، عن عبد الله بن سلام\nقلت : وهكذا رواه الإمام أحمد ، عن يعمر ، عن ابن المبارك به .\nقال الترمذي : وروى الوليد بن مسلم هذا الحديث عن الأوزاعي نحو رواية محمد بن كثير .\nقلت : وكذا رواه الوليد بن يزيد ، عن الأوزاعي كما رواه ابن كثير .\nقلت : وقد أخبرني بهذا الحديث الشيخ المسند أبو العباس أحمد بن أبي طالب الحجار قراءة عليه وأنا أسمع ، أخبرنا أبو المنجا عبد الله بن عمر بن اللتي ، أخبرنا أبو الوقت عبد الأول بن عيسى بن شعيب السجزي قال : أخبرنا أبو الحسن بن عبد الرحمن بن المظفر بن محمد بن داود الداودي ، أخبرنا أبو محمد عبد الله بن أحمد بن حمويه السرخسي ، أخبرنا عيسى بن عمر بن عمران السمرقندي ، أخبرنا الإمام الحافظ أبو محمد عبد الله بن عبد الرحمن الدارمي بجميع مسنده ، أخبرنا محمد بن كثير ، عن الأوزاعي . . . فذكر بإسناده مثله ، وتسلسل لنا قراءتها إلى شيخنا أبي العباس الحجار ، ولم يقرأها ، لأنه كان أميا ، وضاق الوقت عن تلقينها إياه . ولكن أخبرني الحافظ الكبير أبو عبد الله محمد بن أحمد بن عثمان الذهبي ، رحمه الله : أخبرنا القاضي تقي الدين سليمان بن الشيخ أبي عمر ، أخبرنا أبو المنجا بن اللتي فذكره بإسناده ، وتسلل لي من طريقة ، وقرأها علي بكمالها ، ولله الحمد والمنة .\nتقدم الكلام على قوله : ( سبح لله ما في السماوات وما في الأرض وهو العزيز الحكيم ) غير مرة ، بما أغنى عن إعادته ."
  }, {
    "id" : 2,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ (2) ",
    "tafsir" : "( يا أيها الذين آمنوا لم تقولون ما لا تفعلون ) ؟ إنكار على من يعد عدة ، أو يقول قولا لا يفي به ، ولهذا استدل بهذه الآية الكريمة من ذهب من علماء السلف إلى أنه يجب الوفاء بالوعد مطلقا ، سواء ترتب عليه غرم للموعود أم لا . واحتجوا أيضا من السنة بما ثبت في الصحيحين أن رسول الله - صلى الله عليه وسلم - قال :  وفي الحديث الآخر في الصحيح :  - فذكر منهن إخلاف الوعد . وقد استقصينا الكلام على هذين الحديثين في أول  ، ولله الحمد والمنة ."
  }, {
    "id" : 3,
    "eya" : "كَبُرَ مَقْتًا عِندَ اللَّهِ أَن تَقُولُوا مَا لَا تَفْعَلُونَ (3) ",
    "tafsir" : "( كبر مقتا عند الله أن تقولوا ما لا تفعلون )\nوقد روى الإمام أحمد ، وأبو داود ، عن عبد الله بن عامر بن ربيعة قال : أتانا رسول الله - صلى الله عليه وسلم - في بيتنا وأنا صبي قال : فذهبت لأخرج لألعب ، فقالت أمي : يا عبد الله : تعال أعطك . فقال لها رسول الله - صلى الله عليه وسلم - :  . قالت : تمرا . فقال : \nوذهب الإمام مالك ، رحمه الله ، إلى أنه إذا تعلق بالوعد غرم على الموعود وجب الوفاء به ، كما لو قال لغيره :  . فتزوج ، وجب عليه أن يعطيه ما دام كذلك ، لأنه تعلق به حق آدمي ، وهو مبني على المضايقة . وذهب الجمهور إلى أنه لا يجب مطلقا ، وحملوا الآية على أنها نزلت حين تمنوا فرضية الجهاد عليهم ، فلما فرض نكل عنه بعضهم ، كقوله تعالى : ( ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة )[ النساء : 77 ، 78 ] . وقال تعالى : ( ويقول الذين آمنوا لولا نزلت سورة فإذا أنزلت سورة محكمة وذكر فيها القتال رأيت الذين في قلوبهم مرض ينظرون إليك نظر المغشي عليه من الموت )[ محمد : 20 ] وهكذا هذه الآية معناها ، كما قال علي بن أبي طلحة ، عن ابن عباس في قوله : ( يا أيها الذين آمنوا لم تقولون ما لا تفعلون ) قال : كان ناس من المؤمنين قبل أن يفرض الجهاد يقولون : لوددنا أن الله - عز وجل - دلنا على أحب الأعمال إليه ، فنعمل به . فأخبر الله نبيه أن أحب الأعمال إيمان به لا شك فيه ، وجهاد أهل معصيته الذين خالفوا الإيمان ولم يقروا به . فلما نزل الجهاد كره ذلك أناس من المؤمنين ، وشق عليهم أمره ، فقال الله سبحانه : ( يا أيها الذين آمنوا لم تقولون ما لا تفعلون ) ؟ . وهذا اختيار ابن جرير .\nوقال مقاتل بن حيان : قال المؤمنون : لو نعلم أحب الأعمال إلى الله لعملنا به . فدلهم الله على أحب الأعمال إليه ، فقال : ( إن الله يحب الذين يقاتلون في سبيله صفا ) فبين لهم ، فابتلوا يوم أحد بذلك ، فولوا عن النبي - صلى الله عليه وسلم - مدبرين ، فأنزل الله في ذلك : ( يا أيها الذين آمنوا لم تقولون ما لا تفعلون ) ؟ وقال : أحبكم إلي من قاتل في سبيلي .\nومنهم من يقول : أنزلت في شأن القتال ، يقول الرجل :  ، ولم يقاتل وطعنت  صبرت \" ، ولم يصبر .\nوقال قتادة ، والضحاك : نزلت توبيخا لقوم كانوا يقولون :  . ولم يكونوا فعلوا ذلك .\nوقال ابن يزيد : نزلت في قوم من المنافقين ، كانوا يعدون المسلمين النصر ، ولا يفون لهم بذلك .\nوقال مالك عن زيد بن أسلم : ( لم تقولون ما لا تفعلون ) ؟ ، قال : في الجهاد .\nوقال ابن أبي نجيح ، عن مجاهد : ( لم تقولون ما لا تفعلون ) إلى قوله : ( كأنهم بنيان مرصوص ) فما بين ذلك : في نفر من الأنصار ، فيهم عبد الله بن رواحة ، قالوا في مجلس : لو نعلم أي الأعمال أحب إلى الله ، لعملنا بها حتى نموت . فأنزل الله هذا فيهم . فقال عبد الله بن رواحة : لا أبرح حبيسا في سبيل الله حتى أموت . فقتل شهيدا .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا فروة بن أبي المغراء ، حدثنا علي بن مسهر ، عن داود بن أبي هند ، عن أبي حرب بن أبي الأسود الديلي ، عن أبيه قال : بعث أبو موسى إلى قراء أهل البصرة فدخل عليه منهم ثلاثمائة رجل ، كلهم قد قرأ القرآن ، فقال . أنتم قراء أهل البصرة وخيارهم . وقال : كنا نقرأ سورة كنا نشبهها بإحدى المسبحات ، فأنسيناها ، غير أني قد حفظت منها : ( يا أيها الذين آمنوا لم تقولون ما لا تفعلون ) فتكتب شهادة في أعناقكم ، فتسألون عنها يوم القيامة ."
  }, {
    "id" : 4,
    "eya" : "إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ (4) ",
    "tafsir" : "( إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص ) فهذا إخبار منه تعالى بمحبة عباده المؤمنين إذا اصطفوا مواجهين لأعداء الله في حومة الوغى ، يقاتلون في سبيل الله من كفر بالله ، لتكون كلمة الله هي العليا ، ودينه هو الظاهر العالي على سائر الأديان .\nوقال الإمام أحمد : حدثنا علي بن عبد الله ، حدثنا هشيم قال مجالد ، أخبرنا عن أبي الوداك ، عن أبي سعيد الخدري ، رضي الله عنه قال : قال رسول الله - صلى الله عليه وسلم - : \nورواه ابن ماجه من حديث مجالد عن أبي الوداك جبر بن نوف به .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أبو نعيم الفضل بن دكين ، حدثنا الأسود - يعني ابن شيبان - حدثني يزيد بن عبد الله بن الشخير قال : قال مطرف : كان يبلغني عن أبي ذر حديث كنت أشتهي لقاءه ، فلقيته فقلت : يا أبا ذر ، كان يبلغني عنك حديث ، فكنت أشتهي لقاءك ، فقال : لله أبوك ! فقد لقيت ، فهات . فقلت : كان يبلغني عنك أنك تزعم أن رسول الله - صلى الله عليه وسلم - حدثكم أن الله يحب ثلاثة ويبغض ثلاثة ؟ قال : أجل ، فلا إخالني أكذب على خليلي - صلى الله عليه وسلم - . قلت : فمن هؤلاء الثلاثة الذين يحبهم الله ؟ قال : رجل غزا في سبيل الله ، خرج محتسبا مجاهدا فلقي العدو فقتل ، وأنتم تجدونه في كتاب الله المنزل ، ثم قرأ ( إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص ) وذكر الحديث .\nهكذا أورد هذا الحديث من هذا الوجه بهذا السياق ، وبهذا اللفظ ، واختصره . وقد أخرجه الترمذي ، والنسائي من حديث شعبة ، عن منصور بن المعتمر ، عن ربعي بن حراش ، عن زيد بن ظبيان ، عن أبي ذر بأبسط من هذا السياق وأتم ، وقد أوردناه في موضع آخر ، ولله الحمد .\nوعن كعب الأحبار أنه قال : يقول الله تعالى لمحمد - صلى الله عليه وسلم - :  . ثم قرأ : ( إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص ) رعاة الشمس ، يصلون الصلاة حيث أدركتهم ، ولو على ظهر دابة \" رواه ابن أبي حاتم .\nوقال سعيد بن جبير في قوله ( إن الله يحب الذين يقاتلون في سبيله صفا ) قال : كان رسول الله - صلى الله عليه وسلم - لا يقاتل العدو إلا أن يصافهم ، وهذا تعليم من الله للمؤمنين . قال : وقوله : ( كأنهم بنيان مرصوص ) ملتصق بعضه في بعض ، من الصف في القتال .\nوقال مقاتل بن حيان و : ملتصق بعضه إلى بعض .\nوقال ابن عباس : ( كأنهم بنيان مرصوص ) مثبت ، لا يزول ، ملصق بعضه ببعض .\nوقال قتادة : ( كأنهم بنيان مرصوص ) ألم تر إلى صاحب البنيان ، كيف لا يحب أن يختلف بنيانه ؟ فكذلك الله عز وجل يحب أن لا يختلف أمره ، وإن الله صف المؤمنين في قتالهم وصفهم في صلاتهم ، فعليكم بأمر الله ، فإنه عصمة لمن أخذ به . أورد ذلك كله ابن أبي حاتم .\nوقال ابن جرير : حدثني سعيد بن عمرو السكوني ، حدثنا بقية بن الوليد ، عن أبي بكر بن أبي مريم ، عن يحيى بن جابر الطائي ، عن أبي بحرية قال : كانوا يكرهون القتال على الخيل ، ويستحبون القتال على الأرض ، لقول الله عز وجل : ( إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص ) قال : وكان أبو بحرية يقول : إذا رأيتموني التفت في الصف فجثوا في لحيي"
  }, {
    "id" : 5,
    "eya" : "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ (5) ",
    "tafsir" : "( لم تؤذونني وقد تعلمون أني رسول الله إليكم ) أي : لم توصلون الأذى إلي وأنتم تعلمون صدقي فيما جئتكم به من الرسالة ؟ . وفي هذا تسلية لرسول الله - صلى الله عليه وسلم - فيما أصاب من الكفار من قومه وغيرهم ، وأمر له بالصبر ; ولهذا قال :  وفيه نهي للمؤمنين أن ينالوا من النبي - صلى الله عليه وسلم - أو يوصلوا إليه أذى ، كما قال تعالى : ( يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها )[ الأحزاب : 69 ]( فلما زاغوا أزاغ الله قلوبهم ) أي : فلما عدلوا عن اتباع الحق مع علمهم به ، أزاغ الله قلوبهم عن الهدى ، وأسكنها الشك والحيرة والخذلان ، كما قال تعالى : ( ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون )[ الأنعام : 110 ]( ومن يشاقق الرسول من بعد ما تبين له الهدى ويتبع غير سبيل المؤمنين نوله ما تولى ونصله جهنم وساءت مصيرا )[ النساء : 115 ] ولهذا قال الله تعالى في هذه الآية : ( والله لا يهدي القوم الفاسقين )"
  }, {
    "id" : 6,
    "eya" : "وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُم مُّصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِن بَعْدِي اسْمُهُ أَحْمَدُ ۖ فَلَمَّا جَاءَهُم بِالْبَيِّنَاتِ قَالُوا هَٰذَا سِحْرٌ مُّبِينٌ (6) ",
    "tafsir" : "( وإذ قال عيسى ابن مريم يابني إسرائيل إني رسول الله إليكم مصدقا لما بين يدي من التوراة ومبشرا برسول يأتي من بعدي اسمه أحمد ) يعني : التوراة قد بشرت بي ، وأنا مصداق ما أخبرت عنه ، وأنا مبشر بمن بعدي ، وهو الرسول النبي الأمي العربي المكي أحمد . فعيسى عليه السلام ، وهو خاتم أنبياء بني إسرائيل ، وقد أقام في ملإ بني إسرائيل مبشرا بمحمد وهو أحمد خاتم الأنبياء والمرسلين ، الذي لا رسالة بعده ولا نبوة . وما أحسن ما أورد البخاري الحديث الذي قال فيه :\nحدثنا أبو اليمان ، حدثنا شعيب عن الزهري قال : أخبرني محمد بن جبير بن مطعم ، عن أبيه قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \nورواه مسلم من حديث الزهري به نحوه\nوقال أبو داود الطيالسي : حدثنا المسعودي ، عن عمرو بن مرة ، عن أبي عبيدة ، عن أبي موسى قال : سمى لنا رسول الله - صلى الله عليه وسلم - نفسه أسماء ، منها ما حفظنا فقالو : \nورواه مسلم من حديث الأعمش عن عمرو بن مرة به\nوقد قال الله تعالى : ( الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل )[ الأعراف : 157 ] وقال تعالى : ( وإذ أخذ الله ميثاق النبيين لما آتيتكم من كتاب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه قال أأقررتم وأخذتم على ذلكم إصري قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين )[ آل عمران : 81 ]\nقال ابن عباس : ما بعث الله نبيا إلا أخذ عليه العهد : لئن بعث محمد وهو حي ليتبعنه ، وأخذ عليه أن يأخذ على أمته لئن بعث محمد وهم أحياء ليتبعنه وينصرنه .\nوقال محمد بن إسحاق : حدثني ثور بن يزيد ، عن خالد بن معدان ، عن أصحاب رسول الله - صلى الله عليه وسلم - أنهم قالوا : يا رسول الله ، أخبرنا عن نفسك . قال : \nوهذا إسناد جيد . وروي له شواهد من وجوه أخر ، فقال الإمام أحمد :\nحدثنا عبد الرحمن بن مهدي ، حدثنا معاوية بن صالح ، عن سعيد بن سويد الكلبي ، عن عبد الأعلى بن هلال السلمي ، عن العرباض بن سارية قال : قال رسول الله - صلى الله عليه وسلم - : \nوقال أحمد أيضا : حدثنا أبو النضر ، حدثنا الفرج بن فضالة ، حدثنا لقمان بن عامر قال : سمعت أبا أمامة قال : قلت يا نبي الله ، ما كان بدء أمرك ؟ قال : \nوقال أحمد أيضا : حدثنا حسن بن موسى : سمعت خديجا أخا زهير بن معاوية ، عن أبي إسحاق عن عبد الله بن عتبة ، عن عبد الله بن مسعود قال : بعثنا رسول الله - صلى الله عليه وسلم - إلى النجاشي ونحن نحو من ثمانين رجلا منهم : عبد الله بن مسعود ، وجعفر ، وعبد الله بن عرفطة ، وعثمان بن مظعون ، وأبو موسى . فأتوا النجاشي وبعثت قريش عمرو بن العاص ، وعمارة بن الوليد بهدية ، فلما دخلا على النجاشي سجدا له ، ثم ابتدراه عن يمينه ، وعن شماله ، ثم قالا له : إن نفرا من بني عمنا نزلوا أرضك ، ورغبوا عنا ، وعن ملتنا . قال : فأين هم ؟ قالا : هم في أرضك ، فابعث إليهم . فبعث إليهم . فقال جعفر : أنا خطيبكم اليوم . فاتبعوه فسلم ولم يسجد ، فقالوا له : ما لك لا تسجد للملك ؟ قال : إنا لا نسجد إلا لله عز وجل . قال : وما ذاك ؟ قال : إن الله بعث إلينا رسوله ، فأمرنا ألا نسجد لأحد إلا لله عز وجل ، وأمرنا بالصلاة والزكاة .\nقال عمرو بن العاص : فإنهم يخالفونك في عيسى ابن مريم . قال : ما تقولون في عيسى ابن مريم وأمه ؟ قالوا : نقول كما قال الله عز وجل : هو كلمة الله وروحه ألقاها إلى العذراء البتول ، التي لم يمسها بشر ولم يفرضها ولد . قال : فرفع عودا من الأرض ثم قال : يا معشر الحبشة والقسيسين والرهبان ، والله ما يزيدون على الذي نقول فيه ، ما يساوي هذا . مرحبا بكم وبمن جئتم من عنده ، أشهد أنه رسول الله ، وأنه الذي نجد في الإنجيل ، وأنه الذي بشر به عيسى ابن مريم . انزلوا حيث شئتم ، والله لولا ما أنا فيه من الملك لأتيته حتى أكون أنا أحمل نعليه وأوضئه . وأمر بهدية الآخرين فردت إليهما ، ثم تعجل عبد الله بن مسعود حتى أدرك بدرا ، وزعم أن النبي - صلى الله عليه وسلم - استغفر له حين بلغه موته\nوقد رويت هذه القصة عن جعفر ، وأم سلمة رضي الله عنهما ، وموضع ذلك كتاب السيرة . والمقصد أن الأنبياء عليهم السلام لم تزل تنعته ، وتحكيه في كتبها على أممها ، وتأمرهم باتباعه ، ونصره ، وموازرته إذا بعث . وكان ما اشتهر الأمر في أهل الأرض على لسان إبراهيم الخليل والد الأنبياء بعده ، حين دعا لأهل مكة أن يبعث الله فيهم رسولا منهم ، وكذا على لسان عيسى ابن مريم ; ولهذا قالوا :  يعني : في الأرض ، قال :  أي : ظهر في أهل مكة أثر ذلك والإرهاص بذكره صلوات الله وسلامه عليه .( فلما جاءهم بالبينات قالوا هذا سحر مبين ) قال ابن جريج ، وابن جرير : ( فلما جاءهم ) أحمد ، أي : المبشر به في الأعصار المتقادمة ، المنوه بذكره في القرون السالفة ، لما ظهر أمره وجاء بالبينات قال الكفرة والمخالفون : ( هذا سحر مبين )"
  }, {
    "id" : 7,
    "eya" : "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَىٰ إِلَى الْإِسْلَامِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ (7) ",
    "tafsir" : "( ومن أظلم ممن افترى على الله الكذب وهو يدعى إلى الإسلام ) أي : لا أحد أظلم ممن يفتري الكذب على الله ويجعل له أندادا وشركاء ، وهو يدعى إلى التوحيد والإخلاص ; ولهذا قال : ( والله لا يهدي القوم الظالمين )"
  }, {
    "id" : 8,
    "eya" : "يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ (8) ",
    "tafsir" : "( يريدون ليطفئوا نور الله بأفواههم ) أي : يحاولون أن يردوا الحق بالباطل ، ومثلهم في ذلك كمثل من يريد أن يطفئ شعاع الشمس بفيه ، وكما أن هذا مستحيل كذلك ذاك مستحيل ; ولهذا قال : ( والله متم نوره ولو كره الكافرون )"
  }, {
    "id" : 9,
    "eya" : "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ (9) ",
    "tafsir" : " فالهدى هو ما جاء به من الإخبارات الصادقة والإيمان الصحيح والعلم النافع ودين الحق هو الأعمال الصالحة الصحيحة النافعة في الدنيا والآخرة  أي على سائر الأديان كما ثبت في الصحيح عن رسول الله صلى الله تعالى عليه وآله وسلم أنه قال \nوقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن محمد بن أبي يعقوب سمعت شقيق بن حيان يحدث عن مسعود بن قبيصة أوقبيصة بن مسعود يقول: صلى هذا الحي من محارب الصبح فلما صلوا قال شاب منهم: سمعت رسول الله صلى لله تعالى عليه وآله وسلم يقول \nوقال الإمام أحمد: حدثنا أبو المغيرة حدثنا صفوان حدثنا سليم بن عامر عن تميم الداري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول  فكان تميم الداري يقول: قد عرفت ذلك في أهل بيتي لقد أصاب من أسلم منهم الخير والشرف والعز ولقد أصاب من كان كافرا منهم الذل والصغار والجزية.\nوقال الإمام أحمد: حدثنا يزيد بن عبد ربه حدثنا الوليد بن مسلم حدثني ابن جابر سمعت سليم بن عامر قال: سمعت المقداد بن الأسود يقول: سمعت رسول الله صلى الله عليه وسلم يقول  وفي المسند أيضا حدثنا محمد بن أبي عدي عن ابن عون عن ابن سيرين عن أبي حذيفة عن عدي بن حاتم سمعه يقول: دخلت على رسول الله صلى الله عليه وسلم فقال  فقلت إنى من أهل دين قال  فقلت أنت أعلم بديني مني؟ قال  قلت بلى ! قال  قال فلم يعد أن قالها فتواضعت لها قال  قلت لم أرها وقد سمعت بها قال  قلت كسرى بن هرمز؟ قال  قال عدي: فهذه الظعينة تخرج من الحيرة فتطوف بالبيت من غير جوار أحد ولقد كنت فيمن فتح كنوز كسرى بن هرمز والذي نفسي بيده لتكونن الثالثة لأن رسول الله صلى الله عليه وسلم قد قالها.\nوقال مسلم: حدثنا أبو معن زيد بن يزيد الرقاشي حدثنا خالد بن الحارث حدثنا عبد الحميد بن جعفر عن الأسود بن العلاء عن أبي سلمة عن عائشة رضي الله عنهما  لا يذهب الليل والنهار حتى تعبد اللات والعزى  هو الذي أرسل رسوله بالهدى ودين الحق  إنه سيكون من ذلك ما شاء الله عزوجل ثم يبعث الله ريحا طيبة فيتوفى كل من كان في قلبه مثقال حبة خردل من إيمان فيبقى من لا خير فيه فيرجعون إلى دين آبائهم \"."
  }, {
    "id" : 10,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَىٰ تِجَارَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ (10) ",
    "tafsir" : "( يا أيها الذين آمنوا هل أدلكم على تجارة تنجيكم من عذاب أليم ) ثم فسر هذه التجارة العظيمة التي لا تبور ، والتي هي محصلة للمقصود ، ومزيلة للمحذور فقال"
  }, {
    "id" : 11,
    "eya" : "تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنفُسِكُمْ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ (11) ",
    "tafsir" : "( تؤمنون بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم ذلكم خير لكم إن كنتم تعلمون ) أي : من تجارة الدنيا ، والكد لها ، والتصدي لها وحدها ."
  }, {
    "id" : 12,
    "eya" : "يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ (12) ",
    "tafsir" : "( يغفر لكم ذنوبكم ) أي : إن فعلتم ما أمرتكم به ودللتكم عليه ، غفرت لكم الزلات ، وأدخلتكم الجنات ، والمساكن الطيبات ، والدرجات العاليات ; ولهذا قال : ( ويدخلكم جنات تجري من تحتها الأنهار ومساكن طيبة في جنات عدن ذلك الفوز العظيم )"
  }, {
    "id" : 13,
    "eya" : "وَأُخْرَىٰ تُحِبُّونَهَا ۖ نَصْرٌ مِّنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ (13) ",
    "tafsir" : "( وأخرى تحبونها ) أي : وأزيدكم على ذلك زيادة تحبونها ، وهي : ( نصر من الله وفتح قريب ) أي : إذا قاتلتم في سبيله ونصرتم دينه ، تكفل الله بنصركم . قال الله تعالى : ( يا أيها الذين آمنوا إن تنصروا الله ينصركم ويثبت أقدامكم )[ محمد : 7 ] وقال تعالى : ( ولينصرن الله من ينصره إن الله لقوي عزيز )[ الحج : 40 ]( وفتح قريب ) أي : عاجل فهذه الزيادة هي خير الدنيا موصول بنعيم الآخرة ، لمن أطاع الله ورسوله ، ونصر الله ودينه ; ولهذا قال : ( وبشر المؤمنين )"
  }, {
    "id" : 14,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنصَارُ اللَّهِ ۖ فَآمَنَت طَّائِفَةٌ مِّن بَنِي إِسْرَائِيلَ وَكَفَرَت طَّائِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ (14) ",
    "tafsir" : "( من أنصاري إلى الله ) ؟ أي : معيني في الدعوة إلى الله عز وجل ؟ ( قال الحواريون ) - وهم أتباع عيسى عليه السلام - : ( نحن أنصار الله ) أي : نحن أنصارك على ما أرسلت به وموازروك على ذلك ; ولهذا بعثهم دعاة إلى الناس في بلاد الشام في الإسرائيليين واليونانيين . وهكذا كان رسول الله - صلى الله عليه وسلم - يقول في أيام الحج :  حتى قيض الله عز وجل له الأوس ، والخزرج من أهل المدينة فبايعوه ، ووازروه ، وشارطوه أن يمنعوه من الأسود ، والأحمر إن هو هاجر إليهم ، فلما هاجر إليهم بمن معه من أصحابه وفوا له بما عاهدوا الله عليه ; ولهذا سماهم الله ورسوله : الأنصار وصار ذلك علما عليهم ، رضي الله عنهم ، وأرضاهم . وقوله : ( فآمنت طائفة من بني إسرائيل وكفرت طائفة ) أي : لما بلغ عيسى ابن مريم عليه السلام رسالة ربه إلى قومه ، ووازره من وازره من الحواريين اهتدت طائفة من بني إسرائيل بما جاءهم به ، وضلت طائفة فخرجت عما جاءهم به ، وجحدوا نبوته ، ورموه وأمه بالعظائم ، وهم اليهود - عليهم لعائن الله المتتابعة إلى يوم القيامة - وغلت فيه طائفة ممن اتبعه ، حتى رفعوه فوق ما أعطاه الله من النبوة ، وافترقوا فرقا وشيعا ، فمن قائل منهم : إنه ابن الله . وقائل : إنه ثالث ثلاثة : الأب ، والابن ، وروح القدس . ومن قائل : إنه الله . وكل هذه الأقوال مفصلة في سورة النساء .( فأيدنا الذين آمنوا على عدوهم ) أي : نصرناهم على من عاداهم من فرق النصارى ) فأصبحوا ظاهرين ) أي : عليهم ، وذلك ببعثة محمد - صلى الله عليه وسلم - كما قال الإمام أبو جعفر بن جرير رحمه الله .\nحدثني أبو السائب ، حدثنا أبو معاوية ، عن الأعمش ، عن المنهال - يعني ابن عمرو - عن سعيد بن جبير ، عن ابن عباس رضي الله عنهما قال : لما أراد الله عز وجل أن يرفع عيسى إلى السماء ، خرج إلى أصحابه وهم في بيت اثنا عشر رجلا من عين في البيت ، ورأسه يقطر ماء ، فقال : إن منكم من يكفر بي اثنتي عشرة مرة بعد أن آمن بي . قال : ثم قال : أيكم يلقى عليه شبهي فيقتل مكاني ، ويكون معي في درجتي ؟ قال : فقام شاب من أحدثهم سنا فقال : أنا . قال : فقال له : اجلس . ثم أعاد عليهم ، فقام الشاب فقال : أنا . فقال له : اجلس . ثم عاد عليهم فقام الشاب ، فقال : أنا . فقال : نعم ، أنت ذاك . قال : فألقي عليه شبه عيسى ، ورفع عيسى عليه السلام من روزنة في البيت إلى السماء ، قال : وجاء الطلب من اليهود فأخذوا شبهه فقتلوه وصلبوه ، وكفر به بعضهم اثنتي عشرة مرة بعد أن آمن به ، فتفرقوا فيه ثلاث فرق . فقالت فرقة : كان الله فينا ما شاء ، ثم صعد إلى السماء . وهؤلاء اليعقوبية . وقالت فرقة : كان فينا ابن الله ما شاء ، ثم رفعه إليه وهؤلاء النسطورية وقالت فرقة كان فينا عبد الله ورسوله ما شاء الله ثم رفعه إليه ، وهؤلاء المسلمون فتظاهرت الكافرتان على المسلمة ، فقتلوها ، فلم يزل الإسلام طامسا حتى بعث الله محمدا - صلى الله عليه وسلم - ( فآمنت طائفة من بني إسرائيل وكفرت طائفة ) يعني : الطائفة التي كفرت من بني إسرائيل في زمن عيسى والطائفة التي آمنت في زمن عيسى ) فأيدنا الذين آمنوا على عدوهم فأصبحوا ظاهرين ) بإظهار محمد - صلى الله عليه وسلم - دينهم على دين الكفار ( فأصبحوا ظاهرين )\nهذا لفظه في كتابه عند تفسير هذه الآية الكريمة . وهكذا رواه النسائي عند تفسير هذه الآية من سننه ، عن أبي كريب ، عن محمد بن العلاء ، عن أبي معاوية بمثله سواء .\nفأمة محمد - صلى الله عليه وسلم - لا يزالون ظاهرين على الحق ، حتى يأتي أمر الله وهم كذلك ، وحتى يقاتل آخرهم الدجال مع المسيح عيسى ابن مريم عليه السلام ، كما وردت بذلك الأحاديث الصحاح ، والله أعلم ."
  } ]
}