{
  "id" : 66,
  "name" : "التحْريم",
  "type" : "مدنيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ (1) ",
    "tafsir" : " الآية قال أبو عبدالرحمن النسائي أخبرنا إبراهيم بن يونس بن محمد حدثنا أبي حدثنا حماد بن سلمة عن ثابت عن أنس أن رسول الله صلى الله عليه وسلم كانت له أمة يطؤها فلم تزل به عائشة وحفصة حتى حرمها فأنزل الله عز وجل  إلى آخر الآية.\nوقال ابن جرير حدثني ابن عبدالرحيم البرقي حدثنا ابن أبي مريم ثنا أبو غسان حدثني زيد بن أسلم أن رسول الله صلى الله عليه وسلم أصاب أم إبراهيم في بيت بعض نسائه فقالت أي رسول الله في بيتي وعلى فراشي؟ فجعلها عليه حراما قالت أي رسول الله كيف يحرم عليك الحلال؟ فحلف لها بالله لا يصيبها فأنزل الله تعالى  قال زيد بن أسلم فقوله أنت علي حرام لغو وهكذا روى عبدالرحمن بن زيد عن أبيه وقال ابن جرير أيضا حدثنا يونس ثنا ابن وهب عن مالك عن زيد بن أسلم قال: قال لها  وقال سفيان الثوري بن علية عن داود بن أبي هند عن الشعبي عن مسروق قال آلى رسول الله صلى الله عليه وسلم وحرم فعوتب في التحريم وأمر بالكفارة فى اليمين رواه ابن جرير وكذا روي عن قتادة وغيره عن الشعبي نفسه وكذا قال غير واحد من السلف منهم الضحاك والحسن وقتادة ومقاتل بن حيان وروى العوفي عن ابن عباس قال: قلت لعمر بن الخطاب من المرأتان؟ قال عائشة وحفصة وكان بدء الحديث في شأن أم إبراهيم مارية أصابها النبي صلى الله عليه وسلم في بيت حفصة في نوبتها فوجدت حفصة فقالت يا نبي الله لقد جئت إلي شيئا ما جئت إلى أحد من أزواجك في يومي وفي دوري وعلى فراشي قال  قالت بلى فحرمها وقال لها  فذكرته لعائشة فأظهره الله عليه فأنزل الله تعالى  الآيات كلها فبلغنا أن رسول الله صلى الله عليه وسلم كفر عن يمينه وأصاب جاريته وقال الهيثم بن كليب في مسنده ثنا أبو قلابة عبدالملك بن محمد الرقاشي ثنا مسلم بن إبراهيم ثنا جرير بن حازم عن أيوب عن نافع عن ابن عمر عن عمر قال: قال النبي صلى الله عليه وسلم لحفصة  فقالت أتحرم ما أحل الله لك؟ قال  قال فلم يقربها حتى أخبرت عائشة."
  }, {
    "id" : 2,
    "eya" : "قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ (2) ",
    "tafsir" : " وهذا إسناد صحيح ولم يخرجه أحد من أصحاب الكتب الستة وقد اختاره الحافظ الضياء المقدسي في كتابه المستخرج.\nوقال ابن جرير أيضا حدثني يعقوب بن إبراهيم ثنا ابن عليه ثنا هشام الدستوائي قال كتب إلي يحيى يحدث عن يعلى بن حكيم عن سعيد بن جبير أن ابن عباس كان يقول في الحرام يمين تكفرها وقال ابن عباس  يعني أن رسول الله صلى الله عليه وسلم حرم جاريته فقال الله تعالى  فكفر يمينه فصير الحرام يمينا.\nورواه البخاري عن معاذ بن فضالة عن هشام هو الدستوائي عن يحيى هو ابن أبي كثير عن ابن حكيم وهو يعلى عن سعيد بن جبير عن ابن عباس في الحرام يمين تكفر وقال ابن عباس  ورواه مسلم من حديث هشام الدستوائي به وقال النسائي أنا عبدالله بن عبد الصمد بن علي ثنا مخلد بن يزيد ثنا سفيان عن سالم عن سعيد بن جبير عن ابن عباس قال أتاه رجل فقال إني جعلت امرأتي علي حراما قال كذبت ليس عليك بحرام ثم تلا هذه الآية  عليك أغلظ الكفارات عتق رقبة تفرد به النسائي من هذا الوجه بهذا اللفظ وقال الطبراني ثنا محمد بن زكريا ثنا عبدالله بن رجاء ثنا إسرائيل عن مسلم عن مجاهد عن ابن عباس في قوله تعالى  قال حرم رسول الله صلى الله عليه وسلم سريته ومن ههنا ذهب من ذهب من الفقهاء ممن قال بوجوب الكفارة على من حرم جاريته أو زوجته أو طعاما أو شرابا أو ملبسا أو شيئا من المباحات وهو مذهب الإمام أحمد وطائفة وذهب الشافعي إلى أنه لا تجب الكفارة فيما عدا الزوجة والجارية إذا حرم عينيهما أو أطلق التحريم فيهما في قول فأما إذا نوى بالتحريم طلاق الزوجة أو عتق الأمة نفذ فيهما وقال ابن أبي حاتم حدثني أبو عبدالله الطهراني أنا حفص بن عمر العدني أنا الحكم بن أبان أنا عكرمة عن ابن عباس قال نزلت هذه الآية  في المرأة التي وهبت نفسها للنبي صلى الله عليه وسلم وهذا قول غريب.\nوالصحيح أن ذلك كان في تحريمه العسل كما قال البخاري عند هذه الآية ثنا إبراهيم بن موسى أنا هشام بن يوسف عن ابن جريج عن عطاء عن عبيد بن عمير عن عائشة قالت كان النبي صلى الله عليه وسلم يشرب عسلا عند زينب بنت جحش ويمكث عندها فتواطأت أنا وحفصة على أيتنا دخل عليها فلتقل له: أكلت مغافير إني أجد منك ريح مغافير. هكذا أورد هذا الحديث ههنا بهذا اللفظ.\nوقال في كتاب الأيمان والنذور ثنا الحسن بن محمد ثنا الحجاج عن ابن جريج قال زعم عطاء أنه سمع عبيد بن عمير يقول سمعت عائشة تزعم أن رسول الله صلى الله عليه وسلم كان يمكث عند زينب بنت جحش ويشرب عندها عسلا فتواطأت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل له إني أجد منك ريح مغافير أكلت مغافير فدخل على إحداهما النبي صلى الله عليه وسلم فقالت ذلك له فقال:  لعائشة وحفصة."
  }, {
    "id" : 3,
    "eya" : "وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَن بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ (3) ",
    "tafsir" : " وقال إبراهيم بن موسى عن هشام  وهكذا رواه في كتاب الطلاق بهذا الإسناد ولفظه قريب منه.\nثم قال المغافير شبيه بالصمغ يكون في الرمث فيه حلاوة أغفر الرمث إذا ظهر فيه واحدها مغفور ويقال مغافير وهكذا قال الجوهري قال وقد يكون المغفور أيضا للعشر والثمام والسلم والطلح قال والرمث بالكسر مرعى من مراعي الإبل وهو من الحمض قال والعرفط شجر من العظاة ينضح المغفور.\nوقد روى مسلم هذا الحديث في كتاب الطلاق من صحيحه عن محمد بن حاتم عن حجاج عن ابن جريج أخبرني عطاء عن عبيد بن عمير عن عائشة به ولفظه كما أورده البخاري فى الأيمان والنذور ثم قال البخاري في كتاب الطلاق ثنا فروة بن أبي المغراء ثنا علي بن مسهر عن هشام بن عروة عن أبيه عن عائشة قالت: كان رسول الله صلى الله عليه وسلم يحب الحلوى والعسل وكان إذا انصرف من العصر دخل على نسائه فيدنو من إحداهن فدخل على حفصة بنت عمر فاحتبس أكثر ما كان يحتبس فغرت فسألت عن ذلك فقيل لي أهدت لها امرأة من قومها عكة عسل فسقت النبي صلى الله عليه وسلم منه شربة فقلت أما والله لنحتالن له فقلت لسودة بنت زمعة إنه سيدنو منك فإذا دنا منك فقولي أكلت مغافير فإنه سيقول لك لا فقولي له ما هذه الريح التي أجد فإنه سيقول لك سقتني حفصة شربة عسل فقولي جرست نحله العرفط وسأقول ذلك وقولي له أنت يا صفية ذلك قالت تقول سودة فوالله ما هو إلا أن قام على الباب فأردت أن أناديه بما أمرتني فرقا منك فلما دنا منها قالت له سودة يا رسول الله أكلت مغافير؟ قال  قالت فما هذه الريح التي أجد منك؟ قال  قالت جرست نحله العرفط فلما دار إلي قلت نحو ذلك فلما دار إلى صفية قالت له مثل ذلك فلما دار إلى حفصة قالت له يا رسول الله ألا أسقيك منه؟ قال  قالت تقول سودة والله لقد حرمناه قلت لها اسكتي هذا لفظ البخاري.\nوقد رواه مسلم عن سويد بن سعيد عن علي بن مسهر به وعن أبي كريب وهارون بن عبدالله والحسن بن بشر ثلاثتهم عن أبي أسامة حماد بن أسامة عن هشام بن عروة به وعنده: قالت وكان رسول الله صلى الله عليه وسلم يشتد عليه أن يوجد منه الريح يعني الريح الخبيثة ولهذا قلن له أكلت مغافير لأن ريحها فيه شيء فلما قال  قلن جرست نحله العرفط أي رعت نحله شجر العرفط الذي صمغه المغافير فلهذا ظهر ريحه في العسل الذي شربته قال الجوهري جرست النحل العرفط تجرس إذا أكلته ومنه قيل للنحل جوارس قال الشاعر تظل على الثمراء منها جوارس وقال الجرس والجرس الصوت الخفي ويقال سمعت جرس الطير إذا سمعت صوت مناقيرها على شيء تأكله وفي الحديث  قال الأصمعي كنت في مجلس شعبة قال فيسمعون جرش طير الجنة بالشين فقلت جرس فنظر إلي فقال: خذوها عنه فإنه أعلم بهذا منا.\nوالغرض أن هذا السياق فيه أن حفصة هي الساقية للعسل وهو من طريق هشام بن عروة عن أبيه عن خالته عن عائشة وفي طريق ابن جريج عن عطاء عن عبيد بن عمير عن عائشة أن زينب بنت جحش هي التي سقته العسل وأن عائشة وحفصة تواطأتا وتظاهرتا عليه فالله أعلم.\nوقد يقال أنهما واقعتان ولا بعد في ذلك إلا أن كونهما سببا لنزول هذه الآية فيه نظر والله أعلم.\nومما يدل على أن عائشة وحفصة رضي الله عنهما هما المتظاهرتان الحديث الذي رواه الإمام أحمد في مسنده حيث قال ثنا عبدالرزاق أنا معمر عن الزهري عن عبيدالله بن عبدالله بن أبي ثور عن ابن عباس قال: لم أزل حريصا على أن أسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين."
  }, {
    "id" : 4,
    "eya" : "إِن تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِن تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ (4) ",
    "tafsir" : " حتى حج عمر وحججت معه فلما كان ببعض الطريق عدل عمر وعدلت معه بالإداوة فتبرز ثم أتاني فسكبت على يديه فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله تعالى  فقال عمر: واعجبا لك يا ابن عباس قال الزهري: كره والله ما سأله عنه ولم يكتمه قال هي عائشة وحفصة قال ثم أخذ يسوق الحديث قال: كنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم: قال وكان منزلي في دار أمية بن زيد بالعوالي قال فغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر أن أراجعك؟ فوالله إن أزواج رسول الله صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل قال فانطلقت فدخلت على حفصة فقلت أتراجعين رسول الله صلى الله عليه وسلم؟ قالت نعم.\nقلت: وتهجره إحد اليوم إلى الليل؟ قالت نعم قلت قد خاب من فعل ذلك منكن وخسر أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني من مالي ما بدالك ولا يغرنك إن كانت جارتك هي أوسم - أي أجمل - وأحب إلى رسول الله صلى الله عليه وسلم منك يريد عائشة قال - وكان لي جار من الأنصار وكنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما فيأتيني بخبر الوحي وغيره وآتيه بمثل ذلك وقال وكنا نتحدث أن غسان تنعل الخيل لتغزونا فنزل صاحبي يوما ثم أتى عشاء فضرب بابي ثم ناداني فخرجت إليه فقال حدث أمر عظيم فقلت وما ذاك أجاءت غسان؟ قال لا بل أعظم من ذلك وأطول طلق رسول الله صلى الله عليه وسلم نساءه فقلت قد خابت حفصة وخسرت قد كنت أظن هذا كائنا حتى إذا صليت الصبح شددت علي ثيابي ثم نزلت فدخلت على حفصة وهي تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم؟ فقالت لا أدري هو هذا معتزل في هذه المشربة فأتيت غلاما له أسود فقلت استأذن لعمر فدخل الغلام ثم خرج إلي فقال له فصمت فانطلقت حتى أتيت المنبر فإذا عنده رهط جلوس يبكي بعضهم فجلست عنده قليلا ثم غلبني ما أجد فأتيت الغلام فقلت: استأذن لعمر فدخل ثم خرج إلي فقال قد ذكرتك له فصمت فخرجت فجلست إلى المنبر ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر فدخل ثم خرج إلي فقال: قد ذكرتك له فصمت فوليت مدبرا فإذا الغلام يدعوني فقال ادخل قد أذن لك فدخلت فسلمت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمال حصير- قال الإمام أحمد: وحدثناه يعقوب في حديث صالح قال رمال حصير - وقد أثر في جنبه فقلت: أطلقت يا رسول الله نساءك؟ فرفع رأسه إلي وقال  فقلت الله أكبر ولو رأيتنا يا رسول الله وكنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فغضبت علي امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر أن أراجعك؟ فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل فقلت قد خاب من فعل ذلك منكن وخسرت أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت فتبسم رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد دخلت على حفصة فقلت لا يغرنك إن كانت جارتك هي أوسم أو أحب إلى رسول الله صلى الله عليه وسلم منك فتبسم أخرى فقلت أستأنس يا رسول الله؟ قال  فجلست فرفعت رأسي في البيت فوالله ما رأيت في البيت شيئا يرد البصر إلا أهب مقامة فقلت أدع الله يا رسول الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدون الله فاستوى جالسا وقال  فقلت استغفر لي يا رسول الله وكان أقسم أن لا يدخل عليهن شهرا من شدة موجدته عليهن حتى عاتبه الله عز وجل وقد رواه البخاري ومسلم والترمذي والنسائي من طرق عن الزهري به وأخرجه الشيخان من حديث يحيى بن سعيد الأنصاري عن سعيد بن جبير عن ابن عباس قال: مكثت سنة أريد أن أسأل عمر بن الخطاب عن آية فما أستطيع أن أسأله هيبة له حتى خرج حاجا فخرجت معه فلما رجعنا وكنا ببعض الطريق عدل إلى الأراك لحاجة له قال فوقفت حتى فرغ ثم سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على النبي صلى الله عليه وسلم؟ هذا لفظ البخاري ولمسلم من المرأتان اللتان قال الله تعالى  قال عائشة وحفصة ثم ساق الحديث بطوله ومنهم من اختصره.\nوقال مسلم أيضا حدثني زهير بن حرب حدثنا عمر بن يونس الحنفي ثنا عكرمة بن عمار عن سماك بن الوليد أبي زميل حدثني عبدالله بن عباس حدثني عمر بن الخطاب قال: لما اعتزل نبي الله صلى الله عليه وسلم نساءه دخلت المسجد فإذا الناس ينكتون بالحصى ويقولون طلق رسول الله صلى الله عليه وسلم نساءه وذلك قبل أن يؤمر بالحجاب فقلت لأعلمن ذلك اليوم فذكر الحديث في دخوله على عائشة وحفصة ووعظه إياهما إلى أن قال فدخلت فإذا أنا برباح غلام رسول الله صلى الله عليه وسلم على أسكفة المشربة فناديت فقلت يا رباح استأذن لي على رسول الله صلى الله عليه وسلم فذكر نحو ما تقدم - إلى أن قال - فقلت يا رسول الله ما يشق عليك من أمر النساء فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكال وأنا وأبو بكر والمؤمنون معك وقلما تكلمت - وأحمد الله - بكلام إلا رجوت أن يكون الله يصدق قولي."
  }, {
    "id" : 5,
    "eya" : "عَسَىٰ رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِّنكُنَّ مُسْلِمَاتٍ مُّؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا (5) ",
    "tafsir" : " فقلت أطلقتهن؟ قال  فقمت على باب المسجد فناديت بأعلى صوتي لم يطلق نساءه ونزلت هذه الآية  فكنت أنا استنبطت ذلك الأمر وكذا قال سعيد بن جبير وعكرمة ومقاتل بن حيان والضحاك وغيرهم  أبو بكر وعمر زاد الحسن البصري وعثمان قال ليث بن أبي سليم عن مجاهد  قال علي بن أبي طالب وقال ابن أبي حاتم حدثنا علي بن الحسين ثنا محمد بن أبي عمر ثنا محمد بن جعفر بن محمد بن الحسين قال أخبرني رجل ثقة يرفعه إلى علي قال: قال رسول الله صلى الله عليه وسلم في قوله تعالى  إسناده ضعيف وهو منكر جدا وقال البخاري ثنا عمرو بن عون ثنا هشيم عن حميد عن أنس قال: قال عمر اجتمع نساء النبي صلى الله عليه وسلم في الغيرة عليه فقلت لهن  فنزلت هذه الآية وقد تقدم أنه وافق القرآن في أماكن منها في نزول الحجاب ومنها في أسارى بدر ومنها قوله لو اتخذت من مقام إبراهيم مصلى فأنزل الله تعالى  وقال ابن أبي حاتم ثنا أبي حدثنا الأنصاري ثنا حميد عن أنس قال: قال عمر بن الخطاب بلغني شيء كان بين أمهات المؤمنين وبين النبي صلى الله عليه وسلم فاستقريتهن أقول لتكفن عن رسول الله صلى الله عليه وسلم أو ليبدلنه الله أزواجا خيرا منكن حتى أتيت على آخر أمهات المؤمنين فقالت: يا عمر أما في رسول الله ما يعظ نساءه حتى تعظهن؟.\nفأمسكت فأنزل الله عز وجل  وهذه المرأة التي ردته عما كان فيه من وعظ النساء هي أم سلمة كما ثبت ذلك في صحيح البخاري وقال الطبراني ثنا إبراهيم بن نائلة الأصبهاني ثنا إسماعيل البجلي ثنا أبو عوانة عن أبي سنان عن الضحاك عن ابن عباس في قوله  قال دخلت حفصة على النبي صلى الله عليه وسلم في بيتها وهو يطأ مارية فقال لها رسول الله صلى الله عليه وسلم  فذهبت حفصة فأخبرت عائشة فقالت عائشة لرسول الله صلى الله عليه وسلم من أنبأك هذا؟ قال  فقالت عائشة لا أنظر إليك حتى تحرم مارية فحرمها فأنزل الله تعالى  إسناده فيه نظر وقد تبين مما أوردناه تفسير هذه الآيات الكريمات ومعنى قوله  ظاهر وقوله تعالى  أي صائمات قاله أبو هريرة وعائشة وابن عباس وعكرمة ومجاهد وسعيد بن جبير وعطاء ومحمد بن كعب القرظي وأبو عبدالرحمن السلمي وأبو مالك وإبراهيم النخعي والحسن وقتادة والضحاك والربيع بن أنس والسدي وغيرهم.\nوتقدم فيه حديث مرفوع عند قوله  في سورة براءة ولفظه  وقال زيد بن أسلم وابنه عبدالرحمن  أي مهاجرات وتلا عبدالرحمن  أي المهاجرون والقول الأول أولى والله أعلم. أي منهن ثيبات ومنهن أبكارا ليكون ذلك أشهى إلى النفس فإن التنوع يبسط النفس ولهذا قال  وقال أبو القاسم الطبراني في معجمه الكبير ثنا أبو بكر بن صدقة ثنا محمد بن محمد بن مرزوق ثنا عبدالله بن أبي أمية ثنا عبدالقدوس عن صالح بن حيان عن ابن بريدة عن أبيه  قال وعد الله نبيه صلى الله عليه وسلم في هذه الآية أن يزوجه فالثيب آسية امرأة فرعون وبالأبكار مريم بنت عمران.\nوذكر الحافظ ابن عساكر فى ترجمة مريم عليها السلام من طريق سويد بن سعيد ثنا محمد بن صالح بن عمر عن الضحاك ومجاهد عن ابن عمر قال: جاء جبريل إلى رسول الله صلى الله عليه وسلم فمرت خديجة فقال إن الله يقرئها السلام ويبشرها ببيت في الجنة من قصب بعيد من اللهب لا نصب فيه ولا صخب من لؤلؤة جوفاء بين بيت مريم بنت عمران وبيت آسية بنت مزاحم.\nومن حديث أبي بكر الهذلي عن عكرمة عن ابن عباس أن النبي صلى الله عليه وسلم دخل على خديجة وهي في الموت فقال  فقالت يا رسول الله وهل تزوجت قبلي؟ قال  ضعيف أيضا وقال أبو يعلى ثنا إبراهيم بن عرعرة ثنا عبدالنور بن عبدالله ثنا يوسف بن شعيب عن أبي أمامة قال: قال رسول الله صلى الله عليه وسلم  فقلت هنيئا لك يا رسول الله وهذا أيضا ضعيف وروى مرسلا عن ابن أبي داود."
  }, {
    "id" : 6,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَّا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ (6) ",
    "tafsir" : " يقول أدبوهم وعلموهم وقال علي بن أبي طلحة عن ابن عباس  يقول اعملوا بطاعة الله واتقوا معاصي الله وأمروا أهليكم بالذكر ينجيكم الله من النار. قال اتقوا الله وأوصوا أهليكم بتقوى الله وقال قتادة تأمرهم بطاعة الله وتنهاهم عن معصية الله وأن تقوم عليهم بأمر الله وتأمرهم به وتساعدهم عليه فإذا رأيت لله معصية قذعتهم عنها وزجرتهم عنها وهكذا قال الضحاك ومقاتل حق المسلم أن يعلم أهله من قرابته وإمائه وعبيده ما فرض الله عليهم وما نهاهم الله عنه.\nوفي معنى هذه الآية الحديث الذي رواه أحمد وأبو داود والترمذي من حديث عبدالملك بن الربيع بن سبرة عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم  هذا لفظ أبي داود وقال الترمذي هذا حديث حسن وروى أبو داود من حديث عمرو بن شعيب عن أبيه عن جده عن رسول الله صلى الله عليه وسلم مثل ذلك قال الفقهاء وهكذا في الصوم ليكون ذلك تمرينا له على العبادة لكي يبلغ وهو مستمر علي العبادة والطاعة ومجانبة المعاصي وترك المنكر والله الموفق. وقودها أي حطبها الذي يلقي فيه جثث بني آدم  قيل المراد بها الأصنام التي تعبد لقوله تعالى  وقال ابن مسعود ومجاهد وأبو جعفر الباقر والسدي هي حجارة من كبريت زاد مجاهد: أنتن من الجيفة وروى ذلك ابن أبي حاتم رحمه الله قال ثنا أبي ثنا عبدالرحمن بن سنان المنقري ثنا عبدالعزيز - يعني ابن أبي داود - قال بلغني أن رسول الله صلى الله عليه وسلم تلا هذه الآية  وعنده بعض أصحابه وفيهم شيخ فقال الشيخ يا رسول الله حجارة جهنم كحجارة الدنيا؟ فقال النبي صلي الله عليه وسلم  قال فوقع الشيخ مغشيا عليه فوضع النبي صلى الله عليه وسلم يده على فؤاده فإذا هو حي فناداه قال  فقالها فبشره بالجنة قال: فقال أصحابه يا رسول الله أمن بيننا؟ قال ذلك لمن خاف مقامي وخاف وعيدعليها ملائكة غلاظ شدادلا يعصون الله ما أمرهم ويفعلون ما يؤمرون\" أي مهما أمرهم به تعالى يبادروا إليه لا يتأخرون عنه طرفة عين وهم قادرون على فعله ليس بهم عجز عنه.\nوهؤلاء هم الزبانية - عياذا بالله منهم."
  }, {
    "id" : 7,
    "eya" : "يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ (7) ",
    "tafsir" : "( قوا أنفسكم وأهليكم نارا ) يقول : أدبوهم ، علموهم .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( قوا أنفسكم وأهليكم نارا ) يقول : اعملوا بطاعة الله ، واتقوا معاصي الله ، ومروا أهليكم بالذكر ، ينجيكم الله من النار .\nوقال مجاهد : ( قوا أنفسكم وأهليكم نارا ) قال : اتقوا الله ، وأوصوا أهليكم بتقوى الله . .\nوقال قتادة : يأمرهم بطاعة الله ، وينهاهم عن معصية الله ، وأن يقوم عليهم بأمر الله ، ويأمرهم به ويساعدهم عليه ، فإذا رأيت لله معصية ، قدعتهم عنها ، وزجرتهم عنها .\nوهكذا قال الضحاك ، ومقاتل : حق على المسلم أن يعلم أهله من قرابته ، وإمائه ، وعبيده ما فرض الله عليهم ، وما نهاهم الله عنه .\nوفي معنى هذه الآية الحديث الذي رواه الإمام أحمد ، وأبو داود ، والترمذي ، من حديث عبد الملك بن الربيع بن سبرة ، عن أبيه ، عن جده ، قال : قال رسول الله - صلى الله عليه وسلم - : \nهذا لفظ أبي داود ، وقال الترمذي : هذا حديث حسن .\nوروى أبو داود من حديث عمرو بن شعيب ، عن أبيه ، عن جده ، عن النبي - صلى الله عليه وسلم - مثل ذلك .\nقال الفقهاء : وهكذا في الصوم ; ليكون ذلك تمرينا له على العبادة ، لكي يبلغ وهو مستمر على العبادة ، والطاعة ، ومجانبة المعصية ، وترك المنكر ، والله الموفق .( وقودها الناس والحجارة )( وقودها ) أي : حطبها الذي يلقى فيها جثث بني آدم . ( والحجارة ) قيل : المراد بذلك الأصنام التي كانت تعبد لقوله : ( إنكم وما تعبدون من دون الله حصب جهنم )[ الأنبياء : 98 ]\nوقال ابن مسعود ، ومجاهد ، وأبو جعفر الباقر ، والسدي : هي حجارة من كبريت - زاد مجاهد : أنتن من الجيفة .\nوروى ذلك ابن أبي حاتم رحمه الله ، ثم قال : حدثنا أبي ، حدثنا عبد الرحمن بن سنان المنقري ، حدثنا عبد العزيز - يعني ابن أبي راود - قال : بلغني أن رسول الله - صلى الله عليه وسلم - تلا هذه الآية : ( يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة ) وعنده بعض أصحابه ، وفيهم شيخ ، فقال الشيخ : يا رسول الله ، حجارة جهنم كحجارة الدنيا ؟ فقال النبي - صلى الله عليه وسلم - :  . قال : فوقع الشيخ مغشيا عليه ، فوضع النبي - صلى الله عليه وسلم - يده على فؤاده فإذا هو حي فناداه قال :  . فقالها ، فبشره بالجنة ، قال : فقال أصحابه : يا رسول الله ، أمن بيننا ؟ قال : \" نعم ، يقول الله تعالى : ( ذلك لمن خاف مقامي وخاف وعيد )[ إبراهيم : 14 ] هذا حديث مرسل غريب .( عليها ملائكة غلاظ شداد ) أي : طباعهم غليظة ، قد نزعت من قلوبهم الرحمة بالكافرين بالله ، ( شداد ) أي : تركيبهم في غاية الشدة ، والكثافة ، والمنظر المزعج .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا سلمة بن شبيب ، حدثنا إبراهيم بن الحكم بن أبان ، حدثنا أبي ، عن عكرمة أنه قال : إذا وصل أول أهل النار إلى النار ، وجدوا على الباب أربعمائة ألف من خزنة جهنم ، سود وجوههم ، كالحة أنيابهم ، قد نزع الله من قلوبهم الرحمة ، ليس في قلب واحد منهم مثقال ذرة من الرحمة ، لو طير الطير من منكب أحدهم لطار شهرين قبل أن يبلغ منكبه الآخر ، ثم يجدون على الباب التسعة عشر ، عرض صدر أحدهم سبعون خريفا ، ثم يهوون من باب إلى باب خمسمائة سنة ، ثم يجدون على كل باب منها مثل ما وجدوا على الباب الأول ، حتى ينتهوا إلى آخرها .( لا يعصون الله ما أمرهم ويفعلون ما يؤمرون ) أي : مهما أمرهم به تعالى يبادروا إليه ، لا يتأخرون عنه طرفة عين ، وهم قادرون على فعله ليس بهم عجز عنه . وهؤلاء هم الزبانية عياذا بالله منهم . وقوله : ( يا أيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون ) أي : يقال للكفرة يوم القيامة : لا تعتذروا فإنه لا يقبل منكم ، وإنما تجزون اليوم بأعمالكم ."
  }, {
    "id" : 8,
    "eya" : "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ (8) ",
    "tafsir" : "( يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا ) أي : توبة صادقة جازمة ، تمحو ما قبلها من السيئات ، وتلم شعث التائب ، وتجمعه ، وتكفه عما كان يتعاطاه من الدناءات .\nقال ابن جرير : حدثنا ابن مثنى ، حدثنا محمد ، حدثنا شعبة ، عن سماك بن حرب : سمعت النعمان بن بشير يخطب : سمعت عمر بن الخطاب رضي الله عنه ، يقول : ( يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا ) قال : يذنب الذنب ثم لا يرجع فيه .\nوقال الثوري ، عن سماك ، عن النعمان ، عن عمر قال : التوبة النصوح : أن يتوب من الذنب ثم لا يعود فيه ، أو لا يعود فيه .\nوقال أبو الأحوص ، وغيره ، عن سماك ، عن النعمان ، سئل عمر عن التوبة النصوح ، فقال : أن يتوب الرجل من العمل السيئ ، ثم لا يعود إليه أبدا .\nوقال الأعمش ، عن أبي إسحاق ، عن أبي الأحوص ، عن عبد الله : ( توبة نصوحا ) قال : يتوب ثم لا يعود .\nوقد روي هذا مرفوعا فقال الإمام أحمد : حدثنا علي بن عاصم عن إبراهيم الهجري ، عن أبي الأحوص ، عن عبد الله بن مسعود ، قال : قال رسول الله - صلى الله عليه وسلم - :  . تفرد به أحمد من طريق إبراهيم بن مسلم الهجري وهو ضعيف ، والموقوف أصح والله أعلم .\nولهذا قال العلماء : التوبة النصوح هو أن يقلع عن الذنب في الحاضر ، ويندم على ما سلف منه في الماضي ، ويعزم على ألا يفعل في المستقبل . ثم إن كان الحق لآدمي رده إليه بطريقه .\nقال الإمام أحمد : حدثنا سفيان ، عن عبد الكريم ، أخبرني زياد بن أبي مريم ، عن عبد الله بن معقل قال : دخلت مع أبي على عبد الله بن مسعود فقال : أنت سمعت النبي - صلى الله عليه وسلم - يقول :  . قال : نعم . وقال مرة : نعم سمعته يقول : \nورواه ابن ماجه ، عن هشام بن عمار ، عن سفيان بن عيينة ، عن عبد الكريم - وهو ابن مالك الجزري - به .\nوقال ابن أبي حاتم : حدثنا الحسن بن عرفة ، حدثني الوليد بن بكير أبو خباب ، عن عبد الله بن محمد العدوي ، عن أبي سنان البصري ، عن أبي قلابة ، عن زر بن حبيش ، عن أبي بن كعب قال : قيل لنا أشياء تكون في آخر هذه الأمة عند اقتراب الساعة ، منها نكاح الرجل امرأته ، أو أمته في دبرها ، وذلك مما حرم الله ورسوله ، ويمقت الله عليه ورسوله ، ومنها : نكاح الرجل الرجل ، وذلك مما حرم الله ورسوله ، ويمقت الله عليه ورسوله . ومنها نكاح المرأة المرأة ، وذلك مما حرم الله ورسوله ، ويمقت الله عليه ورسوله . وليس لهؤلاء صلاة ما أقاموا على هذا ، حتى يتوبوا إلى الله توبة نصوحا . قال زر : فقلت لأبي بن كعب : فما التوبة النصوح ؟ فقال : سألت رسول الله - صلى الله عليه وسلم - فقال : \nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا عمرو بن علي ، حدثنا عباد بن عمرو ، حدثنا أبو عمرو بن العلاء سمعت الحسن يقول : التوبة النصوح : أن تبغض الذنب كما أحببته ، وتستغفر منه إذا ذكرته .\nفأما إذا حزم بالتوبة وصمم عليها فإنها تجب ما قبلها من الخطيئات ، كما ثبت في الصحيح : \nوهل من شرط التوبة النصوح الاستمرار على ذلك إلى الممات ، كما تقدم في الحديث وفي الأثر :  ، أو يكفي العزم على ألا يعود في تكفير الماضي ، بحيث لو وقع منه ذلك الذنب بعد ذلك لا يكون ذلك ضارا في تكفير ما تقدم ، لعموم قوله ، عليه السلام :  . وللأول أن يحتج بما ثبت في الصحيح أيضا :  فإذا كان هذا في الإسلام الذي هو أقوى من التوبة ، فالتوبة بطريق الأولى ، والله أعلم . وقوله : ( عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار ) و ) عسى ) من الله موجبة ، ( يوم لا يخزي الله النبي والذين آمنوا معه ) أي : ولا يخزيهم معه يعني : يوم القيامة ( نورهم يسعى بين أيديهم وبأيمانهم ) كما تقدم في سورة الحديد .( يقولون ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قدير ) قال مجاهد ، والضحاك ، والحسن البصري ، وغيرهم : هذا يقوله المؤمنون حين يرون يوم القيامة نور المنافقين قد طفئ .\nوقال محمد بن نصر المروزي : حدثنا محمد بن مقاتل المروزي ، حدثنا ابن المبارك ، أخبرنا ابن لهيعة حدثني يزيد بن أبي حبيب ، عن عبد الرحمن بن جبير بن نفير أنه سمع أبا ذر ، وأبا الدرداء قالا : قال رسول الله - صلى الله عليه وسلم - :  . فقال رجل : يا رسول الله ، وكيف تعرف أمتك من بين الأمم ؟ قال : \nوقال الإمام أحمد : حدثنا إبراهيم بن إسحاق الطالقاني ، حدثنا ابن المبارك ، عن يحيى بن حسان ، عن رجل من بني كنانة ، قال : صليت خلف رسول الله - صلى الله عليه وسلم - عام الفتح ، فسمعته يقول : "
  }, {
    "id" : 9,
    "eya" : "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ (9) ",
    "tafsir" : "( واغلظ عليهم ) أي : في الدنيا ، ( ومأواهم جهنم وبئس المصير ) أي : في الآخرة ."
  }, {
    "id" : 10,
    "eya" : "ضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ (10) ",
    "tafsir" : "( ضرب الله مثلا للذين كفروا ) أي : في مخالطتهم المسلمين ومعاشرتهم لهم ، أن ذلك لا يجدي عنهم شيئا ولا ينفعهم عند الله ، إن لم يكن الإيمان حاصلا في قلوبهم ، ثم ذكر المثل فقال : ( امرأة نوح وامرأة لوط كانتا تحت عبدين من عبادنا صالحين ) أي : نبيين رسولين عندهما في صحبتها ليلا ونهارا يؤاكلانهما ، ويضاجعانهما ، ويعاشرانهما أشد العشرة والاختلاط ( فخانتاهما ) أي : في الإيمان ، لم يوافقاهما على الإيمان ، ولا صدقاهما في الرسالة ، فلم يجد ذلك كله شيئا ، ولا دفع عنهما محذورا ; ولهذا قال : ( فلم يغنيا عنهما من الله شيئا ) أي : لكفرهما ، ( وقيل ) أي : للمرأتين : ( ادخلا النار مع الداخلين ) وليس المراد : ( فخانتاهما ) في فاحشة ، بل في الدين ، فإن نساء الأنبياء معصومات عن الوقوع في الفاحشة ; لحرمة الأنبياء ، كما قدمنا في سورة النور .\nقال سفيان الثوري ، عن موسى بن أبي عائشة ، عن سليمان بن قتة : سمعت ابن عباس يقول في هذه الآية ( فخانتاهما ) قال : ما زنتا ، أما امرأة نوح فكانت تخبر أنه مجنون ، وأما خيانة امرأة لوط فكانت تدل قومها على أضيافه .\nوقال العوفي ، عن ابن عباس قال : كانت خيانتهما أنهما كانتا على عورتيهما ، فكانت امرأة نوح تطلع على سر نوح ، فإذا آمن مع نوح أحد أخبرت الجبابرة من قوم نوح به ، وأما امرأة لوط فكانت إذا أضاف لوط أحدا أخبرت به أهل المدينة ممن يعمل السوء .\nوهكذا قال عكرمة ، وسعيد بن جبير ، والضحاك ، وغيرهم .[ وقال الضحاك ، عن ابن عباس : ما بغت امرأة نبي قط ، إنما كانت خيانتهما في الدين ]\nوقد استدل بهذه الآية الكريمة بعض العلماء على ضعف الحديث الذي يأثره كثير من الناس : من أكل مع مغفور له غفر له . وهذا الحديث لا أصل له ، وإنما يروى هذا عن بعض الصالحين أنه رأى النبي - صلى الله عليه وسلم - في المنام فقال : يا رسول الله ، أنت قلت : من أكل مع مغفور له غفر له ؟ قال : "
  }, {
    "id" : 11,
    "eya" : "وَضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ (11) ",
    "tafsir" : "( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة )[ آل عمران : 28 ]\nقال : قتادة كان فرعون أعتى أهل الأرض وأبعده ، فوالله ما ضر امرأته كفر زوجها حين أطاعت ربها لتعلموا أن الله حكم عدل ، لا يؤاخذ أحدا إلا بذنبه .\nوقال ابن جرير : حدثنا إسماعيل بن حفص الأبلي ، حدثنا محمد بن جعفر ، عن سليمان التيمي ، عن أبي عثمان النهدي ، عن سلمان قال : كانت امرأة فرعون تعذب في الشمس ، فإذا انصرف عنها أظلتها الملائكة بأجنحتها ، وكانت ترى بيتها في الجنة .\nثم رواه عن محمد بن عبيد المحاربي ، عن أسباط بن محمد ، عن سليمان التيمي ، به .\nثم قال ابن جرير : حدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، عن هشام الدستوائي ، حدثنا القاسم بن أبي بزة ، قال : كانت امرأة فرعون تسأل : من غلب ؟ فيقال : غلب موسى ، وهارون . فتقول : آمنت برب موسى ، وهارون ، فأرسل إليها فرعون ، فقال : انظروا أعظم صخرة تجدونها ، فإن مضت على قولها فألقوها عليها ، وإن رجعت عن قولها فهي امرأته ، فلما أتوها رفعت بصرها إلى السماء فأبصرت بيتها في الجنة ، فمضت على قولها ، وانتزع روحها ، وألقيت الصخرة على جسد ليس فيه روح .( رب ابن لي عندك بيتا في الجنة ) قال العلماء : اختارت الجار قبل الدار . وقد ورد شيء من ذلك في حديث مرفوع ، ( ونجني من فرعون وعمله ) أي : خلصني منه ، فإني أبرأ إليك من عمله ، ( ونجني من القوم الظالمين ) وهذه المرأة هي آسية بنت مزاحم ، رضي الله عنها .\nوقال أبو جعفر الرازي ، عن الربيع بن أنس ، عن أبي العالية قال : كان إيمان امرأة فرعون من قبل إيمان امرأة خازن فرعون ، وذلك أنها جلست تمشط ابنة فرعون ، فوقع المشط من يدها ، فقالت تعس من كفر بالله ؟ فقالت لها ابنة فرعون : ولك رب غير أبي ؟ قالت : ربي ، ورب أبيك ، ورب كل شيء الله . فلطمتها بنت فرعون وضربتها ، وأخبرت أباها ، فأرسل إليها فرعون ، فقال : تعبدين ربا غيري ؟ قالت : نعم ، ربي ، وربك ، ورب كل شيء الله . وإياه أعبد فعذبها فرعون ، وأوتد لها أوتادا ، فشد رجليها ، ويديها ، وأرسل عليها الحيات ، وكانت كذلك ، فأتى عليها يوما ، فقال لها : ما أنت منتهية ؟ فقالت له : ربي ، وربك ، ورب كل شيء الله . فقال لها : إني ذابح ابنك في فيك إن لم تفعلي . فقالت له : اقض ما أنت قاض . فذبح ابنها في فيها ، وإن روح ابنها بشرها ، فقال لها : أبشري يا أمه ، فإن لك عند الله من الثواب كذا وكذا . فصبرت ثم أتى عليها فرعون يوما آخر فقال لها مثل ذلك ، فقالت له مثل ذلك ، فذبح ابنها الآخر في فيها ، فبشرها روحه أيضا ، وقال لها . اصبري يا أمه ، فإن لك عند الله من الثواب كذا وكذا . قال : وسمعت امرأة فرعون كلام روح ابنها الأكبر ، ثم الأصغر ، فآمنت امرأة فرعون ، وقبض الله روح امرأة خازن فرعون ، وكشف الغطاء عن ثوبها ، ومنزلتها ، وكرامتها في الجنة لامرأة فرعون حتى رأت ، فازدادت إيمانا ويقينا ، وتصديقا ، فاطلع فرعون على إيمانها ، فقال للملإ ما تعلمون من آسية بنت مزاحم ؟ فأثنوا عليها ، فقال لهم : إنها تعبد غيري . فقالوا له : اقتلها . فأوتد لها أوتادا فشد يديها ورجليها ، فدعت آسية ربها فقالت : ( رب ابن لي عندك بيتا في الجنة ) فوافق ذلك أن حضرها فرعون فضحكت حين رأت بيتها في الجنة ، فقال فرعون : ألا تعجبون من جنونها ، إنا نعذبها وهي تضحك ، فقبض الله روحها ، رضي الله عنها ."
  }, {
    "id" : 12,
    "eya" : "وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ (12) ",
    "tafsir" : "( ومريم ابنت عمران التي أحصنت فرجها ) أي حفظته وصانته . والإحصان : هو العفاف والحرية ، ( فنفخنا فيه من روحنا ) أي : بواسطة الملك ، وهو جبريل فإن الله بعثه إليها فتمثل لها في صورة بشر سوي ، وأمره الله تعالى أن ينفخ بفيه في جيب درعها ، فنزلت النفخة فولجت في فرجها ، فكان منه الحمل بعيسى ، عليه السلام . ولهذا قال : ( فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه ) أي : بقدره وشرعه ( وكانت من القانتين )\nقال الإمام أحمد : حدثنا يونس ، حدثنا داود بن أبي الفرات ، عن علباء ، عن عكرمة ، عن ابن عباس قال : خط رسول الله - صلى الله عليه وسلم - في الأرض أربعة خطوط ، وقال :  قالوا : الله ورسوله أعلم ، فقال رسول الله - صلى الله عليه وسلم - : \nوثبت في الصحيحين من حديث شعبة ، عن عمرو بن مرة ، عن مرة الهمداني ، عن أبي موسى الأشعري ، عن النبي - صلى الله عليه وسلم - أنه قال : \nوقد ذكرنا طرق هذه الأحاديث ، وألفاظها ، والكلام عليها في قصة عيسى ابن مريم عليهما السلام ، في كتابنا  ولله الحمد والمنة وذكرنا ما ورد من الحديث من أنها تكون هي وآسية بنت مزاحم من أزواجه ، عليه السلام ، في الجنة عند قوله : ( ثيبات وأبكارا )\nآخر تفسير سورة التحريم ولله الحمد والمنة."
  } ]
}