{
  "id" : 82,
  "name" : "الانفِطار",
  "type" : "مكيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "إِذَا السَّمَاءُ انفَطَرَتْ (1) ",
    "tafsir" : "\nوأصل الحديث مخرج في الصحيحين ولكن ذكر  و \" إذا السماء انشقت .( إذا السماء انفطرت ) أي انشقت كما قال ( السماء منفطر به ) الزمر : 18"
  }, {
    "id" : 2,
    "eya" : "وَإِذَا الْكَوَاكِبُ انتَثَرَتْ (2) ",
    "tafsir" : ""
  }, {
    "id" : 3,
    "eya" : "وَإِذَا الْبِحَارُ فُجِّرَتْ (3) ",
    "tafsir" : "\nوقال الحسن فجر الله بعضها في بعض فذهب ماؤها وقال قتادة اختلط عذبها بمالحها وقال الكلبي ملئت."
  }, {
    "id" : 4,
    "eya" : "وَإِذَا الْقُبُورُ بُعْثِرَتْ (4) ",
    "tafsir" : "( وإذا القبور بعثرت ) قال ابن عباس بحثت وقال السدي تبعثر تحرك فيخرج من فيها ."
  }, {
    "id" : 5,
    "eya" : "عَلِمَتْ نَفْسٌ مَّا قَدَّمَتْ وَأَخَّرَتْ (5) ",
    "tafsir" : ""
  }, {
    "id" : 6,
    "eya" : "يَا أَيُّهَا الْإِنسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ (6) ",
    "tafsir" : "( يا أيها الإنسان ما غرك بربك الكريم ) ؟ : هذا تهديد لا كما يتوهمه بعض الناس من أنه إرشاد إلى الجواب حيث قال : ( الكريم ) حتى يقول قائلهم غره كرمه بل المعنى في هذه الآية ما غرك يا ابن آدم بربك الكريم - أي العظيم حتى أقدمت على معصيته وقابلته بما لا يليق كما جاء في الحديث يقول الله يوم القيامة ابن آدم ما غرك بي ابن آدم ماذا أجبت المرسلين\nقال ابن أبي حاتم حدثنا أبي ، حدثنا ابن أبي عمر حدثنا سفيان أن عمر سمع رجلا يقرأ ( يا أيها الإنسان ما غرك بربك الكريم ) فقال عمر الجهل .\nوقال أيضا حدثنا عمر بن شبة حدثنا أبو خلف حدثنا يحيى البكاء سمعت ابن عمر يقول وقرأ هذه الآية ( يا أيها الإنسان ما غرك بربك الكريم ) قال ابن عمر غره والله جهله\nقال وروي عن ابن عباس والربيع بن خثيم والحسن مثل ذلك( ما غرك بربك الكريم ) شيء ما غر ابن آدم غير هذا العدو الشيطان\nوقال الفضيل بن عياض لو قال لي ما غرك بي لقلت ستورك المرخاة\nوقال أبو بكر الوراق لو قال لي ( ما غرك بربك الكريم ) لقلت غرني كرم الكريم\nقال البغوي وقال بعض أهل الإشارة إنما قال ( بربك الكريم ) دون سائر أسمائه وصفاته كأنه لقنه الإجابة .\nوهذا الذي تخيله هذا القائل ليس بطائل لأنه إنما أتى باسمه ( الكريم ) ; لينبه على أنه لا ينبغي أن يقابل الكريم بالأفعال القبيحة وأعمال السوء\nو قد حكى البغوي عن الكلبي ومقاتل أنهما قالا نزلت هذه الآية في الأسود بن شريق ضرب النبي صلى الله عليه وسلم ولم يعاقب في الحالة الراهنة فأنزل الله ( ما غرك بربك الكريم )"
  }, {
    "id" : 7,
    "eya" : "الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ (7) ",
    "tafsir" : "( الذي خلقك فسواك فعدلك ) أي ما غرك بالرب الكريم ( الذي خلقك فسواك فعدلك ) أي جعلك سويا معتدل القامة منتصبها في أحسن الهيئات والأشكال\nقال الإمام أحمد حدثنا أبو النضر حدثنا حريز حدثني عبد الرحمن بن ميسرة عن جبير بن نفير عن بسر بن جحاش القرشي أن رسول الله صلى الله عليه وسلم بصق يوما في كفه فوضع عليها إصبعه ثم قال قال الله عز وجل ابن آدم أنى تعجزني وقد خلقتك من مثل هذه حتى إذا سويتك وعدلتك مشيت بين بردين وللأرض منك وئيد فجمعت ومنعت حتى إذا بلغت التراقي قلت أتصدق وأنى أوان الصدقة\nوكذا رواه ابن ماجه عن أبي بكر بن أبي شيبة عن يزيد بن هارون عن حريز بن عثمان به .\nقال شيخنا الحافظ أبو الحجاج المزي وتابعه يحيى بن حمزة عن ثور بن يزيد عن عبد الرحمن بن ميسرة ."
  }, {
    "id" : 8,
    "eya" : "فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ (8) ",
    "tafsir" : "( في أي صورة ما شاء ركبك ) قال مجاهد في أي شبه أب أو أم أو خال أو عم\nوقال ابن جرير حدثني محمد بن سنان القزاز حدثنا مطهر بن الهيثم حدثنا موسى بن علي بن رباح حدثني أبي عن جدي أن النبي صلى الله عليه وسلم قال له ما ولد لك قال يا رسول الله ما عسى أن يولد لي إما غلام وإما جارية قال فمن يشبه ؟ قال يا رسول الله من عسى أن يشبه إما أباه وإما أمه فقال النبي صلى الله عليه وسلم عندها : مه لا تقولن هكذا إن النطفة إذا استقرت في الرحم أحضرها الله كل نسب بينها وبين آدم أما قرأت هذه الآية في كتاب الله ( في أي صورة ما شاء ركبك ) \" قال سلكك .\nوهكذا رواه ابن أبي حاتم والطبراني من حديث مطهر بن الهيثم به وهذا الحديث لو صح لكان فيصلا في هذه الآية ولكن إسناده ليس بالثابت لأن مطهر بن الهيثم قال فيه أبو سعيد بن يونس كان متروك الحديث وقال ابن حبان يروى عن موسى بن علي وغيره ما لا يشبه حديث الأثبات ولكن في الصحيحين عن أبي هريرة أن رجلا قال يا رسول الله إن امرأتي ولدت غلاما أسود قال هل لك من إبل قال نعم . قال فما ألوانها قال حمر . قال فهل فيها من أورق قال نعم . قال فأنى أتاها ذلك ؟ قال عسى أن يكون نزعة عرق . قال وهذا عسى أن يكون نزعة عرق \"\nوقد قال عكرمة في قوله ( في أي صورة ما شاء ركبك ) إن شاء في صورة قرد وإن شاء في صورة خنزير وكذا قال أبو صالح إن شاء في صورة كلب وإن شاء في صورة حمار وإن شاء في صورة خنزير( في أي صورة ما شاء ركبك ) قال : قادر والله ربنا على ذلك ومعنى هذا القول عند هؤلاء أن الله عز وجل قادر على خلق النطفة على شكل قبيح من الحيوانات المنكرة الخلق ولكن بقدرته ولطفه وحلمه يخلقه على شكل حسن مستقيم معتدل تام حسن المنظر والهيئة ."
  }, {
    "id" : 9,
    "eya" : "كَلَّا بَلْ تُكَذِّبُونَ بِالدِّينِ (9) ",
    "tafsir" : "( كلا بل تكذبون بالدين ) أي : بل إنما يحملكم على مواجهة الكريم ومقابلته بالمعاصي تكذيب في قلوبكم بالمعاد والجزاء والحساب ."
  }, {
    "id" : 10,
    "eya" : "وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ (10) ",
    "tafsir" : "( وإن عليكم لحافظين  ) يعني وإن عليكم لملائكة حفظة"
  }, {
    "id" : 11,
    "eya" : "كِرَامًا كَاتِبِينَ (11) ",
    "tafsir" : "\nقال ابن أبي حاتم حدثنا أبي ، حدثنا علي بن محمد الطنافسي حدثنا وكيع حدثنا سفيان ومسعر عن علقمة بن مرثد عن مجاهد قال : قال رسول الله صلى الله عليه وسلم أكرموا الكرام الكاتبين الذين لا يفارقونكم إلا عند إحدى حالتين الجنابة والغائط فإذا اغتسل أحدكم فليستتر بحرم حائط أو ببعيره أو ليستره أخوه\nوقد رواه الحافظ أبو بكر البزار فوصله بلفظ آخر فقال : حدثنا محمد بن عثمان بن كرامة حدثنا عبيد الله بن موسى عن حفص بن سليمان عن علقمة بن مرثد عن مجاهد عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم إن الله ينهاكم عن التعري فاستحيوا من ملائكة الله الذين معكم الكرام الكاتبين الذين لا يفارقونكم إلا عند إحدى ثلاث حالات الغائط والجنابة ، والغسل فإذا اغتسل أحدكم بالعراء فليستتر بثوبه أو بحرم حائط أو ببعيره\nثم قال حفص بن سليمان لين الحديث وقد روي عنه واحتمل حديثه .\nوقال الحافظ أبو بكر البزار حدثنا زياد بن أيوب حدثنا مبشر بن إسماعيل الحلبي حدثنا تمام بن نجيح عن الحسن يعني البصري عن أنس قال قال رسول الله صلى الله عليه وسلم ما من حافظين يرفعان إلى الله عز وجل ما حفظا في يوم فيرى في أول الصحيفة وفي آخرها استغفار إلا قال الله تعالى قد غفرت لعبدي ما بين طرفي الصحيفة\nثم قال : تفرد به تمام بن نجيح وهو صالح الحديث .\nقلت وثقه ابن معين وضعفه البخاري وأبو زرعة وابن أبي حاتم والنسائي وابن عدي ورماه ابن حبان بالوضع . وقال الإمام أحمد لا أعرف حقيقة أمره .\nوقال الحافظ أبو بكر البزار حدثنا إسحاق بن سليمان البغدادي المعروف بالقلوسي حدثنا بيان بن حمران حدثنا سلام عن منصور بن زاذان عن محمد بن سيرين عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم إن لله ملائكة يعرفون بني آدم وأحسبه قال ويعرفون أعمالهم فإذا نظروا إلى عبد يعمل بطاعة الله ذكروه بينهم وسموه وقالوا أفلح الليلة فلان نجا الليلة فلان وإذا نظروا إلى عبد يعمل بمعصية الله وذكروه بينهم وسموه وقالوا : هلك الليلة فلان \"\nثم قال البزار سلام هذا ، أحسبه سلام المدائني وهو لين الحديث ."
  }, {
    "id" : 12,
    "eya" : "يَعْلَمُونَ مَا تَفْعَلُونَ (12) ",
    "tafsir" : "\nقال ابن أبي حاتم حدثنا أبي ، حدثنا علي بن محمد الطنافسي حدثنا وكيع حدثنا سفيان ومسعر عن علقمة بن مرثد عن مجاهد قال : قال رسول الله صلى الله عليه وسلم أكرموا الكرام الكاتبين الذين لا يفارقونكم إلا عند إحدى حالتين الجنابة والغائط فإذا اغتسل أحدكم فليستتر بحرم حائط أو ببعيره أو ليستره أخوه\nوقد رواه الحافظ أبو بكر البزار فوصله بلفظ آخر فقال : حدثنا محمد بن عثمان بن كرامة حدثنا عبيد الله بن موسى عن حفص بن سليمان عن علقمة بن مرثد عن مجاهد عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم إن الله ينهاكم عن التعري فاستحيوا من ملائكة الله الذين معكم الكرام الكاتبين الذين لا يفارقونكم إلا عند إحدى ثلاث حالات الغائط والجنابة ، والغسل فإذا اغتسل أحدكم بالعراء فليستتر بثوبه أو بحرم حائط أو ببعيره\nثم قال حفص بن سليمان لين الحديث وقد روي عنه واحتمل حديثه .\nوقال الحافظ أبو بكر البزار حدثنا زياد بن أيوب حدثنا مبشر بن إسماعيل الحلبي حدثنا تمام بن نجيح عن الحسن يعني البصري عن أنس قال قال رسول الله صلى الله عليه وسلم ما من حافظين يرفعان إلى الله عز وجل ما حفظا في يوم فيرى في أول الصحيفة وفي آخرها استغفار إلا قال الله تعالى قد غفرت لعبدي ما بين طرفي الصحيفة\nثم قال : تفرد به تمام بن نجيح وهو صالح الحديث .\nقلت وثقه ابن معين وضعفه البخاري وأبو زرعة وابن أبي حاتم والنسائي وابن عدي ورماه ابن حبان بالوضع . وقال الإمام أحمد لا أعرف حقيقة أمره .\nوقال الحافظ أبو بكر البزار حدثنا إسحاق بن سليمان البغدادي المعروف بالقلوسي حدثنا بيان بن حمران حدثنا سلام عن منصور بن زاذان عن محمد بن سيرين عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم إن لله ملائكة يعرفون بني آدم وأحسبه قال ويعرفون أعمالهم فإذا نظروا إلى عبد يعمل بطاعة الله ذكروه بينهم وسموه وقالوا أفلح الليلة فلان نجا الليلة فلان وإذا نظروا إلى عبد يعمل بمعصية الله وذكروه بينهم وسموه وقالوا : هلك الليلة فلان \"\nثم قال البزار سلام هذا ، أحسبه سلام المدائني وهو لين الحديث ."
  }, {
    "id" : 13,
    "eya" : "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ (13) ",
    "tafsir" : "\nوقد روى ابن عساكر في ترجمة موسى بن محمد عن هشام بن عمار عن عيسى بن يونس بن أبي إسحاق عن عبيد الله عن محارب عن ابن عمر عن النبي صلى الله عليه وسلم - قال إنما سماهم الله الأبرار لأنهم بروا الآباء والأبناء ."
  }, {
    "id" : 14,
    "eya" : "وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ (14) ",
    "tafsir" : ""
  }, {
    "id" : 15,
    "eya" : "يَصْلَوْنَهَا يَوْمَ الدِّينِ (15) ",
    "tafsir" : ""
  }, {
    "id" : 16,
    "eya" : "وَمَا هُمْ عَنْهَا بِغَائِبِينَ (16) ",
    "tafsir" : ""
  }, {
    "id" : 17,
    "eya" : "وَمَا أَدْرَاكَ مَا يَوْمُ الدِّينِ (17) ",
    "tafsir" : ""
  }, {
    "id" : 18,
    "eya" : "ثُمَّ مَا أَدْرَاكَ مَا يَوْمُ الدِّينِ (18) ",
    "tafsir" : ""
  }, {
    "id" : 19,
    "eya" : "يَوْمَ لَا تَمْلِكُ نَفْسٌ لِّنَفْسٍ شَيْئًا ۖ وَالْأَمْرُ يَوْمَئِذٍ لِّلَّهِ (19) ",
    "tafsir" : "( يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله ) أي : لا يقدر واحد على نفع أحد ولا خلاصه مما هو فيه إلا أن يأذن الله لمن يشاء ويرضى\nونذكر هاهنا حديث يا بني هاشم أنقذوا أنفسكم من النار لا أملك لكم من الله شيئا وقد تقدم في آخر تفسير سورة الشعراء ولهذا قال ( والأمر يومئذ لله )( لمن الملك اليوم لله الواحد القهار ) غافر 16 وكقوله ( الملك يومئذ الحق للرحمن ) الفرقان : 26 وكقوله ( مالك يوم الدين ) الفاتحة : 4\nقال قتادة : ( يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله والأمر والله اليوم لله ولكنه يومئذ لا ينازعه أحد\nآخر تفسير سورة الانفطار ولله الحمد"
  } ]
}