{
  "id" : 83,
  "name" : "المطفِّفِين",
  "type" : "مكيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "وَيْلٌ لِّلْمُطَفِّفِينَ (1) ",
    "tafsir" : "\nقال النسائي وابن ماجه أخبرنا محمد بن عقيل زاد ابن ماجه وعبد الرحمن بن بشر قالا حدثنا علي بن الحسين بن واقد حدثني أبي عن يزيد هو ابن أبي سعيد النحوي مولى قريش عن عكرمة عن ابن عباس قال لما قدم نبي الله صلى الله عليه وسلم المدينة كانوا من أخبث الناس كيلا فأنزل الله ( ويل للمطففين ) فحسنوا الكيل بعد ذلك .\nوقال ابن أبي حاتم حدثنا جعفر بن النضر بن حماد حدثنا محمد بن عبيد عن الأعمش عن عمرو بن مرة عن عبد الله بن الحارث عن هلال بن طلق قال بينا أنا أسير مع ابن عمر فقلت من أحسن الناس هيئة وأوفاه كيلا أهل مكة أو المدينة قال حق لهم أما سمعت الله يقول ( ويل للمطففين )\nوقال ابن جرير حدثنا أبو السائب حدثنا ابن فضيل عن ضرار عن عبد الله المكتب عن رجل عن عبد الله قال قال له رجل يا أبا عبد الرحمن إن أهل المدينة ليوفون الكيل . قال وما يمنعهم أن يوفوا الكيل وقد قال الله عز وجل ( ويل للمطففين )( يوم يقوم الناس لرب العالمين )\nفالمراد بالتطفيف هاهنا البخس في المكيال والميزان إما بالازدياد إن اقتضى من الناس وإما بالنقصان إن قضاهم"
  }, {
    "id" : 2,
    "eya" : "الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ (2) ",
    "tafsir" : " أي من الناس  أي يأخذون حقهم بالوافي والزائد."
  }, {
    "id" : 3,
    "eya" : "وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ (3) ",
    "tafsir" : " وزنوا ويحذف المفعول لدلالة الكلام عليه وكلاهما متقارب\nوقد أمر الله تعالى بالوفاء في الكيل والميزان فقال ( وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم ذلك خير وأحسن تأويلا ) الإسراء 35 وقال ( وأوفوا الكيل والميزان بالقسط لا نكلف نفسا إلا وسعها ) الأنعام 152 وقال ( وأقيموا الوزن بالقسط ولا تخسروا الميزان ) الرحمن : 9 وأهلك الله قوم شعيب ودمرهم على ما كانوا يبخسون الناس في المكيال والميزان ."
  }, {
    "id" : 4,
    "eya" : "أَلَا يَظُنُّ أُولَٰئِكَ أَنَّهُم مَّبْعُوثُونَ (4) ",
    "tafsir" : ""
  }, {
    "id" : 5,
    "eya" : "لِيَوْمٍ عَظِيمٍ (5) ",
    "tafsir" : ""
  }, {
    "id" : 6,
    "eya" : "يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ (6) ",
    "tafsir" : "( يوم يقوم الناس لرب العالمين ) أي يقومون حفاة عراة غرلا في موقف صعب حرج ضيق ضنك على المجرم ويغشاهم من أمر الله ما تعجز القوى والحواس عنه\nقال الإمام مالك عن نافع عن ابن عمر أن النبي صلى الله عليه وسلم قال : \" ( يوم يقوم الناس لرب العالمين ) حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه\nرواه البخاري من حديث مالك وعبد الله بن عون كلاهما عن نافع به . ورواه مسلم من الطريقين أيضا وكذلك رواه صالح وثابت بن كيسان وأيوب بن يحيى وعبد الله وعبيد الله ابنا عمر ومحمد بن إسحاق عن نافع عن ابن عمر به .\nولفظ الإمام أحمد حدثنا يزيد أخبرنا ابن إسحاق عن نافع عن ابن عمر سمعت رسول الله صلى الله عليه وسلم يقول : ) يوم يقوم الناس لرب العالمين ) لعظمة الرحمن عز وجل يوم القيامة حتى إن العرق ليلجم الرجال إلى أنصاف آذانهم \"\nحديث آخر قال الإمام أحمد حدثنا إبراهيم بن إسحاق حدثنا ابن المبارك عن عبد الرحمن بن يزيد بن جابر حدثني سليم بن عامر حدثني المقداد يعني ابن الأسود الكندي قال سمعت رسول الله صلى الله عليه وسلم - يقول إذا كان يوم القيامة أدنيت الشمس من العباد حتى تكون قيد ميل أو ميلين قال فتصهرهم الشمس فيكونون في العرق كقدر أعمالهم منهم من يأخذه إلى عقبيه ومنهم من يأخذه إلى ركبتيه ومنهم من يأخذه إلى حقويه ومنهم من يلجمه إلجاما\nرواه مسلم عن الحكم بن موسى عن يحيى بن حمزة والترمذي عن سويد عن ابن المبارك كلاهما عن ابن جابر به .\nحديث آخر قال الإمام أحمد حدثنا الحسن بن سوار حدثنا الليث بن سعد عن معاوية بن صالح أن أبا عبد الرحمن حدثه ، عن أبي أمامة أن رسول الله صلى الله عليه وسلم - قال تدنو الشمس يوم القيامة على قدر ميل ويزاد في حرها كذا وكذا تغلي منها الهوام كما تغلي القدور يعرقون فيها على قدر خطاياهم منهم من يبلغ إلى كعبيه ومنهم من يبلغ إلى ساقيه ومنهم من يبلغ إلى وسطه ومنهم من يلجمه العرق انفرد به أحمد .\nحديث آخر قال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو عشانة حي بن يؤمن أنه سمع عقبة بن عامر يقول سمعت رسول صلى الله عليه وسلم - يقول تدنو الشمس من الأرض فيعرق الناس فمن الناس من يبلغ عرقه عقبيه ومنهم من يبلغ إلى نصف الساق ومنهم من يبلغ إلى ركبتيه ومنهم من يبلغ العجز ومنهم من يبلغ الخاصرة ومنهم من يبلغ منكبيه ومنهم من يبلغ وسط فيه وأشار بيده فألجمها فاه رأيت رسول الله صلى الله عليه وسلم يشير هكذا ومنهم من يغطيه عرقه وضرب بيده إشارة انفرد به أحمد .\nوفي حديث أنهم يقومون سبعين سنة لا يتكلمون وقيل يقومون ثلاثمائة سنة وقيل يقومون أربعين ألف سنة ويقضى بينهم في مقدار عشرة آلاف سنة كما في صحيح مسلم عن أبي هريرة مرفوعا : في يوم كان مقداره خمسين ألف سنة \"\nوقد قال ابن أبي حاتم حدثنا أبي ، حدثنا أبو عون الزيادي أخبرنا عبد السلام بن عجلان سمعت أبا يزيد المدني عن أبي هريرة قال قال النبي صلى الله عليه وسلم لبشير الغفاري كيف أنت صانع في يوم يقوم الناس فيه ثلاثمائة سنة لرب العالمين من أيام الدنيا لا يأتيهم فيه خبر من السماء ولا يؤمر فيه بأمر قال بشير المستعان الله . قال فإذا أويت إلى فراشك فتعوذ بالله من كرب يوم القيامة وسوء الحساب\nورواه ابن جرير من طريق عبد السلام به .\nوفي سنن أبي داود أن رسول الله صلى الله عليه وسلم كان يتعوذ بالله من ضيق المقام يوم القيامة .\nوعن ابن مسعود يقومون أربعين سنة رافعي رءوسهم إلى السماء لا يكلمهم أحد قد ألجم العرق برهم وفاجرهم\nوعن ابن عمر يقومون مائة سنة رواهما ابن جرير .\nوفي سنن أبي داود والنسائي وابن ماجه من حديث زيد بن الحباب عن معاوية بن\nصالح عن أزهر بن سعيد الحواري عن عاصم بن حميد عن عائشة أن رسول الله صلى الله عليه وسلم كان يفتتح قيام الليل يكبر عشرا ويحمد عشرا ويسبح عشرا ويستغفر عشرا ، ويقول اللهم اغفر لي واهدني وارزقني وعافني ويتعوذ من ضيق المقام يوم القيامة ."
  }, {
    "id" : 7,
    "eya" : "كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ (7) ",
    "tafsir" : "أي أن مصيرهم ومأواهم لفي سجين فعيل من السجن وهو الضيق كما يقال فسيق وشريب وخمير وسكير ونحو ذلك."
  }, {
    "id" : 8,
    "eya" : "وَمَا أَدْرَاكَ مَا سِجِّينٌ (8) ",
    "tafsir" : "( وما أدراك ما سجين ) ؟ أي هو أمر عظيم وسجن مقيم وعذاب أليم\nثم قد قال قائلون هي تحت الأرض السابعة وقد تقدم في حديث البراء بن عازب في حديثه الطويل يقول الله عز وجل في روح الكافر اكتبوا كتابه في سجين\nوسجين هي تحت الأرض السابعة وقيل صخرة تحت السابعة خضراء وقيل بئر في جهنم\nوقد روى ابن جرير في ذلك حديثا غريبا منكرا لا يصح فقال حدثنا إسحاق بن وهب الواسطي حدثنا مسعود بن موسى بن مشكان الواسطي حدثنا نصر بن خزيمة الواسطي عن شعيب بن صفوان عن محمد بن كعب القرظي عن أبي هريرة عن النبي صلى الله عليه وسلم قال : الفلق جب في جهنم مغطى وأما سجين فمفتوح \"\nوالصحيح أن سجينا مأخوذ من السجن وهو الضيق فإن المخلوقات كل ما تسافل منها ضاق وكل ما تعالى منها اتسع فإن الأفلاك السبعة كل واحد منها أوسع وأعلى من الذي دونه وكذلك الأرضون كل واحدة أوسع من التي دونها حتى ينتهي السفول المطلق والمحل الأضيق إلى المركز في وسط الأرض السابعة ولما كان مصير الفجار إلى جهنم وهي أسفل السافلين كما قال تعالى ( ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات ) التين 5 ، 6 وقال هاهنا ( كلا إن كتاب الفجار لفي سجين وما أدراك ما سجين ) وهو يجمع الضيق والسفول كما قال ) وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا ) الفرقان : 13"
  }, {
    "id" : 9,
    "eya" : "كِتَابٌ مَّرْقُومٌ (9) ",
    "tafsir" : "( كتاب مرقوم ) ليس تفسيرا لقوله ( وما أدراك ما سجين ) وإنما هو تفسير لما كتب لهم من المصير إلى سجين أي مرقوم مكتوب مفروغ منه لا يزاد فيه أحد ولا ينقص منه أحد قاله محمد بن كعب القرظي"
  }, {
    "id" : 10,
    "eya" : "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (10) ",
    "tafsir" : "( ويل يومئذ للمكذبين ) أي إذا صاروا يوم القيامة إلى ما أوعدهم الله من السجن والعذاب المهين وقد تقدم الكلام على قوله : ( ويل ) بما أغنى عن إعادته وأن المراد من ذلك الهلاك والدمار كما يقال ويل لفلان وكما جاء في المسند والسنن من رواية بهز بن حكيم بن معاوية بن حيدة عن أبيه عن جده قال قال رسول الله صلى الله عليه وسلم ويل للذي يحدث فيكذب ليضحك الناس ويل له ويل له \""
  }, {
    "id" : 11,
    "eya" : "الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ (11) ",
    "tafsir" : ""
  }, {
    "id" : 12,
    "eya" : "وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ (12) ",
    "tafsir" : ""
  }, {
    "id" : 13,
    "eya" : "إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ (13) ",
    "tafsir" : "( إذا تتلى عليه آياتنا قال أساطير الأولين ) أي إذا سمع كلام الله من الرسول يكذب به ويظن به ظن السوء فيعتقد أنه مفتعل مجموع من كتب الأوائل كما قال تعالى ( وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين ) النحل 24 وقال ( وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا ) الفرقان : 5"
  }, {
    "id" : 14,
    "eya" : "كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا يَكْسِبُونَ (14) ",
    "tafsir" : "( كلا بل ران على قلوبهم ما كانوا يكسبون ) أي ليس الأمر كما زعموا ولا كما قالوا إن هذا القرآن أساطير الأولين بل هو كلام الله ووحيه وتنزيله على رسوله صلى الله عليه وسلم وإنما حجب قلوبهم عن الإيمان به ما عليها من الرين الذي قد لبس قلوبهم من كثرة الذنوب والخطايا ولهذا قال تعالى ( كلا بل ران على قلوبهم ما كانوا يكسبون ) والرين يعتري قلوب الكافرين والغيم للأبرار والغين للمقربين\nوقد روى ابن جرير والترمذي والنسائي وابن ماجه من طرق عن محمد بن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم قال إن العبد إذا أذنب ذنبا كانت نكتة سوداء في قلبه فإن تاب منها صقل قلبه وإن زاد زادت فذلك قول الله ( كلا بل ران على قلوبهم ما كانوا يكسبون )\nوقال الترمذي حسن صحيح ولفظ النسائي إن العبد إذا أخطأ خطيئة نكت في قلبه نكتة فإن هو نزع واستغفر وتاب صقل قلبه فإن عاد زيد فيها حتى تعلو قلبه فهو الران الذي قال الله ( كلا بل ران على قلوبهم ما كانوا يكسبون )\nوقال أحمد : حدثنا صفوان بن عيسى أخبرنا ابن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم إن المؤمن إذا أذنب كانت نكتة سوداء في قلبه فإن تاب ونزع واستغفر صقل قلبه فإن زاد زادت حتى تعلو قلبه وذاك الران الذي ذكر الله في القرآن ( كلا بل ران على قلوبهم ما كانوا يكسبون )\nوقال الحسن البصري : هو الذنب على الذنب حتى يعمى القلب فيموت وكذا قال مجاهد بن جبر وقتادة وابن زيد وغيرهم ."
  }, {
    "id" : 15,
    "eya" : "كَلَّا إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ (15) ",
    "tafsir" : "( كلا إنهم عن ربهم يومئذ لمحجوبون ) أي لهم يوم القيامة منزل ونزل سجين ثم هم يوم القيامة مع ذلك محجوبون عن رؤية ربهم وخالقهم\nقال الإمام أبو عبد الله الشافعي في هذه الآية دليل على أن المؤمنين يرونه عز وجل يومئذ .\nوهذا الذي قاله الإمام الشافعي رحمه الله في غاية الحسن وهو استدلال بمفهوم هذه الآية كما دل عليه منطوق قوله ( وجوه يومئذ ناضرة إلى ربها ناظرة ) القيامة 22 ، 23 وكما دلت على ذلك الأحاديث الصحاح المتواترة في رؤية المؤمنين ربهم عز وجل في الدار الآخرة رؤية بالأبصار في عرصات القيامة وفي روضات الجنان الفاخرة\nوقد قال ابن جرير محمد بن عمار الرازي : حدثنا أبو معمر المنقري حدثنا عبد الوارث بن سعيد عن عمرو بن عبيد عن الحسن في قوله ( كلا إنهم عن ربهم يومئذ لمحجوبون ) قال يكشف الحجاب فينظر إليه المؤمنون والكافرون ثم يحجب عنه الكافرون وينظر إليه المؤمنون كل يوم غدوة وعشية أو كلاما هذا معناه"
  }, {
    "id" : 16,
    "eya" : "ثُمَّ إِنَّهُمْ لَصَالُو الْجَحِيمِ (16) ",
    "tafsir" : "( ثم إنهم لصالو الجحيم ) أي ثم هم مع هذا الحرمان عن رؤية الرحمن من أهل النيران"
  }, {
    "id" : 17,
    "eya" : "ثُمَّ يُقَالُ هَٰذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ (17) ",
    "tafsir" : "( ثم يقال هذا الذي كنتم به تكذبون ) أي يقال لهم ذلك على وجه التقريع والتوبيخ والتصغير والتحقير ."
  }, {
    "id" : 18,
    "eya" : "كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ (18) ",
    "tafsir" : "( إن كتاب الأبرار ) وهم بخلاف الفجار ( لفي عليين ) أي مصيرهم إلى عليين وهو بخلاف سجين\nقال الأعمش عن شمر بن عطية عن هلال بن يساف قال : سأل ابن عباس كعبا وأنا حاضر عن سجين قال هي الأرض السابعة وفيها أرواح الكفار وسأله عن عليين فقال هي السماء السابعة وفيها أرواح المؤمنين وهكذا قال غير واحد إنها السماء السابعة\nوقال علي بن أبي طلحة عن ابن عباس في قوله ( كلا إن كتاب الأبرار لفي عليين ) يعني الجنة\nوفي رواية العوفي عنه أعمالهم في السماء عند الله وكذا قال الضحاك\nوقال قتادة عليون ساق العرش اليمنى وقال غيره عليون عند سدرة المنتهى\nوالظاهر أن عليين مأخوذ من العلو وكلما علا الشيء وارتفع عظم واتسع"
  }, {
    "id" : 19,
    "eya" : "وَمَا أَدْرَاكَ مَا عِلِّيُّونَ (19) ",
    "tafsir" : "( وما أدراك ما عليون )"
  }, {
    "id" : 20,
    "eya" : "كِتَابٌ مَّرْقُومٌ (20) ",
    "tafsir" : "( كتاب مرقوم )"
  }, {
    "id" : 21,
    "eya" : "يَشْهَدُهُ الْمُقَرَّبُونَ (21) ",
    "tafsir" : "\nوقال العوفي عن ابن عباس يشهده من كل سماء مقربوها ."
  }, {
    "id" : 22,
    "eya" : "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ (22) ",
    "tafsir" : ""
  }, {
    "id" : 23,
    "eya" : "عَلَى الْأَرَائِكِ يَنظُرُونَ (23) ",
    "tafsir" : "( على الأرائك ) وهي السرر تحت الحجال ، ( ينظرون ) قيل : معناه ينظرون في ملكهم وما أعطاهم الله من الخير والفضل الذي لا ينقضي ولا يبيد وقيل معناه ( على الأرائك ينظرون ) إلى الله عز وجل وهذا مقابلة لما وصف به أولئك الفجار ( كلا إنهم عن ربهم يومئذ لمحجوبون ) فذكر عن هؤلاء أنهم يباحون النظر إلى الله عز وجل وهم على سررهم وفرشهم كما تقدم في حديث ابن عمر إن أدنى أهل الجنة منزلة لمن ينظر في ملكه مسيرة ألفي سنة يرى أقصاه كما يرى أدناه وإن أعلاه لمن ينظر إلى الله في اليوم مرتين \""
  }, {
    "id" : 24,
    "eya" : "تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ (24) ",
    "tafsir" : ""
  }, {
    "id" : 25,
    "eya" : "يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ (25) ",
    "tafsir" : "( يسقون من رحيق مختوم ) أي يسقون من خمر من الجنة والرحيق من أسماء الخمر قاله ابن مسعود وابن عباس ومجاهد والحسن وقتادة وابن زيد\nقال الإمام أحمد حدثنا حسن حدثنا زهير عن سعد أبي المجاهد الطائي عن عطية بن سعد العوفي عن أبي سعيد الخدري أراه قد رفعه إلى النبي صلى الله عليه وسلم قال أيما مؤمن سقى مؤمنا شربة على ظمأ سقاه الله تعالى يوم القيامة من الرحيق المختوم وأيما مؤمن أطعم مؤمنا على جوع أطعمه الله من ثمار الجنة وأيما مؤمن كسا مؤمنا ثوبا على عري كساه الله من خضر الجنة \""
  }, {
    "id" : 26,
    "eya" : "خِتَامُهُ مِسْكٌ ۚ وَفِي ذَٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ (26) ",
    "tafsir" : "( ختامه مسك ) أي خلطه مسك\nوقال العوفي عن ابن عباس طيب الله لهم الخمر فكان آخر شيء جعل فيها مسك ختم بمسك وكذا قال قتادة والضحاك\nوقال إبراهيم والحسن ( ختامه مسك ) أي عاقبته مسك\nوقال ابن جرير حدثنا ابن حميد حدثنا يحيى بن واضح حدثنا أبو حمزة عن جابر عن عبد الرحمن بن سابط عن أبي الدرداء ( ختامه مسك ) قال شراب أبيض مثل الفضة يختمون به شرابهم ولو أن رجلا من أهل الدنيا أدخل أصبعه فيه ثم أخرجها لم يبق ذو روح إلا وجد طيبها .\nوقال ابن أبي نجيح عن مجاهد ( ختامه مسك ) قال طيبه مسك( وفي ذلك فليتنافس المتنافسون ) أي وفي مثل هذا الحال فليتفاخر المتفاخرون ، وليتباه ويكاثر ويستبق إلى مثله المستبقون كقوله ( لمثل هذا فليعمل العاملون ) الصافات : 61"
  }, {
    "id" : 27,
    "eya" : "وَمِزَاجُهُ مِن تَسْنِيمٍ (27) ",
    "tafsir" : ""
  }, {
    "id" : 28,
    "eya" : "عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ (28) ",
    "tafsir" : ""
  }, {
    "id" : 29,
    "eya" : "إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ (29) ",
    "tafsir" : ""
  }, {
    "id" : 30,
    "eya" : "وَإِذَا مَرُّوا بِهِمْ يَتَغَامَزُونَ (30) ",
    "tafsir" : ""
  }, {
    "id" : 31,
    "eya" : "وَإِذَا انقَلَبُوا إِلَىٰ أَهْلِهِمُ انقَلَبُوا فَكِهِينَ (31) ",
    "tafsir" : ""
  }, {
    "id" : 32,
    "eya" : "وَإِذَا رَأَوْهُمْ قَالُوا إِنَّ هَٰؤُلَاءِ لَضَالُّونَ (32) ",
    "tafsir" : ""
  }, {
    "id" : 33,
    "eya" : "وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ (33) ",
    "tafsir" : "( وما أرسلوا عليهم حافظين ) أي وما بعث هؤلاء المجرمون حافظين على هؤلاء المؤمنين ما يصدر من أعمالهم وأقوالهم ولا كلفوا بهم فلم اشتغلوا بهم وجعلوهم نصب أعينهم كما قال تعالى ( قال اخسئوا فيها ولا تكلمون إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين فاتخذتموهم سخريا حتى أنسوكم ذكري وكنتم منهم تضحكون إني جزيتهم اليوم بما صبروا أنهم هم الفائزون ) المؤمنون 108 - 111"
  }, {
    "id" : 34,
    "eya" : "فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ (34) ",
    "tafsir" : " يعني يوم القيامة  أي في مقابلة ما ضحك بهم أولئك."
  }, {
    "id" : 35,
    "eya" : "عَلَى الْأَرَائِكِ يَنظُرُونَ (35) ",
    "tafsir" : ""
  }, {
    "id" : 36,
    "eya" : "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ (36) ",
    "tafsir" : "\nآخر تفسير سورة المطففين ولله الحمد والمنة."
  } ]
}