{
  "id" : 84,
  "name" : "الانْشِقَاق",
  "type" : "مكيَّة",
  "ayets" : [ {
    "id" : 1,
    "eya" : "إِذَا السَّمَاءُ انشَقَّتْ (1) ",
    "tafsir" : "\nقال مالك عن عبد الله بن يزيد عن أبي سلمة أن أبا هريرة قرأ بهم : ( إذا السماء انشقت \" فسجد فيها فلما انصرف أخبرهم أن رسول الله صلى الله عليه وسلم سجد فيها رواه مسلم والنسائي من طريق مالك به\nوقال البخاري حدثنا أبو النعمان حدثنا معتمر عن أبيه عن بكر عن أبي رافع قال صليت مع أبي هريرة العتمة فقرأ : ( إذا السماء انشقت \" فسجد فقلت له قال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه\nورواه أيضا عن مسدد عن معتمر به ثم رواه عن مسدد عن يزيد بن زريع عن التيمي عن بكر عن أبي رافع فذكره وأخرجه مسلم وأبو داود والنسائي من طرق ، عن سليمان بن طرخان التيمي به وقد روى مسلم وأهل السنن من حديث سفيان بن عيينة زاد النسائي وسفيان الثوري كلاهما عن أيوب بن موسى عن عطاء بن ميناء عن أبي هريرة قال سجدنا مع رسول الله صلى الله عليه وسلم في  و \" اقرأ باسم ربك الذي خلق .( إذا السماء انشقت ) وذلك يوم القيامة"
  }, {
    "id" : 2,
    "eya" : "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (2) ",
    "tafsir" : "( وأذنت لربها ) أي استمعت لربها وأطاعت أمره فيما أمرها به من الانشقاق ( وحقت ) أي وحق لها أن تطيع أمره لأنه العظيم الذي لا يمانع ولا يغالب بل قد قهر كل شيء وذل له كل شيء"
  }, {
    "id" : 3,
    "eya" : "وَإِذَا الْأَرْضُ مُدَّتْ (3) ",
    "tafsir" : "( وإذا الأرض مدت ) أي بسطت وفرشت ووسعت\nقال ابن جرير رحمه الله : حدثنا ابن عبد الأعلى حدثنا ابن ثور عن معمر عن الزهري عن علي بن الحسين أن النبي صلى الله عليه وسلم قال : إذا كان يوم القيامة مد الله الأرض مد الأديم حتى لا يكون لبشر من الناس إلا موضع قدميه فأكون أول من يدعى وجبريل عن يمين الرحمن والله ما رآه قبلها فأقول يا رب إن هذا أخبرني أنك أرسلته إلي فيقول الله عز وجل - صدق ثم أشفع فأقول يا رب عبادك عبدوك في أطراف الأرض قال وهو المقام المحمود \""
  }, {
    "id" : 4,
    "eya" : "وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ (4) ",
    "tafsir" : "( وألقت ما فيها وتخلت ) أي ألقت ما في بطنها من الأموات وتخلت منهم قاله مجاهد وسعيد وقتادة"
  }, {
    "id" : 5,
    "eya" : "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (5) ",
    "tafsir" : ""
  }, {
    "id" : 6,
    "eya" : "يَا أَيُّهَا الْإِنسَانُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ (6) ",
    "tafsir" : "( يا أيها الإنسان إنك كادح إلى ربك كدحا ) أي : ساع إلى ربك سعيا وعامل عملا ( فملاقيه ) ثم إنك ستلقى ما عملت من خير أو شر ويشهد له ما رواه أبو داود الطيالسي عن الحسن بن أبي جعفر عن أبي الزبير عن جابر قال قال رسول الله صلى الله عليه وسلم قال جبريل يا محمد عش ما شئت فإنك ميت وأحبب ما شئت فإنك مفارقه واعمل ما شئت فإنك ملاقيه\nومن الناس من يعيد الضمير على قوله ( ربك ) أي فملاق ربك ومعناه فيجازيك بعملك ويكافئك على سعيك وعلى هذا فكلا القولين متلازم\nقال العوفي عن ابن عباس ( يا أيها الإنسان إنك كادح إلى ربك كدحا ) يقول تعمل عملا تلقى الله به خيرا كان أو شرا( يا أيها الإنسان إنك كادح إلى ربك كدحا ) إن كدحك يا ابن آدم لضعيف فمن استطاع أن يكون كدحه في طاعة الله فليفعل ولا قوة إلا بالله"
  }, {
    "id" : 7,
    "eya" : "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ (7) ",
    "tafsir" : ""
  }, {
    "id" : 8,
    "eya" : "فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا (8) ",
    "tafsir" : "( فسوف يحاسب حسابا يسيرا ) أي سهلا بلا تعسير ، أي لا يحقق عليه جميع دقائق أعماله فإن من حوسب كذلك يهلك لا محالة .\nقال الإمام أحمد حدثنا إسماعيل أخبرنا أيوب عن عبد الله بن أبي مليكة عن عائشة قالت قال رسول الله صلى الله عليه وسلم من نوقش الحساب عذب قالت : فقلت أليس قال الله ( فسوف يحاسب حسابا يسيرا ) ؟ ، قال ليس ذاك بالحساب ولكن ذلك العرض من نوقش الحساب يوم القيامة عذب\nوهكذا رواه البخاري ومسلم والترمذي والنسائي وابن جرير من حديث أيوب السختياني به\nوقال ابن جرير حدثنا ابن وكيع حدثنا روح بن عبادة حدثنا أبو عامر الخراز عن ابن أبي مليكة عن عائشة قالت قال رسول الله صلى الله عليه وسلم إنه ليس أحد يحاسب يوم القيامة إلا معذبا فقلت أليس الله يقول ( فسوف يحاسب حسابا يسيرا ) ؟ ، قال ذاك العرض إنه من نوقش الحساب عذب وقال بيده على إصبعه كأنه ينكت\nوقد رواه أيضا عن عمرو بن علي عن ابن أبي عدي عن أبي يونس القشيري عن ابن أبي مليكة عن القاسم عن عائشة فذكر الحديث أخرجاه من طريق أبي يونس القشيري واسمه حاتم بن أبي صغيرة به .\nقال ابن جرير حدثنا نصر بن علي الجهضمي حدثنا مسلم عن الحريش بن الخريت أخي الزبير عن ابن أبي مليكة عن عائشة قالت من نوقش الحساب أو من حوسب عذب . قال ثم قالت إنما الحساب اليسير عرض على الله عز وجل وهو يراهم .\nوقال أحمد حدثنا إسماعيل حدثنا محمد بن إسحاق حدثني عبد الواحد بن حمزة بن عبد الله بن الزبير عن عباد بن عبد الله بن الزبير عن عائشة قالت سمعت رسول الله صلى الله عليه وسلم يقول في بعض صلاته اللهم حاسبني حسابا يسيرا فلما انصرف قلت يا رسول الله ما الحساب اليسير ؟ قال أن ينظر في كتابه فيتجاوز له عنه إنه من نوقش الحساب يا عائشة يومئذ هلك صحيح على شرط مسلم ."
  }, {
    "id" : 9,
    "eya" : "وَيَنقَلِبُ إِلَىٰ أَهْلِهِ مَسْرُورًا (9) ",
    "tafsir" : "\nوقد روى الطبراني عن ثوبان مولى رسول الله صلى الله عليه وسلم أنه قال "
  }, {
    "id" : 10,
    "eya" : "وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ (10) ",
    "tafsir" : ""
  }, {
    "id" : 11,
    "eya" : "فَسَوْفَ يَدْعُو ثُبُورًا (11) ",
    "tafsir" : ""
  }, {
    "id" : 12,
    "eya" : "وَيَصْلَىٰ سَعِيرًا (12) ",
    "tafsir" : ""
  }, {
    "id" : 13,
    "eya" : "إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا (13) ",
    "tafsir" : ""
  }, {
    "id" : 14,
    "eya" : "إِنَّهُ ظَنَّ أَن لَّن يَحُورَ (14) ",
    "tafsir" : ""
  }, {
    "id" : 15,
    "eya" : "بَلَىٰ إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا (15) ",
    "tafsir" : "(كان به بصيرا) أي عليما خبيرا."
  }, {
    "id" : 16,
    "eya" : "فَلَا أُقْسِمُ بِالشَّفَقِ (16) ",
    "tafsir" : "\nوقال عبد الرزاق عن معمر عن ابن خثيم عن ابن لبيبة عن أبي هريرة قال الشفق : البياض .\nفالشفق هو حمرة الأفق إما قبل طلوع الشمس كما قاله مجاهد وإما بعد غروبها كما هو معروف عند أهل اللغة\nقال الخليل بن أحمد الشفق الحمرة من غروب الشمس إلى وقت العشاء الآخرة فإذا ذهب قيل غاب الشفق\nوقال الجوهري الشفق بقية ضوء الشمس وحمرتها في أول الليل إلى قريب من العتمة وكذا قال عكرمة الشفق الذي يكون بين المغرب والعشاء\nوفي صحيح مسلم عن عبد الله بن عمرو عن رسول الله صلى الله عليه وسلم أنه قال وقت المغرب ما لم يغب الشفق .\nففي هذا كله دليل على أن الشفق هو كما قاله الجوهري والخليل ولكن صح عن مجاهد أنه قال في هذه الآية ( فلا أقسم بالشفق ) هو النهار كله وفي رواية عنه أيضا أنه قال الشفق الشمس . رواهما ابن أبي حاتم"
  }, {
    "id" : 17,
    "eya" : "وَاللَّيْلِ وَمَا وَسَقَ (17) ",
    "tafsir" : "( والليل وما وسق ) أي : جمع كأنه أقسم بالضياء والظلام\nوقال ابن جرير أقسم الله بالنهار مدبرا وبالليل مقبلا . وقال ابن جرير وقال آخرون الشفق اسم للحمرة والبياض . وقالوا هو من الأضداد .\nقال ابن عباس ومجاهد والحسن وقتادة : ( وما وسق ) وما جمع قال قتادة وما جمع من نجم ودابة واستشهد ابن عباس بقول الشاعر :\nمستوسقات لو تجدن سائقا\nقد قال عكرمة ( والليل وما وسق ) يقول ما ساق من ظلمة إذا كان الليل ذهب كل شيء إلى مأواه"
  }, {
    "id" : 18,
    "eya" : "وَالْقَمَرِ إِذَا اتَّسَقَ (18) ",
    "tafsir" : "( والقمر إذا اتسق ) قال ابن عباس إذا اجتمع واستوى وكذا قال عكرمة ومجاهد وسعيد بن جبير ومسروق وأبو صالح والضحاك وابن زيد( والقمر إذا اتسق ) إذا استوى وقال الحسن إذا اجتمع إذا امتلأ وقال قتادة إذا استدار\nومعنى كلامهم أنه إذا تكامل نوره وأبدر جعله مقابلا لليل وما وسق"
  }, {
    "id" : 19,
    "eya" : "لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍ (19) ",
    "tafsir" : "( لتركبن طبقا عن طبق ) قال البخاري أخبرنا سعيد بن النضر أخبرنا هشيم أخبرنا أبو بشر عن مجاهد قال : قال ابن عباس ( لتركبن طبقا عن طبق ) حالا بعد حال قال هذا نبيكم صلى الله عليه وسلم\nهكذا رواه البخاري بهذا اللفظ ، وهو محتمل أن يكون ابن عباس أسند هذا التفسير عن النبي صلى الله عليه وسلم كأنه قال سمعت هذا من نبيكم صلى الله عليه وسلم فيكون قوله : نبيكم مرفوعا على الفاعلية من قال وهو الأظهر والله أعلم كما قال أنس لا يأتي عام إلا والذي بعده شر منه سمعته من نبيكم صلى الله عليه وسلم\nوقال ابن جرير حدثني يعقوب بن إبراهيم حدثنا هشيم أخبرنا أبو بشر عن مجاهد أن ابن عباس كان يقول ( لتركبن طبقا عن طبق ) قال يعني نبيكم صلى الله عليه وسلم يقول حالا بعد حال وهذا لفظه .\nوقال علي بن أبي طلحة عن ابن عباس ( طبقا عن طبق ) حالا بعد حال وكذا قال عكرمة ومرة الطيب ومجاهد والحسن والضحاك ومسروق وأبو صالح .\nويحتمل أن يكون المراد ( لتركبن طبقا عن طبق ) حالا بعد حال قال : هذا يعني : المراد بهذا نبيكم صلى الله عليه وسلم فيكون مرفوعا على أن هذا و \" نبيكم يكونان مبتدأ وخبرا والله أعلم ولعل هذا قد يكون هو المتبادر إلى كثير من الرواة كما قال أبو داود الطيالسي وغندر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس ( لتركبن طبقا عن طبق ) قال : محمد صلى الله عليه وسلم ويؤيد هذا المعنى قراءة عمر وابن مسعود وابن عباس وعامة أهل مكة والكوفة لتركبن بفتح التاء والباء\nقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن إسماعيل عن الشعبي ( لتركبن طبقا عن طبق ) قال لتركبن يا محمد سماء بعد سماء وهكذا روي عن ابن مسعود ومسروق وأبي العالية ( طبقا عن طبق ) سماء بعد سماء\nقلت يعنون ليلة الإسراء\nوقال أبو إسحاق والسدي عن رجل عن ابن عباس ( طبقا عن طبق ) منزلا على منزل وكذا رواه العوفي عن ابن عباس مثله وزاد ويقال أمرا بعد أمر وحالا بعد حال\nوقال السدي نفسه ( لتركبن طبقا عن طبق ) أعمال من قبلكم منزلا بعد منزل\nقلت كأنه أراد معنى الحديث الصحيح لتركبن سنن من كان قبلكم حذو القذة بالقذة حتى لو دخلوا جحر ضب لدخلتموه قالوا يا رسول الله اليهود والنصارى قال : فمن وهذا محتمل\nوقال ابن أبي حاتم حدثنا أبي ، حدثنا هشام بن عمار حدثنا صدقة حدثنا ابن جابر أنه سمع مكحولا يقول في قول الله ( لتركبن طبقا عن طبق ) قال في كل عشرين سنة تحدثون أمرا لم تكونوا عليه\nوقال الأعمش حدثني إبراهيم قال : قال عبد الله ( لتركبن طبقا عن طبق ) قال السماء تنشق ثم تحمر ثم تكون لونا بعد لون\nوقال الثوري عن قيس بن وهب عن مرة عن ابن مسعود ( طبقا عن طبق ) قال السماء مرة كالدهان ومرة تنشق\nوروى البزار من طريق جابر الجعفي عن الشعبي عن علقمة عن عبد الله بن مسعود ( لتركبن طبقا عن طبق ) يا محمد يعني حالا بعد حال ثم قال ورواه جابر عن مجاهد عن ابن عباس\nوقال سعيد بن جبير ( لتركبن طبقا عن طبق ) قال قوم كانوا في الدنيا خسيس أمرهم فارتفعوا في الآخرة وآخرون كانوا أشرافا في الدنيا فاتضعوا في الآخرة( طبقا عن طبق ) حالا بعد حال فطيما بعدما كان رضيعا وشيخا بعدما كان شابا\nوقال الحسن البصري ( طبقا عن طبق ) يقول حالا بعد حال رخاء بعد شدة وشدة بعد رخاء وغنى بعد فقر وفقرا بعد غنى وصحة بعد سقم وسقما بعد صحة\nوقال ابن أبي حاتم ذكر عن عبد الله بن زاهر حدثني أبي ، عن عمرو بن شمر عن جابر هو الجعفي عن محمد بن علي عن جابر بن عبد الله قال سمعت رسول الله صلى الله عليه وسلم - يقول إن ابن آدم لفي غفلة مما خلق له إن الله إذا أراد خلقه قال للملك اكتب رزقه اكتب أجله اكتب أثره اكتب شقيا أو سعيدا ثم يرتفع ذلك الملك ويبعث الله إليه ملكا آخر فيحفظه حتى يدرك ثم يرتفع ذلك الملك ثم يوكل الله به ملكين يكتبان حسناته وسيئاته فإذا حضره الموت ارتفع ذانك الملكان وجاءه ملك الموت فقبض روحه فإذا دخل قبره رد الروح في جسده ثم ارتفع ملك الموت وجاءه ملكا القبر فامتحناه ثم يرتفعان فإذا قامت الساعة انحط عليه ملك الحسنات وملك السيئات فانتشطا كتابا معقودا في عنقه ثم حضرا معه واحد سائقا وآخر شهيدا ثم قال الله عز وجل ( لقد كنت في غفلة من هذا ) [ ق : 22 قال رسول الله صلى الله عليه وسلم ( لتركبن طبقا عن طبق ) قال حالا بعد حال ثم قال النبي صلى الله عليه وسلم إن قدامكم لأمرا عظيما لا تقدرونه فاستعينوا بالله العظيم .\nهذا حديث منكر وإسناده فيه ضعفاء ولكن معناه صحيح ، والله سبحانه وتعالى أعلم\nثم قال ابن جرير بعدما حكى أقوال الناس في هذه الآية من القراء والمفسرين والصواب من التأويل قول من قال لتركبن أنت - يا محمد حالا بعد حال وأمرا بعد أمر من الشدائد والمراد بذلك وإن كان الخطاب إلى رسول الله صلى الله عليه وسلم موجها جميع الناس وأنهم يلقون من شدائد يوم القيامة وأهواله أحوالا ."
  }, {
    "id" : 20,
    "eya" : "فَمَا لَهُمْ لَا يُؤْمِنُونَ (20) ",
    "tafsir" : ""
  }, {
    "id" : 21,
    "eya" : "وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ ۩ (21) ",
    "tafsir" : ""
  }, {
    "id" : 22,
    "eya" : "بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ (22) ",
    "tafsir" : ""
  }, {
    "id" : 23,
    "eya" : "وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ (23) ",
    "tafsir" : ""
  }, {
    "id" : 24,
    "eya" : "فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ (24) ",
    "tafsir" : ""
  }, {
    "id" : 25,
    "eya" : "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ (25) ",
    "tafsir" : "( إلا الذين آمنوا وعملوا الصالحات ) هذا استثناء منقطع يعني لكن الذين آمنوا - أي بقلوبهم وعملوا الصالحات بجوارحهم ( لهم أجر ) أي في الدار الآخرة( غير ممنون ) قال ابن عباس غير منقوص وقال مجاهد والضحاك غير محسوب\nوحاصل قولهما أنه غير مقطوع كما قال تعالى ( عطاء غير مجذوذ ) هود 108 وقال السدي قال بعضهم ( غير ممنون ) غير منقوص وقال بعضهم ( غير ممنون )\nوهذا القول الآخر عن بعضهم قد أنكره غير واحد فإن الله عز وجل له المنة على أهل الجنة في كل حال وآن ولحظة وإنما دخلوها بفضله ورحمته لا بأعمالهم فله عليهم المنة دائما سرمدا والحمد لله وحده أبدا ولهذا يلهمون تسبيحه وتحميده كما يلهمون النفس ( وآخر دعواهم أن الحمد لله رب العالمين ) يونس : 10\nآخر تفسير سورة الانشقاق ولله الحمد"
  } ]
}